/* automatically generated by rust-bindgen 0.72.0 */

pub const CRYPTOKI_VERSION_MAJOR: CK_BYTE = 3;
pub const CRYPTOKI_VERSION_MINOR: CK_BYTE = 2;
pub const CRYPTOKI_VERSION_AMENDMENT: CK_BYTE = 0;
pub const CK_EFFECTIVELY_INFINITE: CK_ULONG = 0;
pub const CK_INVALID_HANDLE: CK_ULONG = 0;
pub const CK_TRUE: CK_BBOOL = 1;
pub const CK_FALSE: CK_BBOOL = 0;
pub const CK_CERTIFICATE_CATEGORY_UNSPECIFIED: CK_ULONG = 0;
pub const CK_CERTIFICATE_CATEGORY_TOKEN_USER: CK_ULONG = 1;
pub const CK_CERTIFICATE_CATEGORY_AUTHORITY: CK_ULONG = 2;
pub const CK_CERTIFICATE_CATEGORY_OTHER_ENTITY: CK_ULONG = 3;
pub const CK_OTP_VALUE: CK_ULONG = 0;
pub const CK_OTP_PIN: CK_ULONG = 1;
pub const CK_OTP_CHALLENGE: CK_ULONG = 2;
pub const CK_OTP_TIME: CK_ULONG = 3;
pub const CK_OTP_COUNTER: CK_ULONG = 4;
pub const CK_OTP_FLAGS: CK_ULONG = 5;
pub const CK_OTP_OUTPUT_LENGTH: CK_ULONG = 6;
pub const CK_OTP_OUTPUT_FORMAT: CK_ULONG = 7;
pub const CK_OTP_FORMAT_DECIMAL: CK_ULONG = 0;
pub const CK_OTP_FORMAT_HEXADECIMAL: CK_ULONG = 1;
pub const CK_OTP_FORMAT_ALPHANUMERIC: CK_ULONG = 2;
pub const CK_OTP_FORMAT_BINARY: CK_ULONG = 3;
pub const CK_OTP_PARAM_IGNORED: CK_ULONG = 0;
pub const CK_OTP_PARAM_OPTIONAL: CK_ULONG = 1;
pub const CK_OTP_PARAM_MANDATORY: CK_ULONG = 2;
pub const CK_SECURITY_DOMAIN_UNSPECIFIED: CK_ULONG = 0;
pub const CK_SECURITY_DOMAIN_MANUFACTURER: CK_ULONG = 1;
pub const CK_SECURITY_DOMAIN_OPERATOR: CK_ULONG = 2;
pub const CK_SECURITY_DOMAIN_THIRD_PARTY: CK_ULONG = 3;

pub type CK_X9_42_DH_KDF_TYPE_PTR = *mut CK_X9_42_DH_KDF_TYPE;
pub type CK_XEDDSA_HASH_TYPE = CK_ULONG;
pub type CK_XEDDSA_HASH_TYPE_PTR = *mut CK_XEDDSA_HASH_TYPE;
pub type CK_XMSSMT_PARAMETER_SET_TYPE = CK_ULONG;
pub type CK_XMSSMT_PARAMETER_SET_TYPE_PTR = *mut CK_XMSSMT_PARAMETER_SET_TYPE;
pub type CK_XMSS_PARAMETER_SET_TYPE = CK_ULONG;
pub type CK_XMSS_PARAMETER_SET_TYPE_PTR = *mut CK_XMSS_PARAMETER_SET_TYPE;
pub type CK_ATTRIBUTE_PTR = *mut CK_ATTRIBUTE;
pub type CK_ATTRIBUTE_PTR_PTR = *mut *mut CK_ATTRIBUTE;
pub type CK_C_INITIALIZE_ARGS_PTR = *mut CK_C_INITIALIZE_ARGS;
pub type CK_C_INITIALIZE_ARGS_PTR_PTR = *mut *mut CK_C_INITIALIZE_ARGS;
pub type CK_DATE_PTR = *mut CK_DATE;
pub type CK_DATE_PTR_PTR = *mut *mut CK_DATE;
pub type CK_DERIVED_KEY_PTR = *mut CK_DERIVED_KEY;
pub type CK_DERIVED_KEY_PTR_PTR = *mut *mut CK_DERIVED_KEY;
pub type CK_FUNCTION_LIST_PTR = *mut CK_FUNCTION_LIST;
pub type CK_FUNCTION_LIST_PTR_PTR = *mut *mut CK_FUNCTION_LIST;
pub type CK_FUNCTION_LIST_3_0_PTR = *mut CK_FUNCTION_LIST_3_0;
pub type CK_FUNCTION_LIST_3_0_PTR_PTR = *mut *mut CK_FUNCTION_LIST_3_0;
pub type CK_FUNCTION_LIST_3_2_PTR = *mut CK_FUNCTION_LIST_3_2;
pub type CK_FUNCTION_LIST_3_2_PTR_PTR = *mut *mut CK_FUNCTION_LIST_3_2;
pub type CK_INFO_PTR = *mut CK_INFO;
pub type CK_INFO_PTR_PTR = *mut *mut CK_INFO;
pub type CK_INTERFACE_PTR = *mut CK_INTERFACE;
pub type CK_INTERFACE_PTR_PTR = *mut *mut CK_INTERFACE;
pub type CK_MECHANISM_PTR = *mut CK_MECHANISM;
pub type CK_MECHANISM_PTR_PTR = *mut *mut CK_MECHANISM;
pub type CK_MECHANISM_INFO_PTR = *mut CK_MECHANISM_INFO;
pub type CK_MECHANISM_INFO_PTR_PTR = *mut *mut CK_MECHANISM_INFO;
pub type CK_SESSION_INFO_PTR = *mut CK_SESSION_INFO;
pub type CK_SESSION_INFO_PTR_PTR = *mut *mut CK_SESSION_INFO;
pub type CK_SLOT_INFO_PTR = *mut CK_SLOT_INFO;
pub type CK_SLOT_INFO_PTR_PTR = *mut *mut CK_SLOT_INFO;
pub type CK_TOKEN_INFO_PTR = *mut CK_TOKEN_INFO;
pub type CK_TOKEN_INFO_PTR_PTR = *mut *mut CK_TOKEN_INFO;
pub type CK_VERSION_PTR = *mut CK_VERSION;
pub type CK_VERSION_PTR_PTR = *mut *mut CK_VERSION;
pub type CK_NOTIFY = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_NOTIFICATION,
        arg3: *mut ::std::os::raw::c_void,
    ) -> CK_RV,
>;
pub type CK_CREATEMUTEX =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_DESTROYMUTEX =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_LOCKMUTEX =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_UNLOCKMUTEX =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> CK_RV>;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ATTRIBUTE {
    pub type_: CK_ATTRIBUTE_TYPE,
    pub pValue: *mut ::std::os::raw::c_void,
    pub ulValueLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ATTRIBUTE"][::std::mem::size_of::<CK_ATTRIBUTE>() - 16usize];
    ["Alignment of CK_ATTRIBUTE"][::std::mem::align_of::<CK_ATTRIBUTE>() - 1usize];
    ["Offset of field: CK_ATTRIBUTE::type_"][::std::mem::offset_of!(CK_ATTRIBUTE, type_) - 0usize];
    ["Offset of field: CK_ATTRIBUTE::pValue"]
        [::std::mem::offset_of!(CK_ATTRIBUTE, pValue) - 4usize];
    ["Offset of field: CK_ATTRIBUTE::ulValueLen"]
        [::std::mem::offset_of!(CK_ATTRIBUTE, ulValueLen) - 12usize];
};
impl Default for CK_ATTRIBUTE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_C_INITIALIZE_ARGS {
    pub CreateMutex: CK_CREATEMUTEX,
    pub DestroyMutex: CK_DESTROYMUTEX,
    pub LockMutex: CK_LOCKMUTEX,
    pub UnlockMutex: CK_UNLOCKMUTEX,
    pub flags: CK_FLAGS,
    pub pReserved: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_C_INITIALIZE_ARGS"][::std::mem::size_of::<CK_C_INITIALIZE_ARGS>() - 44usize];
    ["Alignment of CK_C_INITIALIZE_ARGS"][::std::mem::align_of::<CK_C_INITIALIZE_ARGS>() - 1usize];
    ["Offset of field: CK_C_INITIALIZE_ARGS::CreateMutex"]
        [::std::mem::offset_of!(CK_C_INITIALIZE_ARGS, CreateMutex) - 0usize];
    ["Offset of field: CK_C_INITIALIZE_ARGS::DestroyMutex"]
        [::std::mem::offset_of!(CK_C_INITIALIZE_ARGS, DestroyMutex) - 8usize];
    ["Offset of field: CK_C_INITIALIZE_ARGS::LockMutex"]
        [::std::mem::offset_of!(CK_C_INITIALIZE_ARGS, LockMutex) - 16usize];
    ["Offset of field: CK_C_INITIALIZE_ARGS::UnlockMutex"]
        [::std::mem::offset_of!(CK_C_INITIALIZE_ARGS, UnlockMutex) - 24usize];
    ["Offset of field: CK_C_INITIALIZE_ARGS::flags"]
        [::std::mem::offset_of!(CK_C_INITIALIZE_ARGS, flags) - 32usize];
    ["Offset of field: CK_C_INITIALIZE_ARGS::pReserved"]
        [::std::mem::offset_of!(CK_C_INITIALIZE_ARGS, pReserved) - 36usize];
};
impl Default for CK_C_INITIALIZE_ARGS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_DATE {
    pub year: [CK_CHAR; 4usize],
    pub month: [CK_CHAR; 2usize],
    pub day: [CK_CHAR; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_DATE"][::std::mem::size_of::<CK_DATE>() - 8usize];
    ["Alignment of CK_DATE"][::std::mem::align_of::<CK_DATE>() - 1usize];
    ["Offset of field: CK_DATE::year"][::std::mem::offset_of!(CK_DATE, year) - 0usize];
    ["Offset of field: CK_DATE::month"][::std::mem::offset_of!(CK_DATE, month) - 4usize];
    ["Offset of field: CK_DATE::day"][::std::mem::offset_of!(CK_DATE, day) - 6usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_DERIVED_KEY {
    pub pTemplate: *mut CK_ATTRIBUTE,
    pub ulAttributeCount: CK_ULONG,
    pub phKey: *mut CK_OBJECT_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_DERIVED_KEY"][::std::mem::size_of::<CK_DERIVED_KEY>() - 20usize];
    ["Alignment of CK_DERIVED_KEY"][::std::mem::align_of::<CK_DERIVED_KEY>() - 1usize];
    ["Offset of field: CK_DERIVED_KEY::pTemplate"]
        [::std::mem::offset_of!(CK_DERIVED_KEY, pTemplate) - 0usize];
    ["Offset of field: CK_DERIVED_KEY::ulAttributeCount"]
        [::std::mem::offset_of!(CK_DERIVED_KEY, ulAttributeCount) - 8usize];
    ["Offset of field: CK_DERIVED_KEY::phKey"]
        [::std::mem::offset_of!(CK_DERIVED_KEY, phKey) - 12usize];
};
impl Default for CK_DERIVED_KEY {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_VERSION {
    pub major: CK_BYTE,
    pub minor: CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_VERSION"][::std::mem::size_of::<CK_VERSION>() - 2usize];
    ["Alignment of CK_VERSION"][::std::mem::align_of::<CK_VERSION>() - 1usize];
    ["Offset of field: CK_VERSION::major"][::std::mem::offset_of!(CK_VERSION, major) - 0usize];
    ["Offset of field: CK_VERSION::minor"][::std::mem::offset_of!(CK_VERSION, minor) - 1usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_INFO {
    pub cryptokiVersion: CK_VERSION,
    pub manufacturerID: [CK_UTF8CHAR; 32usize],
    pub flags: CK_FLAGS,
    pub libraryDescription: [CK_UTF8CHAR; 32usize],
    pub libraryVersion: CK_VERSION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_INFO"][::std::mem::size_of::<CK_INFO>() - 72usize];
    ["Alignment of CK_INFO"][::std::mem::align_of::<CK_INFO>() - 1usize];
    ["Offset of field: CK_INFO::cryptokiVersion"]
        [::std::mem::offset_of!(CK_INFO, cryptokiVersion) - 0usize];
    ["Offset of field: CK_INFO::manufacturerID"]
        [::std::mem::offset_of!(CK_INFO, manufacturerID) - 2usize];
    ["Offset of field: CK_INFO::flags"][::std::mem::offset_of!(CK_INFO, flags) - 34usize];
    ["Offset of field: CK_INFO::libraryDescription"]
        [::std::mem::offset_of!(CK_INFO, libraryDescription) - 38usize];
    ["Offset of field: CK_INFO::libraryVersion"]
        [::std::mem::offset_of!(CK_INFO, libraryVersion) - 70usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_INTERFACE {
    pub pInterfaceName: *mut CK_UTF8CHAR,
    pub pFunctionList: *mut ::std::os::raw::c_void,
    pub flags: CK_FLAGS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_INTERFACE"][::std::mem::size_of::<CK_INTERFACE>() - 20usize];
    ["Alignment of CK_INTERFACE"][::std::mem::align_of::<CK_INTERFACE>() - 1usize];
    ["Offset of field: CK_INTERFACE::pInterfaceName"]
        [::std::mem::offset_of!(CK_INTERFACE, pInterfaceName) - 0usize];
    ["Offset of field: CK_INTERFACE::pFunctionList"]
        [::std::mem::offset_of!(CK_INTERFACE, pFunctionList) - 8usize];
    ["Offset of field: CK_INTERFACE::flags"][::std::mem::offset_of!(CK_INTERFACE, flags) - 16usize];
};
impl Default for CK_INTERFACE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_MECHANISM {
    pub mechanism: CK_MECHANISM_TYPE,
    pub pParameter: *mut ::std::os::raw::c_void,
    pub ulParameterLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_MECHANISM"][::std::mem::size_of::<CK_MECHANISM>() - 16usize];
    ["Alignment of CK_MECHANISM"][::std::mem::align_of::<CK_MECHANISM>() - 1usize];
    ["Offset of field: CK_MECHANISM::mechanism"]
        [::std::mem::offset_of!(CK_MECHANISM, mechanism) - 0usize];
    ["Offset of field: CK_MECHANISM::pParameter"]
        [::std::mem::offset_of!(CK_MECHANISM, pParameter) - 4usize];
    ["Offset of field: CK_MECHANISM::ulParameterLen"]
        [::std::mem::offset_of!(CK_MECHANISM, ulParameterLen) - 12usize];
};
impl Default for CK_MECHANISM {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_MECHANISM_INFO {
    pub ulMinKeySize: CK_ULONG,
    pub ulMaxKeySize: CK_ULONG,
    pub flags: CK_FLAGS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_MECHANISM_INFO"][::std::mem::size_of::<CK_MECHANISM_INFO>() - 12usize];
    ["Alignment of CK_MECHANISM_INFO"][::std::mem::align_of::<CK_MECHANISM_INFO>() - 1usize];
    ["Offset of field: CK_MECHANISM_INFO::ulMinKeySize"]
        [::std::mem::offset_of!(CK_MECHANISM_INFO, ulMinKeySize) - 0usize];
    ["Offset of field: CK_MECHANISM_INFO::ulMaxKeySize"]
        [::std::mem::offset_of!(CK_MECHANISM_INFO, ulMaxKeySize) - 4usize];
    ["Offset of field: CK_MECHANISM_INFO::flags"]
        [::std::mem::offset_of!(CK_MECHANISM_INFO, flags) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_SESSION_INFO {
    pub slotID: CK_SLOT_ID,
    pub state: CK_STATE,
    pub flags: CK_FLAGS,
    pub ulDeviceError: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SESSION_INFO"][::std::mem::size_of::<CK_SESSION_INFO>() - 16usize];
    ["Alignment of CK_SESSION_INFO"][::std::mem::align_of::<CK_SESSION_INFO>() - 1usize];
    ["Offset of field: CK_SESSION_INFO::slotID"]
        [::std::mem::offset_of!(CK_SESSION_INFO, slotID) - 0usize];
    ["Offset of field: CK_SESSION_INFO::state"]
        [::std::mem::offset_of!(CK_SESSION_INFO, state) - 4usize];
    ["Offset of field: CK_SESSION_INFO::flags"]
        [::std::mem::offset_of!(CK_SESSION_INFO, flags) - 8usize];
    ["Offset of field: CK_SESSION_INFO::ulDeviceError"]
        [::std::mem::offset_of!(CK_SESSION_INFO, ulDeviceError) - 12usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SLOT_INFO {
    pub slotDescription: [CK_UTF8CHAR; 64usize],
    pub manufacturerID: [CK_UTF8CHAR; 32usize],
    pub flags: CK_FLAGS,
    pub hardwareVersion: CK_VERSION,
    pub firmwareVersion: CK_VERSION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SLOT_INFO"][::std::mem::size_of::<CK_SLOT_INFO>() - 104usize];
    ["Alignment of CK_SLOT_INFO"][::std::mem::align_of::<CK_SLOT_INFO>() - 1usize];
    ["Offset of field: CK_SLOT_INFO::slotDescription"]
        [::std::mem::offset_of!(CK_SLOT_INFO, slotDescription) - 0usize];
    ["Offset of field: CK_SLOT_INFO::manufacturerID"]
        [::std::mem::offset_of!(CK_SLOT_INFO, manufacturerID) - 64usize];
    ["Offset of field: CK_SLOT_INFO::flags"][::std::mem::offset_of!(CK_SLOT_INFO, flags) - 96usize];
    ["Offset of field: CK_SLOT_INFO::hardwareVersion"]
        [::std::mem::offset_of!(CK_SLOT_INFO, hardwareVersion) - 100usize];
    ["Offset of field: CK_SLOT_INFO::firmwareVersion"]
        [::std::mem::offset_of!(CK_SLOT_INFO, firmwareVersion) - 102usize];
};
impl Default for CK_SLOT_INFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_TOKEN_INFO {
    pub label: [CK_UTF8CHAR; 32usize],
    pub manufacturerID: [CK_UTF8CHAR; 32usize],
    pub model: [CK_UTF8CHAR; 16usize],
    pub serialNumber: [CK_CHAR; 16usize],
    pub flags: CK_FLAGS,
    pub ulMaxSessionCount: CK_ULONG,
    pub ulSessionCount: CK_ULONG,
    pub ulMaxRwSessionCount: CK_ULONG,
    pub ulRwSessionCount: CK_ULONG,
    pub ulMaxPinLen: CK_ULONG,
    pub ulMinPinLen: CK_ULONG,
    pub ulTotalPublicMemory: CK_ULONG,
    pub ulFreePublicMemory: CK_ULONG,
    pub ulTotalPrivateMemory: CK_ULONG,
    pub ulFreePrivateMemory: CK_ULONG,
    pub hardwareVersion: CK_VERSION,
    pub firmwareVersion: CK_VERSION,
    pub utcTime: [CK_CHAR; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_TOKEN_INFO"][::std::mem::size_of::<CK_TOKEN_INFO>() - 160usize];
    ["Alignment of CK_TOKEN_INFO"][::std::mem::align_of::<CK_TOKEN_INFO>() - 1usize];
    ["Offset of field: CK_TOKEN_INFO::label"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, label) - 0usize];
    ["Offset of field: CK_TOKEN_INFO::manufacturerID"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, manufacturerID) - 32usize];
    ["Offset of field: CK_TOKEN_INFO::model"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, model) - 64usize];
    ["Offset of field: CK_TOKEN_INFO::serialNumber"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, serialNumber) - 80usize];
    ["Offset of field: CK_TOKEN_INFO::flags"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, flags) - 96usize];
    ["Offset of field: CK_TOKEN_INFO::ulMaxSessionCount"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulMaxSessionCount) - 100usize];
    ["Offset of field: CK_TOKEN_INFO::ulSessionCount"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulSessionCount) - 104usize];
    ["Offset of field: CK_TOKEN_INFO::ulMaxRwSessionCount"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulMaxRwSessionCount) - 108usize];
    ["Offset of field: CK_TOKEN_INFO::ulRwSessionCount"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulRwSessionCount) - 112usize];
    ["Offset of field: CK_TOKEN_INFO::ulMaxPinLen"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulMaxPinLen) - 116usize];
    ["Offset of field: CK_TOKEN_INFO::ulMinPinLen"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulMinPinLen) - 120usize];
    ["Offset of field: CK_TOKEN_INFO::ulTotalPublicMemory"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulTotalPublicMemory) - 124usize];
    ["Offset of field: CK_TOKEN_INFO::ulFreePublicMemory"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulFreePublicMemory) - 128usize];
    ["Offset of field: CK_TOKEN_INFO::ulTotalPrivateMemory"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulTotalPrivateMemory) - 132usize];
    ["Offset of field: CK_TOKEN_INFO::ulFreePrivateMemory"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, ulFreePrivateMemory) - 136usize];
    ["Offset of field: CK_TOKEN_INFO::hardwareVersion"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, hardwareVersion) - 140usize];
    ["Offset of field: CK_TOKEN_INFO::firmwareVersion"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, firmwareVersion) - 142usize];
    ["Offset of field: CK_TOKEN_INFO::utcTime"]
        [::std::mem::offset_of!(CK_TOKEN_INFO, utcTime) - 144usize];
};
pub type CK_AES_CBC_ENCRYPT_DATA_PARAMS_PTR = *mut CK_AES_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_AES_CBC_ENCRYPT_DATA_PARAMS_PTR_PTR = *mut *mut CK_AES_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_AES_CCM_PARAMS_PTR = *mut CK_AES_CCM_PARAMS;
pub type CK_AES_CCM_PARAMS_PTR_PTR = *mut *mut CK_AES_CCM_PARAMS;
pub type CK_AES_CTR_PARAMS_PTR = *mut CK_AES_CTR_PARAMS;
pub type CK_AES_CTR_PARAMS_PTR_PTR = *mut *mut CK_AES_CTR_PARAMS;
pub type CK_AES_GCM_PARAMS_PTR = *mut CK_AES_GCM_PARAMS;
pub type CK_AES_GCM_PARAMS_PTR_PTR = *mut *mut CK_AES_GCM_PARAMS;
pub type CK_ARIA_CBC_ENCRYPT_DATA_PARAMS_PTR = *mut CK_ARIA_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_ARIA_CBC_ENCRYPT_DATA_PARAMS_PTR_PTR = *mut *mut CK_ARIA_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_ASYNC_DATA_PTR = *mut CK_ASYNC_DATA;
pub type CK_ASYNC_DATA_PTR_PTR = *mut *mut CK_ASYNC_DATA;
pub type CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS_PTR = *mut CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS_PTR_PTR =
    *mut *mut CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_CAMELLIA_CTR_PARAMS_PTR = *mut CK_CAMELLIA_CTR_PARAMS;
pub type CK_CAMELLIA_CTR_PARAMS_PTR_PTR = *mut *mut CK_CAMELLIA_CTR_PARAMS;
pub type CK_CCM_MESSAGE_PARAMS_PTR = *mut CK_CCM_MESSAGE_PARAMS;
pub type CK_CCM_MESSAGE_PARAMS_PTR_PTR = *mut *mut CK_CCM_MESSAGE_PARAMS;
pub type CK_CCM_PARAMS_PTR = *mut CK_CCM_PARAMS;
pub type CK_CCM_PARAMS_PTR_PTR = *mut *mut CK_CCM_PARAMS;
pub type CK_CCM_WRAP_PARAMS_PTR = *mut CK_CCM_WRAP_PARAMS;
pub type CK_CCM_WRAP_PARAMS_PTR_PTR = *mut *mut CK_CCM_WRAP_PARAMS;
pub type CK_CHACHA20_PARAMS_PTR = *mut CK_CHACHA20_PARAMS;
pub type CK_CHACHA20_PARAMS_PTR_PTR = *mut *mut CK_CHACHA20_PARAMS;
pub type CK_CMS_SIG_PARAMS_PTR = *mut CK_CMS_SIG_PARAMS;
pub type CK_CMS_SIG_PARAMS_PTR_PTR = *mut *mut CK_CMS_SIG_PARAMS;
pub type CK_DES_CBC_ENCRYPT_DATA_PARAMS_PTR = *mut CK_DES_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_DES_CBC_ENCRYPT_DATA_PARAMS_PTR_PTR = *mut *mut CK_DES_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_DSA_PARAMETER_GEN_PARAM_PTR = *mut CK_DSA_PARAMETER_GEN_PARAM;
pub type CK_DSA_PARAMETER_GEN_PARAM_PTR_PTR = *mut *mut CK_DSA_PARAMETER_GEN_PARAM;
pub type CK_ECDH_AES_KEY_WRAP_PARAMS_PTR = *mut CK_ECDH_AES_KEY_WRAP_PARAMS;
pub type CK_ECDH_AES_KEY_WRAP_PARAMS_PTR_PTR = *mut *mut CK_ECDH_AES_KEY_WRAP_PARAMS;
pub type CK_ECDH1_DERIVE_PARAMS_PTR = *mut CK_ECDH1_DERIVE_PARAMS;
pub type CK_ECDH1_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_ECDH1_DERIVE_PARAMS;
pub type CK_ECDH2_DERIVE_PARAMS_PTR = *mut CK_ECDH2_DERIVE_PARAMS;
pub type CK_ECDH2_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_ECDH2_DERIVE_PARAMS;
pub type CK_ECMQV_DERIVE_PARAMS_PTR = *mut CK_ECMQV_DERIVE_PARAMS;
pub type CK_ECMQV_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_ECMQV_DERIVE_PARAMS;
pub type CK_EDDSA_PARAMS_PTR = *mut CK_EDDSA_PARAMS;
pub type CK_EDDSA_PARAMS_PTR_PTR = *mut *mut CK_EDDSA_PARAMS;
pub type CK_GCM_MESSAGE_PARAMS_PTR = *mut CK_GCM_MESSAGE_PARAMS;
pub type CK_GCM_MESSAGE_PARAMS_PTR_PTR = *mut *mut CK_GCM_MESSAGE_PARAMS;
pub type CK_GCM_PARAMS_PTR = *mut CK_GCM_PARAMS;
pub type CK_GCM_PARAMS_PTR_PTR = *mut *mut CK_GCM_PARAMS;
pub type CK_GCM_WRAP_PARAMS_PTR = *mut CK_GCM_WRAP_PARAMS;
pub type CK_GCM_WRAP_PARAMS_PTR_PTR = *mut *mut CK_GCM_WRAP_PARAMS;
pub type CK_GOSTR3410_DERIVE_PARAMS_PTR = *mut CK_GOSTR3410_DERIVE_PARAMS;
pub type CK_GOSTR3410_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_GOSTR3410_DERIVE_PARAMS;
pub type CK_GOSTR3410_KEY_WRAP_PARAMS_PTR = *mut CK_GOSTR3410_KEY_WRAP_PARAMS;
pub type CK_GOSTR3410_KEY_WRAP_PARAMS_PTR_PTR = *mut *mut CK_GOSTR3410_KEY_WRAP_PARAMS;
pub type CK_HASH_SIGN_ADDITIONAL_CONTEXT_PTR = *mut CK_HASH_SIGN_ADDITIONAL_CONTEXT;
pub type CK_HASH_SIGN_ADDITIONAL_CONTEXT_PTR_PTR = *mut *mut CK_HASH_SIGN_ADDITIONAL_CONTEXT;
pub type CK_HKDF_PARAMS_PTR = *mut CK_HKDF_PARAMS;
pub type CK_HKDF_PARAMS_PTR_PTR = *mut *mut CK_HKDF_PARAMS;
pub type CK_IKE_PRF_DERIVE_PARAMS_PTR = *mut CK_IKE_PRF_DERIVE_PARAMS;
pub type CK_IKE_PRF_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_IKE_PRF_DERIVE_PARAMS;
pub type CK_IKE1_EXTENDED_DERIVE_PARAMS_PTR = *mut CK_IKE1_EXTENDED_DERIVE_PARAMS;
pub type CK_IKE1_EXTENDED_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_IKE1_EXTENDED_DERIVE_PARAMS;
pub type CK_IKE1_PRF_DERIVE_PARAMS_PTR = *mut CK_IKE1_PRF_DERIVE_PARAMS;
pub type CK_IKE1_PRF_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_IKE1_PRF_DERIVE_PARAMS;
pub type CK_IKE2_PRF_PLUS_DERIVE_PARAMS_PTR = *mut CK_IKE2_PRF_PLUS_DERIVE_PARAMS;
pub type CK_IKE2_PRF_PLUS_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_IKE2_PRF_PLUS_DERIVE_PARAMS;
pub type CK_KEA_DERIVE_PARAMS_PTR = *mut CK_KEA_DERIVE_PARAMS;
pub type CK_KEA_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_KEA_DERIVE_PARAMS;
pub type CK_KEY_DERIVATION_STRING_DATA_PTR = *mut CK_KEY_DERIVATION_STRING_DATA;
pub type CK_KEY_DERIVATION_STRING_DATA_PTR_PTR = *mut *mut CK_KEY_DERIVATION_STRING_DATA;
pub type CK_KEY_WRAP_SET_OAEP_PARAMS_PTR = *mut CK_KEY_WRAP_SET_OAEP_PARAMS;
pub type CK_KEY_WRAP_SET_OAEP_PARAMS_PTR_PTR = *mut *mut CK_KEY_WRAP_SET_OAEP_PARAMS;
pub type CK_KIP_PARAMS_PTR = *mut CK_KIP_PARAMS;
pub type CK_KIP_PARAMS_PTR_PTR = *mut *mut CK_KIP_PARAMS;
pub type CK_OTP_PARAM_PTR = *mut CK_OTP_PARAM;
pub type CK_OTP_PARAM_PTR_PTR = *mut *mut CK_OTP_PARAM;
pub type CK_OTP_PARAMS_PTR = *mut CK_OTP_PARAMS;
pub type CK_OTP_PARAMS_PTR_PTR = *mut *mut CK_OTP_PARAMS;
pub type CK_OTP_SIGNATURE_INFO_PTR = *mut CK_OTP_SIGNATURE_INFO;
pub type CK_OTP_SIGNATURE_INFO_PTR_PTR = *mut *mut CK_OTP_SIGNATURE_INFO;
pub type CK_PBE_PARAMS_PTR = *mut CK_PBE_PARAMS;
pub type CK_PBE_PARAMS_PTR_PTR = *mut *mut CK_PBE_PARAMS;
pub type CK_PKCS5_PBKD2_PARAMS_PTR = *mut CK_PKCS5_PBKD2_PARAMS;
pub type CK_PKCS5_PBKD2_PARAMS_PTR_PTR = *mut *mut CK_PKCS5_PBKD2_PARAMS;
pub type CK_PKCS5_PBKD2_PARAMS2_PTR = *mut CK_PKCS5_PBKD2_PARAMS2;
pub type CK_PKCS5_PBKD2_PARAMS2_PTR_PTR = *mut *mut CK_PKCS5_PBKD2_PARAMS2;
pub type CK_PRF_DATA_PARAM_PTR = *mut CK_PRF_DATA_PARAM;
pub type CK_PRF_DATA_PARAM_PTR_PTR = *mut *mut CK_PRF_DATA_PARAM;
pub type CK_RC2_CBC_PARAMS_PTR = *mut CK_RC2_CBC_PARAMS;
pub type CK_RC2_CBC_PARAMS_PTR_PTR = *mut *mut CK_RC2_CBC_PARAMS;
pub type CK_RC2_MAC_GENERAL_PARAMS_PTR = *mut CK_RC2_MAC_GENERAL_PARAMS;
pub type CK_RC2_MAC_GENERAL_PARAMS_PTR_PTR = *mut *mut CK_RC2_MAC_GENERAL_PARAMS;
pub type CK_RC5_CBC_PARAMS_PTR = *mut CK_RC5_CBC_PARAMS;
pub type CK_RC5_CBC_PARAMS_PTR_PTR = *mut *mut CK_RC5_CBC_PARAMS;
pub type CK_RC5_MAC_GENERAL_PARAMS_PTR = *mut CK_RC5_MAC_GENERAL_PARAMS;
pub type CK_RC5_MAC_GENERAL_PARAMS_PTR_PTR = *mut *mut CK_RC5_MAC_GENERAL_PARAMS;
pub type CK_RC5_PARAMS_PTR = *mut CK_RC5_PARAMS;
pub type CK_RC5_PARAMS_PTR_PTR = *mut *mut CK_RC5_PARAMS;
pub type CK_RSA_AES_KEY_WRAP_PARAMS_PTR = *mut CK_RSA_AES_KEY_WRAP_PARAMS;
pub type CK_RSA_AES_KEY_WRAP_PARAMS_PTR_PTR = *mut *mut CK_RSA_AES_KEY_WRAP_PARAMS;
pub type CK_RSA_PKCS_OAEP_PARAMS_PTR = *mut CK_RSA_PKCS_OAEP_PARAMS;
pub type CK_RSA_PKCS_OAEP_PARAMS_PTR_PTR = *mut *mut CK_RSA_PKCS_OAEP_PARAMS;
pub type CK_RSA_PKCS_PSS_PARAMS_PTR = *mut CK_RSA_PKCS_PSS_PARAMS;
pub type CK_RSA_PKCS_PSS_PARAMS_PTR_PTR = *mut *mut CK_RSA_PKCS_PSS_PARAMS;
pub type CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS_PTR = *mut CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS;
pub type CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS_PTR_PTR =
    *mut *mut CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS;
pub type CK_SALSA20_CHACHA20_POLY1305_PARAMS_PTR = *mut CK_SALSA20_CHACHA20_POLY1305_PARAMS;
pub type CK_SALSA20_CHACHA20_POLY1305_PARAMS_PTR_PTR =
    *mut *mut CK_SALSA20_CHACHA20_POLY1305_PARAMS;
pub type CK_SALSA20_PARAMS_PTR = *mut CK_SALSA20_PARAMS;
pub type CK_SALSA20_PARAMS_PTR_PTR = *mut *mut CK_SALSA20_PARAMS;
pub type CK_SEED_CBC_ENCRYPT_DATA_PARAMS_PTR = *mut CK_SEED_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_SEED_CBC_ENCRYPT_DATA_PARAMS_PTR_PTR = *mut *mut CK_SEED_CBC_ENCRYPT_DATA_PARAMS;
pub type CK_SIGN_ADDITIONAL_CONTEXT_PTR = *mut CK_SIGN_ADDITIONAL_CONTEXT;
pub type CK_SIGN_ADDITIONAL_CONTEXT_PTR_PTR = *mut *mut CK_SIGN_ADDITIONAL_CONTEXT;
pub type CK_SKIPJACK_PRIVATE_WRAP_PARAMS_PTR = *mut CK_SKIPJACK_PRIVATE_WRAP_PARAMS;
pub type CK_SKIPJACK_PRIVATE_WRAP_PARAMS_PTR_PTR = *mut *mut CK_SKIPJACK_PRIVATE_WRAP_PARAMS;
pub type CK_SKIPJACK_RELAYX_PARAMS_PTR = *mut CK_SKIPJACK_RELAYX_PARAMS;
pub type CK_SKIPJACK_RELAYX_PARAMS_PTR_PTR = *mut *mut CK_SKIPJACK_RELAYX_PARAMS;
pub type CK_SP800_108_COUNTER_FORMAT_PTR = *mut CK_SP800_108_COUNTER_FORMAT;
pub type CK_SP800_108_COUNTER_FORMAT_PTR_PTR = *mut *mut CK_SP800_108_COUNTER_FORMAT;
pub type CK_SP800_108_DKM_LENGTH_FORMAT_PTR = *mut CK_SP800_108_DKM_LENGTH_FORMAT;
pub type CK_SP800_108_DKM_LENGTH_FORMAT_PTR_PTR = *mut *mut CK_SP800_108_DKM_LENGTH_FORMAT;
pub type CK_SP800_108_FEEDBACK_KDF_PARAMS_PTR = *mut CK_SP800_108_FEEDBACK_KDF_PARAMS;
pub type CK_SP800_108_FEEDBACK_KDF_PARAMS_PTR_PTR = *mut *mut CK_SP800_108_FEEDBACK_KDF_PARAMS;
pub type CK_SP800_108_KDF_PARAMS_PTR = *mut CK_SP800_108_KDF_PARAMS;
pub type CK_SP800_108_KDF_PARAMS_PTR_PTR = *mut *mut CK_SP800_108_KDF_PARAMS;
pub type CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS_PTR =
    *mut CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS;
pub type CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS_PTR_PTR =
    *mut *mut CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS;
pub type CK_X2RATCHET_INITIALIZE_PARAMS_PTR = *mut CK_X2RATCHET_INITIALIZE_PARAMS;
pub type CK_X2RATCHET_INITIALIZE_PARAMS_PTR_PTR = *mut *mut CK_X2RATCHET_INITIALIZE_PARAMS;
pub type CK_X2RATCHET_RESPOND_PARAMS_PTR = *mut CK_X2RATCHET_RESPOND_PARAMS;
pub type CK_X2RATCHET_RESPOND_PARAMS_PTR_PTR = *mut *mut CK_X2RATCHET_RESPOND_PARAMS;
pub type CK_X3DH_INITIATE_PARAMS_PTR = *mut CK_X3DH_INITIATE_PARAMS;
pub type CK_X3DH_INITIATE_PARAMS_PTR_PTR = *mut *mut CK_X3DH_INITIATE_PARAMS;
pub type CK_X3DH_RESPOND_PARAMS_PTR = *mut CK_X3DH_RESPOND_PARAMS;
pub type CK_X3DH_RESPOND_PARAMS_PTR_PTR = *mut *mut CK_X3DH_RESPOND_PARAMS;
pub type CK_X9_42_DH1_DERIVE_PARAMS_PTR = *mut CK_X9_42_DH1_DERIVE_PARAMS;
pub type CK_X9_42_DH1_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_X9_42_DH1_DERIVE_PARAMS;
pub type CK_X9_42_DH2_DERIVE_PARAMS_PTR = *mut CK_X9_42_DH2_DERIVE_PARAMS;
pub type CK_X9_42_DH2_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_X9_42_DH2_DERIVE_PARAMS;
pub type CK_X9_42_MQV_DERIVE_PARAMS_PTR = *mut CK_X9_42_MQV_DERIVE_PARAMS;
pub type CK_X9_42_MQV_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_X9_42_MQV_DERIVE_PARAMS;
pub type CK_XEDDSA_PARAMS_PTR = *mut CK_XEDDSA_PARAMS;
pub type CK_XEDDSA_PARAMS_PTR_PTR = *mut *mut CK_XEDDSA_PARAMS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct specifiedParams {
    _unused: [u8; 0],
}
pub type specifiedParams_PTR = *mut specifiedParams;
pub type specifiedParams_PTR_PTR = *mut *mut specifiedParams;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_AES_CBC_ENCRYPT_DATA_PARAMS {
    pub iv: [CK_BYTE; 16usize],
    pub pData: *mut CK_BYTE,
    pub length: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_AES_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::size_of::<CK_AES_CBC_ENCRYPT_DATA_PARAMS>() - 28usize];
    ["Alignment of CK_AES_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::align_of::<CK_AES_CBC_ENCRYPT_DATA_PARAMS>() - 1usize];
    ["Offset of field: CK_AES_CBC_ENCRYPT_DATA_PARAMS::iv"]
        [::std::mem::offset_of!(CK_AES_CBC_ENCRYPT_DATA_PARAMS, iv) - 0usize];
    ["Offset of field: CK_AES_CBC_ENCRYPT_DATA_PARAMS::pData"]
        [::std::mem::offset_of!(CK_AES_CBC_ENCRYPT_DATA_PARAMS, pData) - 16usize];
    ["Offset of field: CK_AES_CBC_ENCRYPT_DATA_PARAMS::length"]
        [::std::mem::offset_of!(CK_AES_CBC_ENCRYPT_DATA_PARAMS, length) - 24usize];
};
impl Default for CK_AES_CBC_ENCRYPT_DATA_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_AES_CCM_PARAMS {
    pub ulDataLen: CK_ULONG,
    pub pNonce: *mut CK_BYTE,
    pub ulNonceLen: CK_ULONG,
    pub pAAD: *mut CK_BYTE,
    pub ulAADLen: CK_ULONG,
    pub ulMACLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_AES_CCM_PARAMS"][::std::mem::size_of::<CK_AES_CCM_PARAMS>() - 32usize];
    ["Alignment of CK_AES_CCM_PARAMS"][::std::mem::align_of::<CK_AES_CCM_PARAMS>() - 1usize];
    ["Offset of field: CK_AES_CCM_PARAMS::ulDataLen"]
        [::std::mem::offset_of!(CK_AES_CCM_PARAMS, ulDataLen) - 0usize];
    ["Offset of field: CK_AES_CCM_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_AES_CCM_PARAMS, pNonce) - 4usize];
    ["Offset of field: CK_AES_CCM_PARAMS::ulNonceLen"]
        [::std::mem::offset_of!(CK_AES_CCM_PARAMS, ulNonceLen) - 12usize];
    ["Offset of field: CK_AES_CCM_PARAMS::pAAD"]
        [::std::mem::offset_of!(CK_AES_CCM_PARAMS, pAAD) - 16usize];
    ["Offset of field: CK_AES_CCM_PARAMS::ulAADLen"]
        [::std::mem::offset_of!(CK_AES_CCM_PARAMS, ulAADLen) - 24usize];
    ["Offset of field: CK_AES_CCM_PARAMS::ulMACLen"]
        [::std::mem::offset_of!(CK_AES_CCM_PARAMS, ulMACLen) - 28usize];
};
impl Default for CK_AES_CCM_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_AES_CTR_PARAMS {
    pub ulCounterBits: CK_ULONG,
    pub cb: [CK_BYTE; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_AES_CTR_PARAMS"][::std::mem::size_of::<CK_AES_CTR_PARAMS>() - 20usize];
    ["Alignment of CK_AES_CTR_PARAMS"][::std::mem::align_of::<CK_AES_CTR_PARAMS>() - 1usize];
    ["Offset of field: CK_AES_CTR_PARAMS::ulCounterBits"]
        [::std::mem::offset_of!(CK_AES_CTR_PARAMS, ulCounterBits) - 0usize];
    ["Offset of field: CK_AES_CTR_PARAMS::cb"]
        [::std::mem::offset_of!(CK_AES_CTR_PARAMS, cb) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_AES_GCM_PARAMS {
    pub pIv: *mut CK_BYTE,
    pub ulIvLen: CK_ULONG,
    pub ulIvBits: CK_ULONG,
    pub pAAD: *mut CK_BYTE,
    pub ulAADLen: CK_ULONG,
    pub ulTagBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_AES_GCM_PARAMS"][::std::mem::size_of::<CK_AES_GCM_PARAMS>() - 32usize];
    ["Alignment of CK_AES_GCM_PARAMS"][::std::mem::align_of::<CK_AES_GCM_PARAMS>() - 1usize];
    ["Offset of field: CK_AES_GCM_PARAMS::pIv"]
        [::std::mem::offset_of!(CK_AES_GCM_PARAMS, pIv) - 0usize];
    ["Offset of field: CK_AES_GCM_PARAMS::ulIvLen"]
        [::std::mem::offset_of!(CK_AES_GCM_PARAMS, ulIvLen) - 8usize];
    ["Offset of field: CK_AES_GCM_PARAMS::ulIvBits"]
        [::std::mem::offset_of!(CK_AES_GCM_PARAMS, ulIvBits) - 12usize];
    ["Offset of field: CK_AES_GCM_PARAMS::pAAD"]
        [::std::mem::offset_of!(CK_AES_GCM_PARAMS, pAAD) - 16usize];
    ["Offset of field: CK_AES_GCM_PARAMS::ulAADLen"]
        [::std::mem::offset_of!(CK_AES_GCM_PARAMS, ulAADLen) - 24usize];
    ["Offset of field: CK_AES_GCM_PARAMS::ulTagBits"]
        [::std::mem::offset_of!(CK_AES_GCM_PARAMS, ulTagBits) - 28usize];
};
impl Default for CK_AES_GCM_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ARIA_CBC_ENCRYPT_DATA_PARAMS {
    pub iv: [CK_BYTE; 16usize],
    pub pData: *mut CK_BYTE,
    pub length: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ARIA_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::size_of::<CK_ARIA_CBC_ENCRYPT_DATA_PARAMS>() - 28usize];
    ["Alignment of CK_ARIA_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::align_of::<CK_ARIA_CBC_ENCRYPT_DATA_PARAMS>() - 1usize];
    ["Offset of field: CK_ARIA_CBC_ENCRYPT_DATA_PARAMS::iv"]
        [::std::mem::offset_of!(CK_ARIA_CBC_ENCRYPT_DATA_PARAMS, iv) - 0usize];
    ["Offset of field: CK_ARIA_CBC_ENCRYPT_DATA_PARAMS::pData"]
        [::std::mem::offset_of!(CK_ARIA_CBC_ENCRYPT_DATA_PARAMS, pData) - 16usize];
    ["Offset of field: CK_ARIA_CBC_ENCRYPT_DATA_PARAMS::length"]
        [::std::mem::offset_of!(CK_ARIA_CBC_ENCRYPT_DATA_PARAMS, length) - 24usize];
};
impl Default for CK_ARIA_CBC_ENCRYPT_DATA_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ASYNC_DATA {
    pub ulVersion: CK_ULONG,
    pub pValue: *mut CK_BYTE,
    pub ulValue: CK_ULONG,
    pub hObject: CK_OBJECT_HANDLE,
    pub hAdditionalObject: CK_OBJECT_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ASYNC_DATA"][::std::mem::size_of::<CK_ASYNC_DATA>() - 24usize];
    ["Alignment of CK_ASYNC_DATA"][::std::mem::align_of::<CK_ASYNC_DATA>() - 1usize];
    ["Offset of field: CK_ASYNC_DATA::ulVersion"]
        [::std::mem::offset_of!(CK_ASYNC_DATA, ulVersion) - 0usize];
    ["Offset of field: CK_ASYNC_DATA::pValue"]
        [::std::mem::offset_of!(CK_ASYNC_DATA, pValue) - 4usize];
    ["Offset of field: CK_ASYNC_DATA::ulValue"]
        [::std::mem::offset_of!(CK_ASYNC_DATA, ulValue) - 12usize];
    ["Offset of field: CK_ASYNC_DATA::hObject"]
        [::std::mem::offset_of!(CK_ASYNC_DATA, hObject) - 16usize];
    ["Offset of field: CK_ASYNC_DATA::hAdditionalObject"]
        [::std::mem::offset_of!(CK_ASYNC_DATA, hAdditionalObject) - 20usize];
};
impl Default for CK_ASYNC_DATA {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS {
    pub iv: [CK_BYTE; 16usize],
    pub pData: *mut CK_BYTE,
    pub length: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::size_of::<CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS>() - 28usize];
    ["Alignment of CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::align_of::<CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS>() - 1usize];
    ["Offset of field: CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS::iv"]
        [::std::mem::offset_of!(CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS, iv) - 0usize];
    ["Offset of field: CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS::pData"]
        [::std::mem::offset_of!(CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS, pData) - 16usize];
    ["Offset of field: CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS::length"]
        [::std::mem::offset_of!(CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS, length) - 24usize];
};
impl Default for CK_CAMELLIA_CBC_ENCRYPT_DATA_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_CAMELLIA_CTR_PARAMS {
    pub ulCounterBits: CK_ULONG,
    pub cb: [CK_BYTE; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CAMELLIA_CTR_PARAMS"][::std::mem::size_of::<CK_CAMELLIA_CTR_PARAMS>() - 20usize];
    ["Alignment of CK_CAMELLIA_CTR_PARAMS"]
        [::std::mem::align_of::<CK_CAMELLIA_CTR_PARAMS>() - 1usize];
    ["Offset of field: CK_CAMELLIA_CTR_PARAMS::ulCounterBits"]
        [::std::mem::offset_of!(CK_CAMELLIA_CTR_PARAMS, ulCounterBits) - 0usize];
    ["Offset of field: CK_CAMELLIA_CTR_PARAMS::cb"]
        [::std::mem::offset_of!(CK_CAMELLIA_CTR_PARAMS, cb) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_CCM_MESSAGE_PARAMS {
    pub ulDataLen: CK_ULONG,
    pub pNonce: *mut CK_BYTE,
    pub ulNonceLen: CK_ULONG,
    pub ulNonceFixedBits: CK_ULONG,
    pub nonceGenerator: CK_GENERATOR_FUNCTION,
    pub pMAC: *mut CK_BYTE,
    pub ulMACLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CCM_MESSAGE_PARAMS"][::std::mem::size_of::<CK_CCM_MESSAGE_PARAMS>() - 36usize];
    ["Alignment of CK_CCM_MESSAGE_PARAMS"]
        [::std::mem::align_of::<CK_CCM_MESSAGE_PARAMS>() - 1usize];
    ["Offset of field: CK_CCM_MESSAGE_PARAMS::ulDataLen"]
        [::std::mem::offset_of!(CK_CCM_MESSAGE_PARAMS, ulDataLen) - 0usize];
    ["Offset of field: CK_CCM_MESSAGE_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_CCM_MESSAGE_PARAMS, pNonce) - 4usize];
    ["Offset of field: CK_CCM_MESSAGE_PARAMS::ulNonceLen"]
        [::std::mem::offset_of!(CK_CCM_MESSAGE_PARAMS, ulNonceLen) - 12usize];
    ["Offset of field: CK_CCM_MESSAGE_PARAMS::ulNonceFixedBits"]
        [::std::mem::offset_of!(CK_CCM_MESSAGE_PARAMS, ulNonceFixedBits) - 16usize];
    ["Offset of field: CK_CCM_MESSAGE_PARAMS::nonceGenerator"]
        [::std::mem::offset_of!(CK_CCM_MESSAGE_PARAMS, nonceGenerator) - 20usize];
    ["Offset of field: CK_CCM_MESSAGE_PARAMS::pMAC"]
        [::std::mem::offset_of!(CK_CCM_MESSAGE_PARAMS, pMAC) - 24usize];
    ["Offset of field: CK_CCM_MESSAGE_PARAMS::ulMACLen"]
        [::std::mem::offset_of!(CK_CCM_MESSAGE_PARAMS, ulMACLen) - 32usize];
};
impl Default for CK_CCM_MESSAGE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_CCM_PARAMS {
    pub ulDataLen: CK_ULONG,
    pub pNonce: *mut CK_BYTE,
    pub ulNonceLen: CK_ULONG,
    pub pAAD: *mut CK_BYTE,
    pub ulAADLen: CK_ULONG,
    pub ulMACLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CCM_PARAMS"][::std::mem::size_of::<CK_CCM_PARAMS>() - 32usize];
    ["Alignment of CK_CCM_PARAMS"][::std::mem::align_of::<CK_CCM_PARAMS>() - 1usize];
    ["Offset of field: CK_CCM_PARAMS::ulDataLen"]
        [::std::mem::offset_of!(CK_CCM_PARAMS, ulDataLen) - 0usize];
    ["Offset of field: CK_CCM_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_CCM_PARAMS, pNonce) - 4usize];
    ["Offset of field: CK_CCM_PARAMS::ulNonceLen"]
        [::std::mem::offset_of!(CK_CCM_PARAMS, ulNonceLen) - 12usize];
    ["Offset of field: CK_CCM_PARAMS::pAAD"][::std::mem::offset_of!(CK_CCM_PARAMS, pAAD) - 16usize];
    ["Offset of field: CK_CCM_PARAMS::ulAADLen"]
        [::std::mem::offset_of!(CK_CCM_PARAMS, ulAADLen) - 24usize];
    ["Offset of field: CK_CCM_PARAMS::ulMACLen"]
        [::std::mem::offset_of!(CK_CCM_PARAMS, ulMACLen) - 28usize];
};
impl Default for CK_CCM_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_CCM_WRAP_PARAMS {
    pub ulDataLen: CK_ULONG,
    pub pNonce: *mut CK_BYTE,
    pub ulNonceLen: CK_ULONG,
    pub ulNonceFixedBits: CK_ULONG,
    pub nonceGenerator: CK_GENERATOR_FUNCTION,
    pub pAAD: *mut CK_BYTE,
    pub ulAADLen: CK_ULONG,
    pub ulMACLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CCM_WRAP_PARAMS"][::std::mem::size_of::<CK_CCM_WRAP_PARAMS>() - 40usize];
    ["Alignment of CK_CCM_WRAP_PARAMS"][::std::mem::align_of::<CK_CCM_WRAP_PARAMS>() - 1usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::ulDataLen"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, ulDataLen) - 0usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, pNonce) - 4usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::ulNonceLen"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, ulNonceLen) - 12usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::ulNonceFixedBits"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, ulNonceFixedBits) - 16usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::nonceGenerator"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, nonceGenerator) - 20usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::pAAD"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, pAAD) - 24usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::ulAADLen"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, ulAADLen) - 32usize];
    ["Offset of field: CK_CCM_WRAP_PARAMS::ulMACLen"]
        [::std::mem::offset_of!(CK_CCM_WRAP_PARAMS, ulMACLen) - 36usize];
};
impl Default for CK_CCM_WRAP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_CHACHA20_PARAMS {
    pub pBlockCounter: *mut CK_BYTE,
    pub blockCounterBits: CK_ULONG,
    pub pNonce: *mut CK_BYTE,
    pub ulNonceBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CHACHA20_PARAMS"][::std::mem::size_of::<CK_CHACHA20_PARAMS>() - 24usize];
    ["Alignment of CK_CHACHA20_PARAMS"][::std::mem::align_of::<CK_CHACHA20_PARAMS>() - 1usize];
    ["Offset of field: CK_CHACHA20_PARAMS::pBlockCounter"]
        [::std::mem::offset_of!(CK_CHACHA20_PARAMS, pBlockCounter) - 0usize];
    ["Offset of field: CK_CHACHA20_PARAMS::blockCounterBits"]
        [::std::mem::offset_of!(CK_CHACHA20_PARAMS, blockCounterBits) - 8usize];
    ["Offset of field: CK_CHACHA20_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_CHACHA20_PARAMS, pNonce) - 12usize];
    ["Offset of field: CK_CHACHA20_PARAMS::ulNonceBits"]
        [::std::mem::offset_of!(CK_CHACHA20_PARAMS, ulNonceBits) - 20usize];
};
impl Default for CK_CHACHA20_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_CMS_SIG_PARAMS {
    pub certificateHandle: CK_OBJECT_HANDLE,
    pub pSigningMechanism: *mut CK_MECHANISM,
    pub pDigestMechanism: *mut CK_MECHANISM,
    pub pContentType: *mut CK_UTF8CHAR,
    pub pRequestedAttributes: *mut CK_BYTE,
    pub ulRequestedAttributesLen: CK_ULONG,
    pub pRequiredAttributes: *mut CK_BYTE,
    pub ulRequiredAttributesLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CMS_SIG_PARAMS"][::std::mem::size_of::<CK_CMS_SIG_PARAMS>() - 52usize];
    ["Alignment of CK_CMS_SIG_PARAMS"][::std::mem::align_of::<CK_CMS_SIG_PARAMS>() - 1usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::certificateHandle"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, certificateHandle) - 0usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::pSigningMechanism"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, pSigningMechanism) - 4usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::pDigestMechanism"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, pDigestMechanism) - 12usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::pContentType"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, pContentType) - 20usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::pRequestedAttributes"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, pRequestedAttributes) - 28usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::ulRequestedAttributesLen"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, ulRequestedAttributesLen) - 36usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::pRequiredAttributes"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, pRequiredAttributes) - 40usize];
    ["Offset of field: CK_CMS_SIG_PARAMS::ulRequiredAttributesLen"]
        [::std::mem::offset_of!(CK_CMS_SIG_PARAMS, ulRequiredAttributesLen) - 48usize];
};
impl Default for CK_CMS_SIG_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_DES_CBC_ENCRYPT_DATA_PARAMS {
    pub iv: [CK_BYTE; 8usize],
    pub pData: *mut CK_BYTE,
    pub length: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_DES_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::size_of::<CK_DES_CBC_ENCRYPT_DATA_PARAMS>() - 20usize];
    ["Alignment of CK_DES_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::align_of::<CK_DES_CBC_ENCRYPT_DATA_PARAMS>() - 1usize];
    ["Offset of field: CK_DES_CBC_ENCRYPT_DATA_PARAMS::iv"]
        [::std::mem::offset_of!(CK_DES_CBC_ENCRYPT_DATA_PARAMS, iv) - 0usize];
    ["Offset of field: CK_DES_CBC_ENCRYPT_DATA_PARAMS::pData"]
        [::std::mem::offset_of!(CK_DES_CBC_ENCRYPT_DATA_PARAMS, pData) - 8usize];
    ["Offset of field: CK_DES_CBC_ENCRYPT_DATA_PARAMS::length"]
        [::std::mem::offset_of!(CK_DES_CBC_ENCRYPT_DATA_PARAMS, length) - 16usize];
};
impl Default for CK_DES_CBC_ENCRYPT_DATA_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_DSA_PARAMETER_GEN_PARAM {
    pub hash: CK_MECHANISM_TYPE,
    pub pSeed: *mut CK_BYTE,
    pub ulSeedLen: CK_ULONG,
    pub ulIndex: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_DSA_PARAMETER_GEN_PARAM"]
        [::std::mem::size_of::<CK_DSA_PARAMETER_GEN_PARAM>() - 20usize];
    ["Alignment of CK_DSA_PARAMETER_GEN_PARAM"]
        [::std::mem::align_of::<CK_DSA_PARAMETER_GEN_PARAM>() - 1usize];
    ["Offset of field: CK_DSA_PARAMETER_GEN_PARAM::hash"]
        [::std::mem::offset_of!(CK_DSA_PARAMETER_GEN_PARAM, hash) - 0usize];
    ["Offset of field: CK_DSA_PARAMETER_GEN_PARAM::pSeed"]
        [::std::mem::offset_of!(CK_DSA_PARAMETER_GEN_PARAM, pSeed) - 4usize];
    ["Offset of field: CK_DSA_PARAMETER_GEN_PARAM::ulSeedLen"]
        [::std::mem::offset_of!(CK_DSA_PARAMETER_GEN_PARAM, ulSeedLen) - 12usize];
    ["Offset of field: CK_DSA_PARAMETER_GEN_PARAM::ulIndex"]
        [::std::mem::offset_of!(CK_DSA_PARAMETER_GEN_PARAM, ulIndex) - 16usize];
};
impl Default for CK_DSA_PARAMETER_GEN_PARAM {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ECDH_AES_KEY_WRAP_PARAMS {
    pub ulAESKeyBits: CK_ULONG,
    pub kdf: CK_EC_KDF_TYPE,
    pub ulSharedDataLen: CK_ULONG,
    pub pSharedData: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ECDH_AES_KEY_WRAP_PARAMS"]
        [::std::mem::size_of::<CK_ECDH_AES_KEY_WRAP_PARAMS>() - 20usize];
    ["Alignment of CK_ECDH_AES_KEY_WRAP_PARAMS"]
        [::std::mem::align_of::<CK_ECDH_AES_KEY_WRAP_PARAMS>() - 1usize];
    ["Offset of field: CK_ECDH_AES_KEY_WRAP_PARAMS::ulAESKeyBits"]
        [::std::mem::offset_of!(CK_ECDH_AES_KEY_WRAP_PARAMS, ulAESKeyBits) - 0usize];
    ["Offset of field: CK_ECDH_AES_KEY_WRAP_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_ECDH_AES_KEY_WRAP_PARAMS, kdf) - 4usize];
    ["Offset of field: CK_ECDH_AES_KEY_WRAP_PARAMS::ulSharedDataLen"]
        [::std::mem::offset_of!(CK_ECDH_AES_KEY_WRAP_PARAMS, ulSharedDataLen) - 8usize];
    ["Offset of field: CK_ECDH_AES_KEY_WRAP_PARAMS::pSharedData"]
        [::std::mem::offset_of!(CK_ECDH_AES_KEY_WRAP_PARAMS, pSharedData) - 12usize];
};
impl Default for CK_ECDH_AES_KEY_WRAP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ECDH1_DERIVE_PARAMS {
    pub kdf: CK_EC_KDF_TYPE,
    pub ulSharedDataLen: CK_ULONG,
    pub pSharedData: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub pPublicData: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ECDH1_DERIVE_PARAMS"][::std::mem::size_of::<CK_ECDH1_DERIVE_PARAMS>() - 28usize];
    ["Alignment of CK_ECDH1_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_ECDH1_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_ECDH1_DERIVE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_ECDH1_DERIVE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_ECDH1_DERIVE_PARAMS::ulSharedDataLen"]
        [::std::mem::offset_of!(CK_ECDH1_DERIVE_PARAMS, ulSharedDataLen) - 4usize];
    ["Offset of field: CK_ECDH1_DERIVE_PARAMS::pSharedData"]
        [::std::mem::offset_of!(CK_ECDH1_DERIVE_PARAMS, pSharedData) - 8usize];
    ["Offset of field: CK_ECDH1_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_ECDH1_DERIVE_PARAMS, ulPublicDataLen) - 16usize];
    ["Offset of field: CK_ECDH1_DERIVE_PARAMS::pPublicData"]
        [::std::mem::offset_of!(CK_ECDH1_DERIVE_PARAMS, pPublicData) - 20usize];
};
impl Default for CK_ECDH1_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ECDH2_DERIVE_PARAMS {
    pub kdf: CK_EC_KDF_TYPE,
    pub ulSharedDataLen: CK_ULONG,
    pub pSharedData: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub pPublicData: *mut CK_BYTE,
    pub ulPrivateDataLen: CK_ULONG,
    pub hPrivateData: CK_OBJECT_HANDLE,
    pub ulPublicDataLen2: CK_ULONG,
    pub pPublicData2: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ECDH2_DERIVE_PARAMS"][::std::mem::size_of::<CK_ECDH2_DERIVE_PARAMS>() - 48usize];
    ["Alignment of CK_ECDH2_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_ECDH2_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::ulSharedDataLen"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, ulSharedDataLen) - 4usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::pSharedData"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, pSharedData) - 8usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, ulPublicDataLen) - 16usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::pPublicData"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, pPublicData) - 20usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::ulPrivateDataLen"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, ulPrivateDataLen) - 28usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::hPrivateData"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, hPrivateData) - 32usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::ulPublicDataLen2"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, ulPublicDataLen2) - 36usize];
    ["Offset of field: CK_ECDH2_DERIVE_PARAMS::pPublicData2"]
        [::std::mem::offset_of!(CK_ECDH2_DERIVE_PARAMS, pPublicData2) - 40usize];
};
impl Default for CK_ECDH2_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ECMQV_DERIVE_PARAMS {
    pub kdf: CK_EC_KDF_TYPE,
    pub ulSharedDataLen: CK_ULONG,
    pub pSharedData: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub pPublicData: *mut CK_BYTE,
    pub ulPrivateDataLen: CK_ULONG,
    pub hPrivateData: CK_OBJECT_HANDLE,
    pub ulPublicDataLen2: CK_ULONG,
    pub pPublicData2: *mut CK_BYTE,
    pub publicKey: CK_OBJECT_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ECMQV_DERIVE_PARAMS"][::std::mem::size_of::<CK_ECMQV_DERIVE_PARAMS>() - 52usize];
    ["Alignment of CK_ECMQV_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_ECMQV_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::ulSharedDataLen"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, ulSharedDataLen) - 4usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::pSharedData"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, pSharedData) - 8usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, ulPublicDataLen) - 16usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::pPublicData"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, pPublicData) - 20usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::ulPrivateDataLen"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, ulPrivateDataLen) - 28usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::hPrivateData"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, hPrivateData) - 32usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::ulPublicDataLen2"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, ulPublicDataLen2) - 36usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::pPublicData2"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, pPublicData2) - 40usize];
    ["Offset of field: CK_ECMQV_DERIVE_PARAMS::publicKey"]
        [::std::mem::offset_of!(CK_ECMQV_DERIVE_PARAMS, publicKey) - 48usize];
};
impl Default for CK_ECMQV_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_EDDSA_PARAMS {
    pub phFlag: CK_BBOOL,
    pub ulContextDataLen: CK_ULONG,
    pub pContextData: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_EDDSA_PARAMS"][::std::mem::size_of::<CK_EDDSA_PARAMS>() - 13usize];
    ["Alignment of CK_EDDSA_PARAMS"][::std::mem::align_of::<CK_EDDSA_PARAMS>() - 1usize];
    ["Offset of field: CK_EDDSA_PARAMS::phFlag"]
        [::std::mem::offset_of!(CK_EDDSA_PARAMS, phFlag) - 0usize];
    ["Offset of field: CK_EDDSA_PARAMS::ulContextDataLen"]
        [::std::mem::offset_of!(CK_EDDSA_PARAMS, ulContextDataLen) - 1usize];
    ["Offset of field: CK_EDDSA_PARAMS::pContextData"]
        [::std::mem::offset_of!(CK_EDDSA_PARAMS, pContextData) - 5usize];
};
impl Default for CK_EDDSA_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_GCM_MESSAGE_PARAMS {
    pub pIv: *mut CK_BYTE,
    pub ulIvLen: CK_ULONG,
    pub ulIvFixedBits: CK_ULONG,
    pub ivGenerator: CK_GENERATOR_FUNCTION,
    pub pTag: *mut CK_BYTE,
    pub ulTagBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_GCM_MESSAGE_PARAMS"][::std::mem::size_of::<CK_GCM_MESSAGE_PARAMS>() - 32usize];
    ["Alignment of CK_GCM_MESSAGE_PARAMS"]
        [::std::mem::align_of::<CK_GCM_MESSAGE_PARAMS>() - 1usize];
    ["Offset of field: CK_GCM_MESSAGE_PARAMS::pIv"]
        [::std::mem::offset_of!(CK_GCM_MESSAGE_PARAMS, pIv) - 0usize];
    ["Offset of field: CK_GCM_MESSAGE_PARAMS::ulIvLen"]
        [::std::mem::offset_of!(CK_GCM_MESSAGE_PARAMS, ulIvLen) - 8usize];
    ["Offset of field: CK_GCM_MESSAGE_PARAMS::ulIvFixedBits"]
        [::std::mem::offset_of!(CK_GCM_MESSAGE_PARAMS, ulIvFixedBits) - 12usize];
    ["Offset of field: CK_GCM_MESSAGE_PARAMS::ivGenerator"]
        [::std::mem::offset_of!(CK_GCM_MESSAGE_PARAMS, ivGenerator) - 16usize];
    ["Offset of field: CK_GCM_MESSAGE_PARAMS::pTag"]
        [::std::mem::offset_of!(CK_GCM_MESSAGE_PARAMS, pTag) - 20usize];
    ["Offset of field: CK_GCM_MESSAGE_PARAMS::ulTagBits"]
        [::std::mem::offset_of!(CK_GCM_MESSAGE_PARAMS, ulTagBits) - 28usize];
};
impl Default for CK_GCM_MESSAGE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_GCM_PARAMS {
    pub pIv: *mut CK_BYTE,
    pub ulIvLen: CK_ULONG,
    pub ulIvBits: CK_ULONG,
    pub pAAD: *mut CK_BYTE,
    pub ulAADLen: CK_ULONG,
    pub ulTagBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_GCM_PARAMS"][::std::mem::size_of::<CK_GCM_PARAMS>() - 32usize];
    ["Alignment of CK_GCM_PARAMS"][::std::mem::align_of::<CK_GCM_PARAMS>() - 1usize];
    ["Offset of field: CK_GCM_PARAMS::pIv"][::std::mem::offset_of!(CK_GCM_PARAMS, pIv) - 0usize];
    ["Offset of field: CK_GCM_PARAMS::ulIvLen"]
        [::std::mem::offset_of!(CK_GCM_PARAMS, ulIvLen) - 8usize];
    ["Offset of field: CK_GCM_PARAMS::ulIvBits"]
        [::std::mem::offset_of!(CK_GCM_PARAMS, ulIvBits) - 12usize];
    ["Offset of field: CK_GCM_PARAMS::pAAD"][::std::mem::offset_of!(CK_GCM_PARAMS, pAAD) - 16usize];
    ["Offset of field: CK_GCM_PARAMS::ulAADLen"]
        [::std::mem::offset_of!(CK_GCM_PARAMS, ulAADLen) - 24usize];
    ["Offset of field: CK_GCM_PARAMS::ulTagBits"]
        [::std::mem::offset_of!(CK_GCM_PARAMS, ulTagBits) - 28usize];
};
impl Default for CK_GCM_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_GCM_WRAP_PARAMS {
    pub pIv: *mut CK_BYTE,
    pub ulIvLen: CK_ULONG,
    pub ulIvFixedBits: CK_ULONG,
    pub ivGenerator: CK_GENERATOR_FUNCTION,
    pub pAAD: *mut CK_BYTE,
    pub ulAADLen: CK_ULONG,
    pub ulTagBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_GCM_WRAP_PARAMS"][::std::mem::size_of::<CK_GCM_WRAP_PARAMS>() - 36usize];
    ["Alignment of CK_GCM_WRAP_PARAMS"][::std::mem::align_of::<CK_GCM_WRAP_PARAMS>() - 1usize];
    ["Offset of field: CK_GCM_WRAP_PARAMS::pIv"]
        [::std::mem::offset_of!(CK_GCM_WRAP_PARAMS, pIv) - 0usize];
    ["Offset of field: CK_GCM_WRAP_PARAMS::ulIvLen"]
        [::std::mem::offset_of!(CK_GCM_WRAP_PARAMS, ulIvLen) - 8usize];
    ["Offset of field: CK_GCM_WRAP_PARAMS::ulIvFixedBits"]
        [::std::mem::offset_of!(CK_GCM_WRAP_PARAMS, ulIvFixedBits) - 12usize];
    ["Offset of field: CK_GCM_WRAP_PARAMS::ivGenerator"]
        [::std::mem::offset_of!(CK_GCM_WRAP_PARAMS, ivGenerator) - 16usize];
    ["Offset of field: CK_GCM_WRAP_PARAMS::pAAD"]
        [::std::mem::offset_of!(CK_GCM_WRAP_PARAMS, pAAD) - 20usize];
    ["Offset of field: CK_GCM_WRAP_PARAMS::ulAADLen"]
        [::std::mem::offset_of!(CK_GCM_WRAP_PARAMS, ulAADLen) - 28usize];
    ["Offset of field: CK_GCM_WRAP_PARAMS::ulTagBits"]
        [::std::mem::offset_of!(CK_GCM_WRAP_PARAMS, ulTagBits) - 32usize];
};
impl Default for CK_GCM_WRAP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_GOSTR3410_DERIVE_PARAMS {
    pub kdf: CK_EC_KDF_TYPE,
    pub pPublicData: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub pUKM: *mut CK_BYTE,
    pub ulUKMLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_GOSTR3410_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_GOSTR3410_DERIVE_PARAMS>() - 28usize];
    ["Alignment of CK_GOSTR3410_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_GOSTR3410_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_GOSTR3410_DERIVE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_GOSTR3410_DERIVE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_GOSTR3410_DERIVE_PARAMS::pPublicData"]
        [::std::mem::offset_of!(CK_GOSTR3410_DERIVE_PARAMS, pPublicData) - 4usize];
    ["Offset of field: CK_GOSTR3410_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_GOSTR3410_DERIVE_PARAMS, ulPublicDataLen) - 12usize];
    ["Offset of field: CK_GOSTR3410_DERIVE_PARAMS::pUKM"]
        [::std::mem::offset_of!(CK_GOSTR3410_DERIVE_PARAMS, pUKM) - 16usize];
    ["Offset of field: CK_GOSTR3410_DERIVE_PARAMS::ulUKMLen"]
        [::std::mem::offset_of!(CK_GOSTR3410_DERIVE_PARAMS, ulUKMLen) - 24usize];
};
impl Default for CK_GOSTR3410_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_GOSTR3410_KEY_WRAP_PARAMS {
    pub pWrapOID: *mut CK_BYTE,
    pub ulWrapOIDLen: CK_ULONG,
    pub pUKM: *mut CK_BYTE,
    pub ulUKMLen: CK_ULONG,
    pub hKey: CK_OBJECT_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_GOSTR3410_KEY_WRAP_PARAMS"]
        [::std::mem::size_of::<CK_GOSTR3410_KEY_WRAP_PARAMS>() - 28usize];
    ["Alignment of CK_GOSTR3410_KEY_WRAP_PARAMS"]
        [::std::mem::align_of::<CK_GOSTR3410_KEY_WRAP_PARAMS>() - 1usize];
    ["Offset of field: CK_GOSTR3410_KEY_WRAP_PARAMS::pWrapOID"]
        [::std::mem::offset_of!(CK_GOSTR3410_KEY_WRAP_PARAMS, pWrapOID) - 0usize];
    ["Offset of field: CK_GOSTR3410_KEY_WRAP_PARAMS::ulWrapOIDLen"]
        [::std::mem::offset_of!(CK_GOSTR3410_KEY_WRAP_PARAMS, ulWrapOIDLen) - 8usize];
    ["Offset of field: CK_GOSTR3410_KEY_WRAP_PARAMS::pUKM"]
        [::std::mem::offset_of!(CK_GOSTR3410_KEY_WRAP_PARAMS, pUKM) - 12usize];
    ["Offset of field: CK_GOSTR3410_KEY_WRAP_PARAMS::ulUKMLen"]
        [::std::mem::offset_of!(CK_GOSTR3410_KEY_WRAP_PARAMS, ulUKMLen) - 20usize];
    ["Offset of field: CK_GOSTR3410_KEY_WRAP_PARAMS::hKey"]
        [::std::mem::offset_of!(CK_GOSTR3410_KEY_WRAP_PARAMS, hKey) - 24usize];
};
impl Default for CK_GOSTR3410_KEY_WRAP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_HASH_SIGN_ADDITIONAL_CONTEXT {
    pub hedgeVariant: CK_HEDGE_TYPE,
    pub pContext: *mut CK_BYTE,
    pub ulContextLen: CK_ULONG,
    pub hash: CK_MECHANISM_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_HASH_SIGN_ADDITIONAL_CONTEXT"]
        [::std::mem::size_of::<CK_HASH_SIGN_ADDITIONAL_CONTEXT>() - 20usize];
    ["Alignment of CK_HASH_SIGN_ADDITIONAL_CONTEXT"]
        [::std::mem::align_of::<CK_HASH_SIGN_ADDITIONAL_CONTEXT>() - 1usize];
    ["Offset of field: CK_HASH_SIGN_ADDITIONAL_CONTEXT::hedgeVariant"]
        [::std::mem::offset_of!(CK_HASH_SIGN_ADDITIONAL_CONTEXT, hedgeVariant) - 0usize];
    ["Offset of field: CK_HASH_SIGN_ADDITIONAL_CONTEXT::pContext"]
        [::std::mem::offset_of!(CK_HASH_SIGN_ADDITIONAL_CONTEXT, pContext) - 4usize];
    ["Offset of field: CK_HASH_SIGN_ADDITIONAL_CONTEXT::ulContextLen"]
        [::std::mem::offset_of!(CK_HASH_SIGN_ADDITIONAL_CONTEXT, ulContextLen) - 12usize];
    ["Offset of field: CK_HASH_SIGN_ADDITIONAL_CONTEXT::hash"]
        [::std::mem::offset_of!(CK_HASH_SIGN_ADDITIONAL_CONTEXT, hash) - 16usize];
};
impl Default for CK_HASH_SIGN_ADDITIONAL_CONTEXT {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_HKDF_PARAMS {
    pub bExtract: CK_BBOOL,
    pub bExpand: CK_BBOOL,
    pub prfHashMechanism: CK_MECHANISM_TYPE,
    pub ulSaltType: CK_ULONG,
    pub pSalt: *mut CK_BYTE,
    pub ulSaltLen: CK_ULONG,
    pub hSaltKey: CK_OBJECT_HANDLE,
    pub pInfo: *mut CK_BYTE,
    pub ulInfoLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_HKDF_PARAMS"][::std::mem::size_of::<CK_HKDF_PARAMS>() - 38usize];
    ["Alignment of CK_HKDF_PARAMS"][::std::mem::align_of::<CK_HKDF_PARAMS>() - 1usize];
    ["Offset of field: CK_HKDF_PARAMS::bExtract"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, bExtract) - 0usize];
    ["Offset of field: CK_HKDF_PARAMS::bExpand"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, bExpand) - 1usize];
    ["Offset of field: CK_HKDF_PARAMS::prfHashMechanism"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, prfHashMechanism) - 2usize];
    ["Offset of field: CK_HKDF_PARAMS::ulSaltType"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, ulSaltType) - 6usize];
    ["Offset of field: CK_HKDF_PARAMS::pSalt"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, pSalt) - 10usize];
    ["Offset of field: CK_HKDF_PARAMS::ulSaltLen"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, ulSaltLen) - 18usize];
    ["Offset of field: CK_HKDF_PARAMS::hSaltKey"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, hSaltKey) - 22usize];
    ["Offset of field: CK_HKDF_PARAMS::pInfo"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, pInfo) - 26usize];
    ["Offset of field: CK_HKDF_PARAMS::ulInfoLen"]
        [::std::mem::offset_of!(CK_HKDF_PARAMS, ulInfoLen) - 34usize];
};
impl Default for CK_HKDF_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_IKE_PRF_DERIVE_PARAMS {
    pub prfMechanism: CK_MECHANISM_TYPE,
    pub bDataAsKey: CK_BBOOL,
    pub bRekey: CK_BBOOL,
    pub pNi: *mut CK_BYTE,
    pub ulNiLen: CK_ULONG,
    pub pNr: *mut CK_BYTE,
    pub ulNrLen: CK_ULONG,
    pub hNewKey: CK_OBJECT_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_IKE_PRF_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_IKE_PRF_DERIVE_PARAMS>() - 34usize];
    ["Alignment of CK_IKE_PRF_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_IKE_PRF_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::prfMechanism"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, prfMechanism) - 0usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::bDataAsKey"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, bDataAsKey) - 4usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::bRekey"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, bRekey) - 5usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::pNi"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, pNi) - 6usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::ulNiLen"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, ulNiLen) - 14usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::pNr"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, pNr) - 18usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::ulNrLen"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, ulNrLen) - 26usize];
    ["Offset of field: CK_IKE_PRF_DERIVE_PARAMS::hNewKey"]
        [::std::mem::offset_of!(CK_IKE_PRF_DERIVE_PARAMS, hNewKey) - 30usize];
};
impl Default for CK_IKE_PRF_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_IKE1_EXTENDED_DERIVE_PARAMS {
    pub prfMechanism: CK_MECHANISM_TYPE,
    pub bHasKeygxy: CK_BBOOL,
    pub hKeygxy: CK_OBJECT_HANDLE,
    pub pExtraData: *mut CK_BYTE,
    pub ulExtraDataLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_IKE1_EXTENDED_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_IKE1_EXTENDED_DERIVE_PARAMS>() - 21usize];
    ["Alignment of CK_IKE1_EXTENDED_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_IKE1_EXTENDED_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_IKE1_EXTENDED_DERIVE_PARAMS::prfMechanism"]
        [::std::mem::offset_of!(CK_IKE1_EXTENDED_DERIVE_PARAMS, prfMechanism) - 0usize];
    ["Offset of field: CK_IKE1_EXTENDED_DERIVE_PARAMS::bHasKeygxy"]
        [::std::mem::offset_of!(CK_IKE1_EXTENDED_DERIVE_PARAMS, bHasKeygxy) - 4usize];
    ["Offset of field: CK_IKE1_EXTENDED_DERIVE_PARAMS::hKeygxy"]
        [::std::mem::offset_of!(CK_IKE1_EXTENDED_DERIVE_PARAMS, hKeygxy) - 5usize];
    ["Offset of field: CK_IKE1_EXTENDED_DERIVE_PARAMS::pExtraData"]
        [::std::mem::offset_of!(CK_IKE1_EXTENDED_DERIVE_PARAMS, pExtraData) - 9usize];
    ["Offset of field: CK_IKE1_EXTENDED_DERIVE_PARAMS::ulExtraDataLen"]
        [::std::mem::offset_of!(CK_IKE1_EXTENDED_DERIVE_PARAMS, ulExtraDataLen) - 17usize];
};
impl Default for CK_IKE1_EXTENDED_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_IKE1_PRF_DERIVE_PARAMS {
    pub prfMechanism: CK_MECHANISM_TYPE,
    pub bHasPrevKey: CK_BBOOL,
    pub hKeygxy: CK_OBJECT_HANDLE,
    pub hPrevKey: CK_OBJECT_HANDLE,
    pub pCKYi: *mut CK_BYTE,
    pub ulCKYiLen: CK_ULONG,
    pub pCKYr: *mut CK_BYTE,
    pub ulCKYrLen: CK_ULONG,
    pub keyNumber: CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_IKE1_PRF_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_IKE1_PRF_DERIVE_PARAMS>() - 38usize];
    ["Alignment of CK_IKE1_PRF_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_IKE1_PRF_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::prfMechanism"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, prfMechanism) - 0usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::bHasPrevKey"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, bHasPrevKey) - 4usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::hKeygxy"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, hKeygxy) - 5usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::hPrevKey"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, hPrevKey) - 9usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::pCKYi"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, pCKYi) - 13usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::ulCKYiLen"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, ulCKYiLen) - 21usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::pCKYr"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, pCKYr) - 25usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::ulCKYrLen"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, ulCKYrLen) - 33usize];
    ["Offset of field: CK_IKE1_PRF_DERIVE_PARAMS::keyNumber"]
        [::std::mem::offset_of!(CK_IKE1_PRF_DERIVE_PARAMS, keyNumber) - 37usize];
};
impl Default for CK_IKE1_PRF_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_IKE2_PRF_PLUS_DERIVE_PARAMS {
    pub prfMechanism: CK_MECHANISM_TYPE,
    pub bHasSeedKey: CK_BBOOL,
    pub hSeedKey: CK_OBJECT_HANDLE,
    pub pSeedData: *mut CK_BYTE,
    pub ulSeedDataLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_IKE2_PRF_PLUS_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_IKE2_PRF_PLUS_DERIVE_PARAMS>() - 21usize];
    ["Alignment of CK_IKE2_PRF_PLUS_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_IKE2_PRF_PLUS_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_IKE2_PRF_PLUS_DERIVE_PARAMS::prfMechanism"]
        [::std::mem::offset_of!(CK_IKE2_PRF_PLUS_DERIVE_PARAMS, prfMechanism) - 0usize];
    ["Offset of field: CK_IKE2_PRF_PLUS_DERIVE_PARAMS::bHasSeedKey"]
        [::std::mem::offset_of!(CK_IKE2_PRF_PLUS_DERIVE_PARAMS, bHasSeedKey) - 4usize];
    ["Offset of field: CK_IKE2_PRF_PLUS_DERIVE_PARAMS::hSeedKey"]
        [::std::mem::offset_of!(CK_IKE2_PRF_PLUS_DERIVE_PARAMS, hSeedKey) - 5usize];
    ["Offset of field: CK_IKE2_PRF_PLUS_DERIVE_PARAMS::pSeedData"]
        [::std::mem::offset_of!(CK_IKE2_PRF_PLUS_DERIVE_PARAMS, pSeedData) - 9usize];
    ["Offset of field: CK_IKE2_PRF_PLUS_DERIVE_PARAMS::ulSeedDataLen"]
        [::std::mem::offset_of!(CK_IKE2_PRF_PLUS_DERIVE_PARAMS, ulSeedDataLen) - 17usize];
};
impl Default for CK_IKE2_PRF_PLUS_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_KEA_DERIVE_PARAMS {
    pub isSender: CK_BBOOL,
    pub ulRandomLen: CK_ULONG,
    pub RandomA: *mut CK_BYTE,
    pub RandomB: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub PublicData: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_KEA_DERIVE_PARAMS"][::std::mem::size_of::<CK_KEA_DERIVE_PARAMS>() - 33usize];
    ["Alignment of CK_KEA_DERIVE_PARAMS"][::std::mem::align_of::<CK_KEA_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_KEA_DERIVE_PARAMS::isSender"]
        [::std::mem::offset_of!(CK_KEA_DERIVE_PARAMS, isSender) - 0usize];
    ["Offset of field: CK_KEA_DERIVE_PARAMS::ulRandomLen"]
        [::std::mem::offset_of!(CK_KEA_DERIVE_PARAMS, ulRandomLen) - 1usize];
    ["Offset of field: CK_KEA_DERIVE_PARAMS::RandomA"]
        [::std::mem::offset_of!(CK_KEA_DERIVE_PARAMS, RandomA) - 5usize];
    ["Offset of field: CK_KEA_DERIVE_PARAMS::RandomB"]
        [::std::mem::offset_of!(CK_KEA_DERIVE_PARAMS, RandomB) - 13usize];
    ["Offset of field: CK_KEA_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_KEA_DERIVE_PARAMS, ulPublicDataLen) - 21usize];
    ["Offset of field: CK_KEA_DERIVE_PARAMS::PublicData"]
        [::std::mem::offset_of!(CK_KEA_DERIVE_PARAMS, PublicData) - 25usize];
};
impl Default for CK_KEA_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_KEY_DERIVATION_STRING_DATA {
    pub pData: *mut CK_BYTE,
    pub ulLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_KEY_DERIVATION_STRING_DATA"]
        [::std::mem::size_of::<CK_KEY_DERIVATION_STRING_DATA>() - 12usize];
    ["Alignment of CK_KEY_DERIVATION_STRING_DATA"]
        [::std::mem::align_of::<CK_KEY_DERIVATION_STRING_DATA>() - 1usize];
    ["Offset of field: CK_KEY_DERIVATION_STRING_DATA::pData"]
        [::std::mem::offset_of!(CK_KEY_DERIVATION_STRING_DATA, pData) - 0usize];
    ["Offset of field: CK_KEY_DERIVATION_STRING_DATA::ulLen"]
        [::std::mem::offset_of!(CK_KEY_DERIVATION_STRING_DATA, ulLen) - 8usize];
};
impl Default for CK_KEY_DERIVATION_STRING_DATA {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_KEY_WRAP_SET_OAEP_PARAMS {
    pub bBC: CK_BYTE,
    pub pX: *mut CK_BYTE,
    pub ulXLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_KEY_WRAP_SET_OAEP_PARAMS"]
        [::std::mem::size_of::<CK_KEY_WRAP_SET_OAEP_PARAMS>() - 13usize];
    ["Alignment of CK_KEY_WRAP_SET_OAEP_PARAMS"]
        [::std::mem::align_of::<CK_KEY_WRAP_SET_OAEP_PARAMS>() - 1usize];
    ["Offset of field: CK_KEY_WRAP_SET_OAEP_PARAMS::bBC"]
        [::std::mem::offset_of!(CK_KEY_WRAP_SET_OAEP_PARAMS, bBC) - 0usize];
    ["Offset of field: CK_KEY_WRAP_SET_OAEP_PARAMS::pX"]
        [::std::mem::offset_of!(CK_KEY_WRAP_SET_OAEP_PARAMS, pX) - 1usize];
    ["Offset of field: CK_KEY_WRAP_SET_OAEP_PARAMS::ulXLen"]
        [::std::mem::offset_of!(CK_KEY_WRAP_SET_OAEP_PARAMS, ulXLen) - 9usize];
};
impl Default for CK_KEY_WRAP_SET_OAEP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_KIP_PARAMS {
    pub pMechanism: *mut CK_MECHANISM,
    pub hKey: CK_OBJECT_HANDLE,
    pub pSeed: *mut CK_BYTE,
    pub ulSeedLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_KIP_PARAMS"][::std::mem::size_of::<CK_KIP_PARAMS>() - 24usize];
    ["Alignment of CK_KIP_PARAMS"][::std::mem::align_of::<CK_KIP_PARAMS>() - 1usize];
    ["Offset of field: CK_KIP_PARAMS::pMechanism"]
        [::std::mem::offset_of!(CK_KIP_PARAMS, pMechanism) - 0usize];
    ["Offset of field: CK_KIP_PARAMS::hKey"][::std::mem::offset_of!(CK_KIP_PARAMS, hKey) - 8usize];
    ["Offset of field: CK_KIP_PARAMS::pSeed"]
        [::std::mem::offset_of!(CK_KIP_PARAMS, pSeed) - 12usize];
    ["Offset of field: CK_KIP_PARAMS::ulSeedLen"]
        [::std::mem::offset_of!(CK_KIP_PARAMS, ulSeedLen) - 20usize];
};
impl Default for CK_KIP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_OTP_PARAM {
    pub type_: CK_OTP_PARAM_TYPE,
    pub pValue: *mut ::std::os::raw::c_void,
    pub ulValueLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_OTP_PARAM"][::std::mem::size_of::<CK_OTP_PARAM>() - 16usize];
    ["Alignment of CK_OTP_PARAM"][::std::mem::align_of::<CK_OTP_PARAM>() - 1usize];
    ["Offset of field: CK_OTP_PARAM::type_"][::std::mem::offset_of!(CK_OTP_PARAM, type_) - 0usize];
    ["Offset of field: CK_OTP_PARAM::pValue"]
        [::std::mem::offset_of!(CK_OTP_PARAM, pValue) - 4usize];
    ["Offset of field: CK_OTP_PARAM::ulValueLen"]
        [::std::mem::offset_of!(CK_OTP_PARAM, ulValueLen) - 12usize];
};
impl Default for CK_OTP_PARAM {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_OTP_PARAMS {
    pub pParams: *mut CK_OTP_PARAM,
    pub ulCount: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_OTP_PARAMS"][::std::mem::size_of::<CK_OTP_PARAMS>() - 12usize];
    ["Alignment of CK_OTP_PARAMS"][::std::mem::align_of::<CK_OTP_PARAMS>() - 1usize];
    ["Offset of field: CK_OTP_PARAMS::pParams"]
        [::std::mem::offset_of!(CK_OTP_PARAMS, pParams) - 0usize];
    ["Offset of field: CK_OTP_PARAMS::ulCount"]
        [::std::mem::offset_of!(CK_OTP_PARAMS, ulCount) - 8usize];
};
impl Default for CK_OTP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_OTP_SIGNATURE_INFO {
    pub pParams: *mut CK_OTP_PARAM,
    pub ulCount: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_OTP_SIGNATURE_INFO"][::std::mem::size_of::<CK_OTP_SIGNATURE_INFO>() - 12usize];
    ["Alignment of CK_OTP_SIGNATURE_INFO"]
        [::std::mem::align_of::<CK_OTP_SIGNATURE_INFO>() - 1usize];
    ["Offset of field: CK_OTP_SIGNATURE_INFO::pParams"]
        [::std::mem::offset_of!(CK_OTP_SIGNATURE_INFO, pParams) - 0usize];
    ["Offset of field: CK_OTP_SIGNATURE_INFO::ulCount"]
        [::std::mem::offset_of!(CK_OTP_SIGNATURE_INFO, ulCount) - 8usize];
};
impl Default for CK_OTP_SIGNATURE_INFO {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_PBE_PARAMS {
    pub pInitVector: *mut CK_BYTE,
    pub pPassword: *mut CK_UTF8CHAR,
    pub ulPasswordLen: CK_ULONG,
    pub pSalt: *mut CK_BYTE,
    pub ulSaltLen: CK_ULONG,
    pub ulIteration: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_PBE_PARAMS"][::std::mem::size_of::<CK_PBE_PARAMS>() - 36usize];
    ["Alignment of CK_PBE_PARAMS"][::std::mem::align_of::<CK_PBE_PARAMS>() - 1usize];
    ["Offset of field: CK_PBE_PARAMS::pInitVector"]
        [::std::mem::offset_of!(CK_PBE_PARAMS, pInitVector) - 0usize];
    ["Offset of field: CK_PBE_PARAMS::pPassword"]
        [::std::mem::offset_of!(CK_PBE_PARAMS, pPassword) - 8usize];
    ["Offset of field: CK_PBE_PARAMS::ulPasswordLen"]
        [::std::mem::offset_of!(CK_PBE_PARAMS, ulPasswordLen) - 16usize];
    ["Offset of field: CK_PBE_PARAMS::pSalt"]
        [::std::mem::offset_of!(CK_PBE_PARAMS, pSalt) - 20usize];
    ["Offset of field: CK_PBE_PARAMS::ulSaltLen"]
        [::std::mem::offset_of!(CK_PBE_PARAMS, ulSaltLen) - 28usize];
    ["Offset of field: CK_PBE_PARAMS::ulIteration"]
        [::std::mem::offset_of!(CK_PBE_PARAMS, ulIteration) - 32usize];
};
impl Default for CK_PBE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_PKCS5_PBKD2_PARAMS {
    pub saltSource: CK_PKCS5_PBKDF2_SALT_SOURCE_TYPE,
    pub pSaltSourceData: *mut ::std::os::raw::c_void,
    pub ulSaltSourceDataLen: CK_ULONG,
    pub iterations: CK_ULONG,
    pub prf: CK_PKCS5_PBKD2_PSEUDO_RANDOM_FUNCTION_TYPE,
    pub pPrfData: *mut ::std::os::raw::c_void,
    pub ulPrfDataLen: CK_ULONG,
    pub pPassword: *mut CK_UTF8CHAR,
    pub ulPasswordLen: *mut CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_PKCS5_PBKD2_PARAMS"][::std::mem::size_of::<CK_PKCS5_PBKD2_PARAMS>() - 52usize];
    ["Alignment of CK_PKCS5_PBKD2_PARAMS"]
        [::std::mem::align_of::<CK_PKCS5_PBKD2_PARAMS>() - 1usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::saltSource"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, saltSource) - 0usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::pSaltSourceData"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, pSaltSourceData) - 4usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::ulSaltSourceDataLen"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, ulSaltSourceDataLen) - 12usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::iterations"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, iterations) - 16usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::prf"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, prf) - 20usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::pPrfData"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, pPrfData) - 24usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::ulPrfDataLen"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, ulPrfDataLen) - 32usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::pPassword"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, pPassword) - 36usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS::ulPasswordLen"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS, ulPasswordLen) - 44usize];
};
impl Default for CK_PKCS5_PBKD2_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_PKCS5_PBKD2_PARAMS2 {
    pub saltSource: CK_PKCS5_PBKDF2_SALT_SOURCE_TYPE,
    pub pSaltSourceData: *mut ::std::os::raw::c_void,
    pub ulSaltSourceDataLen: CK_ULONG,
    pub iterations: CK_ULONG,
    pub prf: CK_PKCS5_PBKD2_PSEUDO_RANDOM_FUNCTION_TYPE,
    pub pPrfData: *mut ::std::os::raw::c_void,
    pub ulPrfDataLen: CK_ULONG,
    pub pPassword: *mut CK_UTF8CHAR,
    pub ulPasswordLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_PKCS5_PBKD2_PARAMS2"][::std::mem::size_of::<CK_PKCS5_PBKD2_PARAMS2>() - 48usize];
    ["Alignment of CK_PKCS5_PBKD2_PARAMS2"]
        [::std::mem::align_of::<CK_PKCS5_PBKD2_PARAMS2>() - 1usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::saltSource"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, saltSource) - 0usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::pSaltSourceData"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, pSaltSourceData) - 4usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::ulSaltSourceDataLen"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, ulSaltSourceDataLen) - 12usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::iterations"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, iterations) - 16usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::prf"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, prf) - 20usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::pPrfData"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, pPrfData) - 24usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::ulPrfDataLen"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, ulPrfDataLen) - 32usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::pPassword"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, pPassword) - 36usize];
    ["Offset of field: CK_PKCS5_PBKD2_PARAMS2::ulPasswordLen"]
        [::std::mem::offset_of!(CK_PKCS5_PBKD2_PARAMS2, ulPasswordLen) - 44usize];
};
impl Default for CK_PKCS5_PBKD2_PARAMS2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_PRF_DATA_PARAM {
    pub type_: CK_PRF_DATA_TYPE,
    pub pValue: *mut ::std::os::raw::c_void,
    pub ulValueLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_PRF_DATA_PARAM"][::std::mem::size_of::<CK_PRF_DATA_PARAM>() - 16usize];
    ["Alignment of CK_PRF_DATA_PARAM"][::std::mem::align_of::<CK_PRF_DATA_PARAM>() - 1usize];
    ["Offset of field: CK_PRF_DATA_PARAM::type_"]
        [::std::mem::offset_of!(CK_PRF_DATA_PARAM, type_) - 0usize];
    ["Offset of field: CK_PRF_DATA_PARAM::pValue"]
        [::std::mem::offset_of!(CK_PRF_DATA_PARAM, pValue) - 4usize];
    ["Offset of field: CK_PRF_DATA_PARAM::ulValueLen"]
        [::std::mem::offset_of!(CK_PRF_DATA_PARAM, ulValueLen) - 12usize];
};
impl Default for CK_PRF_DATA_PARAM {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_RC2_CBC_PARAMS {
    pub ulEffectiveBits: CK_ULONG,
    pub iv: [CK_BYTE; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RC2_CBC_PARAMS"][::std::mem::size_of::<CK_RC2_CBC_PARAMS>() - 12usize];
    ["Alignment of CK_RC2_CBC_PARAMS"][::std::mem::align_of::<CK_RC2_CBC_PARAMS>() - 1usize];
    ["Offset of field: CK_RC2_CBC_PARAMS::ulEffectiveBits"]
        [::std::mem::offset_of!(CK_RC2_CBC_PARAMS, ulEffectiveBits) - 0usize];
    ["Offset of field: CK_RC2_CBC_PARAMS::iv"]
        [::std::mem::offset_of!(CK_RC2_CBC_PARAMS, iv) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_RC2_MAC_GENERAL_PARAMS {
    pub ulEffectiveBits: CK_ULONG,
    pub ulMacLength: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RC2_MAC_GENERAL_PARAMS"]
        [::std::mem::size_of::<CK_RC2_MAC_GENERAL_PARAMS>() - 8usize];
    ["Alignment of CK_RC2_MAC_GENERAL_PARAMS"]
        [::std::mem::align_of::<CK_RC2_MAC_GENERAL_PARAMS>() - 1usize];
    ["Offset of field: CK_RC2_MAC_GENERAL_PARAMS::ulEffectiveBits"]
        [::std::mem::offset_of!(CK_RC2_MAC_GENERAL_PARAMS, ulEffectiveBits) - 0usize];
    ["Offset of field: CK_RC2_MAC_GENERAL_PARAMS::ulMacLength"]
        [::std::mem::offset_of!(CK_RC2_MAC_GENERAL_PARAMS, ulMacLength) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_RC5_CBC_PARAMS {
    pub ulWordsize: CK_ULONG,
    pub ulRounds: CK_ULONG,
    pub pIv: *mut CK_BYTE,
    pub ulIvLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RC5_CBC_PARAMS"][::std::mem::size_of::<CK_RC5_CBC_PARAMS>() - 20usize];
    ["Alignment of CK_RC5_CBC_PARAMS"][::std::mem::align_of::<CK_RC5_CBC_PARAMS>() - 1usize];
    ["Offset of field: CK_RC5_CBC_PARAMS::ulWordsize"]
        [::std::mem::offset_of!(CK_RC5_CBC_PARAMS, ulWordsize) - 0usize];
    ["Offset of field: CK_RC5_CBC_PARAMS::ulRounds"]
        [::std::mem::offset_of!(CK_RC5_CBC_PARAMS, ulRounds) - 4usize];
    ["Offset of field: CK_RC5_CBC_PARAMS::pIv"]
        [::std::mem::offset_of!(CK_RC5_CBC_PARAMS, pIv) - 8usize];
    ["Offset of field: CK_RC5_CBC_PARAMS::ulIvLen"]
        [::std::mem::offset_of!(CK_RC5_CBC_PARAMS, ulIvLen) - 16usize];
};
impl Default for CK_RC5_CBC_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_RC5_MAC_GENERAL_PARAMS {
    pub ulWordsize: CK_ULONG,
    pub ulRounds: CK_ULONG,
    pub ulMacLength: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RC5_MAC_GENERAL_PARAMS"]
        [::std::mem::size_of::<CK_RC5_MAC_GENERAL_PARAMS>() - 12usize];
    ["Alignment of CK_RC5_MAC_GENERAL_PARAMS"]
        [::std::mem::align_of::<CK_RC5_MAC_GENERAL_PARAMS>() - 1usize];
    ["Offset of field: CK_RC5_MAC_GENERAL_PARAMS::ulWordsize"]
        [::std::mem::offset_of!(CK_RC5_MAC_GENERAL_PARAMS, ulWordsize) - 0usize];
    ["Offset of field: CK_RC5_MAC_GENERAL_PARAMS::ulRounds"]
        [::std::mem::offset_of!(CK_RC5_MAC_GENERAL_PARAMS, ulRounds) - 4usize];
    ["Offset of field: CK_RC5_MAC_GENERAL_PARAMS::ulMacLength"]
        [::std::mem::offset_of!(CK_RC5_MAC_GENERAL_PARAMS, ulMacLength) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_RC5_PARAMS {
    pub ulWordsize: CK_ULONG,
    pub ulRounds: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RC5_PARAMS"][::std::mem::size_of::<CK_RC5_PARAMS>() - 8usize];
    ["Alignment of CK_RC5_PARAMS"][::std::mem::align_of::<CK_RC5_PARAMS>() - 1usize];
    ["Offset of field: CK_RC5_PARAMS::ulWordsize"]
        [::std::mem::offset_of!(CK_RC5_PARAMS, ulWordsize) - 0usize];
    ["Offset of field: CK_RC5_PARAMS::ulRounds"]
        [::std::mem::offset_of!(CK_RC5_PARAMS, ulRounds) - 4usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_RSA_AES_KEY_WRAP_PARAMS {
    pub ulAESKeyBits: CK_ULONG,
    pub pOAEPParams: *mut CK_RSA_PKCS_OAEP_PARAMS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RSA_AES_KEY_WRAP_PARAMS"]
        [::std::mem::size_of::<CK_RSA_AES_KEY_WRAP_PARAMS>() - 12usize];
    ["Alignment of CK_RSA_AES_KEY_WRAP_PARAMS"]
        [::std::mem::align_of::<CK_RSA_AES_KEY_WRAP_PARAMS>() - 1usize];
    ["Offset of field: CK_RSA_AES_KEY_WRAP_PARAMS::ulAESKeyBits"]
        [::std::mem::offset_of!(CK_RSA_AES_KEY_WRAP_PARAMS, ulAESKeyBits) - 0usize];
    ["Offset of field: CK_RSA_AES_KEY_WRAP_PARAMS::pOAEPParams"]
        [::std::mem::offset_of!(CK_RSA_AES_KEY_WRAP_PARAMS, pOAEPParams) - 4usize];
};
impl Default for CK_RSA_AES_KEY_WRAP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_RSA_PKCS_OAEP_PARAMS {
    pub hashAlg: CK_MECHANISM_TYPE,
    pub mgf: CK_RSA_PKCS_MGF_TYPE,
    pub source: CK_RSA_PKCS_OAEP_SOURCE_TYPE,
    pub pSourceData: *mut ::std::os::raw::c_void,
    pub ulSourceDataLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RSA_PKCS_OAEP_PARAMS"][::std::mem::size_of::<CK_RSA_PKCS_OAEP_PARAMS>() - 24usize];
    ["Alignment of CK_RSA_PKCS_OAEP_PARAMS"]
        [::std::mem::align_of::<CK_RSA_PKCS_OAEP_PARAMS>() - 1usize];
    ["Offset of field: CK_RSA_PKCS_OAEP_PARAMS::hashAlg"]
        [::std::mem::offset_of!(CK_RSA_PKCS_OAEP_PARAMS, hashAlg) - 0usize];
    ["Offset of field: CK_RSA_PKCS_OAEP_PARAMS::mgf"]
        [::std::mem::offset_of!(CK_RSA_PKCS_OAEP_PARAMS, mgf) - 4usize];
    ["Offset of field: CK_RSA_PKCS_OAEP_PARAMS::source"]
        [::std::mem::offset_of!(CK_RSA_PKCS_OAEP_PARAMS, source) - 8usize];
    ["Offset of field: CK_RSA_PKCS_OAEP_PARAMS::pSourceData"]
        [::std::mem::offset_of!(CK_RSA_PKCS_OAEP_PARAMS, pSourceData) - 12usize];
    ["Offset of field: CK_RSA_PKCS_OAEP_PARAMS::ulSourceDataLen"]
        [::std::mem::offset_of!(CK_RSA_PKCS_OAEP_PARAMS, ulSourceDataLen) - 20usize];
};
impl Default for CK_RSA_PKCS_OAEP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_RSA_PKCS_PSS_PARAMS {
    pub hashAlg: CK_MECHANISM_TYPE,
    pub mgf: CK_RSA_PKCS_MGF_TYPE,
    pub sLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_RSA_PKCS_PSS_PARAMS"][::std::mem::size_of::<CK_RSA_PKCS_PSS_PARAMS>() - 12usize];
    ["Alignment of CK_RSA_PKCS_PSS_PARAMS"]
        [::std::mem::align_of::<CK_RSA_PKCS_PSS_PARAMS>() - 1usize];
    ["Offset of field: CK_RSA_PKCS_PSS_PARAMS::hashAlg"]
        [::std::mem::offset_of!(CK_RSA_PKCS_PSS_PARAMS, hashAlg) - 0usize];
    ["Offset of field: CK_RSA_PKCS_PSS_PARAMS::mgf"]
        [::std::mem::offset_of!(CK_RSA_PKCS_PSS_PARAMS, mgf) - 4usize];
    ["Offset of field: CK_RSA_PKCS_PSS_PARAMS::sLen"]
        [::std::mem::offset_of!(CK_RSA_PKCS_PSS_PARAMS, sLen) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS {
    pub pNonce: *mut CK_BYTE,
    pub ulNonceLen: CK_ULONG,
    pub pTag: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS"]
        [::std::mem::size_of::<CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS>() - 20usize];
    ["Alignment of CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS"]
        [::std::mem::align_of::<CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS>() - 1usize];
    ["Offset of field: CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS, pNonce) - 0usize];
    ["Offset of field: CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS::ulNonceLen"]
        [::std::mem::offset_of!(CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS, ulNonceLen) - 8usize];
    ["Offset of field: CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS::pTag"]
        [::std::mem::offset_of!(CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS, pTag) - 12usize];
};
impl Default for CK_SALSA20_CHACHA20_POLY1305_MSG_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SALSA20_CHACHA20_POLY1305_PARAMS {
    pub pNonce: *mut CK_BYTE,
    pub ulNonceLen: CK_ULONG,
    pub pAAD: *mut CK_BYTE,
    pub ulAADLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SALSA20_CHACHA20_POLY1305_PARAMS"]
        [::std::mem::size_of::<CK_SALSA20_CHACHA20_POLY1305_PARAMS>() - 24usize];
    ["Alignment of CK_SALSA20_CHACHA20_POLY1305_PARAMS"]
        [::std::mem::align_of::<CK_SALSA20_CHACHA20_POLY1305_PARAMS>() - 1usize];
    ["Offset of field: CK_SALSA20_CHACHA20_POLY1305_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_SALSA20_CHACHA20_POLY1305_PARAMS, pNonce) - 0usize];
    ["Offset of field: CK_SALSA20_CHACHA20_POLY1305_PARAMS::ulNonceLen"]
        [::std::mem::offset_of!(CK_SALSA20_CHACHA20_POLY1305_PARAMS, ulNonceLen) - 8usize];
    ["Offset of field: CK_SALSA20_CHACHA20_POLY1305_PARAMS::pAAD"]
        [::std::mem::offset_of!(CK_SALSA20_CHACHA20_POLY1305_PARAMS, pAAD) - 12usize];
    ["Offset of field: CK_SALSA20_CHACHA20_POLY1305_PARAMS::ulAADLen"]
        [::std::mem::offset_of!(CK_SALSA20_CHACHA20_POLY1305_PARAMS, ulAADLen) - 20usize];
};
impl Default for CK_SALSA20_CHACHA20_POLY1305_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SALSA20_PARAMS {
    pub pBlockCounter: *mut CK_BYTE,
    pub pNonce: *mut CK_BYTE,
    pub ulNonceBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SALSA20_PARAMS"][::std::mem::size_of::<CK_SALSA20_PARAMS>() - 20usize];
    ["Alignment of CK_SALSA20_PARAMS"][::std::mem::align_of::<CK_SALSA20_PARAMS>() - 1usize];
    ["Offset of field: CK_SALSA20_PARAMS::pBlockCounter"]
        [::std::mem::offset_of!(CK_SALSA20_PARAMS, pBlockCounter) - 0usize];
    ["Offset of field: CK_SALSA20_PARAMS::pNonce"]
        [::std::mem::offset_of!(CK_SALSA20_PARAMS, pNonce) - 8usize];
    ["Offset of field: CK_SALSA20_PARAMS::ulNonceBits"]
        [::std::mem::offset_of!(CK_SALSA20_PARAMS, ulNonceBits) - 16usize];
};
impl Default for CK_SALSA20_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SEED_CBC_ENCRYPT_DATA_PARAMS {
    pub iv: [CK_BYTE; 16usize],
    pub pData: *mut CK_BYTE,
    pub length: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SEED_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::size_of::<CK_SEED_CBC_ENCRYPT_DATA_PARAMS>() - 28usize];
    ["Alignment of CK_SEED_CBC_ENCRYPT_DATA_PARAMS"]
        [::std::mem::align_of::<CK_SEED_CBC_ENCRYPT_DATA_PARAMS>() - 1usize];
    ["Offset of field: CK_SEED_CBC_ENCRYPT_DATA_PARAMS::iv"]
        [::std::mem::offset_of!(CK_SEED_CBC_ENCRYPT_DATA_PARAMS, iv) - 0usize];
    ["Offset of field: CK_SEED_CBC_ENCRYPT_DATA_PARAMS::pData"]
        [::std::mem::offset_of!(CK_SEED_CBC_ENCRYPT_DATA_PARAMS, pData) - 16usize];
    ["Offset of field: CK_SEED_CBC_ENCRYPT_DATA_PARAMS::length"]
        [::std::mem::offset_of!(CK_SEED_CBC_ENCRYPT_DATA_PARAMS, length) - 24usize];
};
impl Default for CK_SEED_CBC_ENCRYPT_DATA_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SIGN_ADDITIONAL_CONTEXT {
    pub hedgeVariant: CK_HEDGE_TYPE,
    pub pContext: *mut CK_BYTE,
    pub ulContextLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SIGN_ADDITIONAL_CONTEXT"]
        [::std::mem::size_of::<CK_SIGN_ADDITIONAL_CONTEXT>() - 16usize];
    ["Alignment of CK_SIGN_ADDITIONAL_CONTEXT"]
        [::std::mem::align_of::<CK_SIGN_ADDITIONAL_CONTEXT>() - 1usize];
    ["Offset of field: CK_SIGN_ADDITIONAL_CONTEXT::hedgeVariant"]
        [::std::mem::offset_of!(CK_SIGN_ADDITIONAL_CONTEXT, hedgeVariant) - 0usize];
    ["Offset of field: CK_SIGN_ADDITIONAL_CONTEXT::pContext"]
        [::std::mem::offset_of!(CK_SIGN_ADDITIONAL_CONTEXT, pContext) - 4usize];
    ["Offset of field: CK_SIGN_ADDITIONAL_CONTEXT::ulContextLen"]
        [::std::mem::offset_of!(CK_SIGN_ADDITIONAL_CONTEXT, ulContextLen) - 12usize];
};
impl Default for CK_SIGN_ADDITIONAL_CONTEXT {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SKIPJACK_PRIVATE_WRAP_PARAMS {
    pub ulPasswordLen: CK_ULONG,
    pub pPassword: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub pPublicData: *mut CK_BYTE,
    pub ulPAndGLen: CK_ULONG,
    pub ulQLen: CK_ULONG,
    pub ulRandomLen: CK_ULONG,
    pub pRandomA: *mut CK_BYTE,
    pub pPrimeP: *mut CK_BYTE,
    pub pBaseG: *mut CK_BYTE,
    pub pSubprimeQ: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SKIPJACK_PRIVATE_WRAP_PARAMS"]
        [::std::mem::size_of::<CK_SKIPJACK_PRIVATE_WRAP_PARAMS>() - 68usize];
    ["Alignment of CK_SKIPJACK_PRIVATE_WRAP_PARAMS"]
        [::std::mem::align_of::<CK_SKIPJACK_PRIVATE_WRAP_PARAMS>() - 1usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::ulPasswordLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, ulPasswordLen) - 0usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::pPassword"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, pPassword) - 4usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, ulPublicDataLen) - 12usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::pPublicData"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, pPublicData) - 16usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::ulPAndGLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, ulPAndGLen) - 24usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::ulQLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, ulQLen) - 28usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::ulRandomLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, ulRandomLen) - 32usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::pRandomA"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, pRandomA) - 36usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::pPrimeP"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, pPrimeP) - 44usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::pBaseG"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, pBaseG) - 52usize];
    ["Offset of field: CK_SKIPJACK_PRIVATE_WRAP_PARAMS::pSubprimeQ"]
        [::std::mem::offset_of!(CK_SKIPJACK_PRIVATE_WRAP_PARAMS, pSubprimeQ) - 60usize];
};
impl Default for CK_SKIPJACK_PRIVATE_WRAP_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SKIPJACK_RELAYX_PARAMS {
    pub ulOldWrappedXLen: CK_ULONG,
    pub pOldWrappedX: *mut CK_BYTE,
    pub ulOldPasswordLen: CK_ULONG,
    pub pOldPassword: *mut CK_BYTE,
    pub ulOldPublicDataLen: CK_ULONG,
    pub pOldPublicData: *mut CK_BYTE,
    pub ulOldRandomLen: CK_ULONG,
    pub pOldRandomA: *mut CK_BYTE,
    pub ulNewPasswordLen: CK_ULONG,
    pub pNewPassword: *mut CK_BYTE,
    pub ulNewPublicDataLen: CK_ULONG,
    pub pNewPublicData: *mut CK_BYTE,
    pub ulNewRandomLen: CK_ULONG,
    pub pNewRandomA: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SKIPJACK_RELAYX_PARAMS"]
        [::std::mem::size_of::<CK_SKIPJACK_RELAYX_PARAMS>() - 84usize];
    ["Alignment of CK_SKIPJACK_RELAYX_PARAMS"]
        [::std::mem::align_of::<CK_SKIPJACK_RELAYX_PARAMS>() - 1usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::ulOldWrappedXLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, ulOldWrappedXLen) - 0usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::pOldWrappedX"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, pOldWrappedX) - 4usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::ulOldPasswordLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, ulOldPasswordLen) - 12usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::pOldPassword"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, pOldPassword) - 16usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::ulOldPublicDataLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, ulOldPublicDataLen) - 24usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::pOldPublicData"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, pOldPublicData) - 28usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::ulOldRandomLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, ulOldRandomLen) - 36usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::pOldRandomA"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, pOldRandomA) - 40usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::ulNewPasswordLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, ulNewPasswordLen) - 48usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::pNewPassword"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, pNewPassword) - 52usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::ulNewPublicDataLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, ulNewPublicDataLen) - 60usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::pNewPublicData"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, pNewPublicData) - 64usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::ulNewRandomLen"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, ulNewRandomLen) - 72usize];
    ["Offset of field: CK_SKIPJACK_RELAYX_PARAMS::pNewRandomA"]
        [::std::mem::offset_of!(CK_SKIPJACK_RELAYX_PARAMS, pNewRandomA) - 76usize];
};
impl Default for CK_SKIPJACK_RELAYX_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_SP800_108_COUNTER_FORMAT {
    pub bLittleEndian: CK_BBOOL,
    pub ulWidthInBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SP800_108_COUNTER_FORMAT"]
        [::std::mem::size_of::<CK_SP800_108_COUNTER_FORMAT>() - 5usize];
    ["Alignment of CK_SP800_108_COUNTER_FORMAT"]
        [::std::mem::align_of::<CK_SP800_108_COUNTER_FORMAT>() - 1usize];
    ["Offset of field: CK_SP800_108_COUNTER_FORMAT::bLittleEndian"]
        [::std::mem::offset_of!(CK_SP800_108_COUNTER_FORMAT, bLittleEndian) - 0usize];
    ["Offset of field: CK_SP800_108_COUNTER_FORMAT::ulWidthInBits"]
        [::std::mem::offset_of!(CK_SP800_108_COUNTER_FORMAT, ulWidthInBits) - 1usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_SP800_108_DKM_LENGTH_FORMAT {
    pub dkmLengthMethod: CK_SP800_108_DKM_LENGTH_METHOD,
    pub bLittleEndian: CK_BBOOL,
    pub ulWidthInBits: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SP800_108_DKM_LENGTH_FORMAT"]
        [::std::mem::size_of::<CK_SP800_108_DKM_LENGTH_FORMAT>() - 9usize];
    ["Alignment of CK_SP800_108_DKM_LENGTH_FORMAT"]
        [::std::mem::align_of::<CK_SP800_108_DKM_LENGTH_FORMAT>() - 1usize];
    ["Offset of field: CK_SP800_108_DKM_LENGTH_FORMAT::dkmLengthMethod"]
        [::std::mem::offset_of!(CK_SP800_108_DKM_LENGTH_FORMAT, dkmLengthMethod) - 0usize];
    ["Offset of field: CK_SP800_108_DKM_LENGTH_FORMAT::bLittleEndian"]
        [::std::mem::offset_of!(CK_SP800_108_DKM_LENGTH_FORMAT, bLittleEndian) - 4usize];
    ["Offset of field: CK_SP800_108_DKM_LENGTH_FORMAT::ulWidthInBits"]
        [::std::mem::offset_of!(CK_SP800_108_DKM_LENGTH_FORMAT, ulWidthInBits) - 5usize];
};
pub type CK_SP800_108_PRF_TYPE = CK_MECHANISM_TYPE;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SP800_108_FEEDBACK_KDF_PARAMS {
    pub prfType: CK_SP800_108_PRF_TYPE,
    pub ulNumberOfDataParams: CK_ULONG,
    pub pDataParams: *mut CK_PRF_DATA_PARAM,
    pub ulIVLen: CK_ULONG,
    pub pIV: *mut CK_BYTE,
    pub ulAdditionalDerivedKeys: CK_ULONG,
    pub pAdditionalDerivedKeys: *mut CK_DERIVED_KEY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SP800_108_FEEDBACK_KDF_PARAMS"]
        [::std::mem::size_of::<CK_SP800_108_FEEDBACK_KDF_PARAMS>() - 40usize];
    ["Alignment of CK_SP800_108_FEEDBACK_KDF_PARAMS"]
        [::std::mem::align_of::<CK_SP800_108_FEEDBACK_KDF_PARAMS>() - 1usize];
    ["Offset of field: CK_SP800_108_FEEDBACK_KDF_PARAMS::prfType"]
        [::std::mem::offset_of!(CK_SP800_108_FEEDBACK_KDF_PARAMS, prfType) - 0usize];
    ["Offset of field: CK_SP800_108_FEEDBACK_KDF_PARAMS::ulNumberOfDataParams"]
        [::std::mem::offset_of!(CK_SP800_108_FEEDBACK_KDF_PARAMS, ulNumberOfDataParams) - 4usize];
    ["Offset of field: CK_SP800_108_FEEDBACK_KDF_PARAMS::pDataParams"]
        [::std::mem::offset_of!(CK_SP800_108_FEEDBACK_KDF_PARAMS, pDataParams) - 8usize];
    ["Offset of field: CK_SP800_108_FEEDBACK_KDF_PARAMS::ulIVLen"]
        [::std::mem::offset_of!(CK_SP800_108_FEEDBACK_KDF_PARAMS, ulIVLen) - 16usize];
    ["Offset of field: CK_SP800_108_FEEDBACK_KDF_PARAMS::pIV"]
        [::std::mem::offset_of!(CK_SP800_108_FEEDBACK_KDF_PARAMS, pIV) - 20usize];
    ["Offset of field: CK_SP800_108_FEEDBACK_KDF_PARAMS::ulAdditionalDerivedKeys"][::std::mem::offset_of!(
        CK_SP800_108_FEEDBACK_KDF_PARAMS,
        ulAdditionalDerivedKeys
    ) - 28usize];
    ["Offset of field: CK_SP800_108_FEEDBACK_KDF_PARAMS::pAdditionalDerivedKeys"][::std::mem::offset_of!(
        CK_SP800_108_FEEDBACK_KDF_PARAMS,
        pAdditionalDerivedKeys
    ) - 32usize];
};
impl Default for CK_SP800_108_FEEDBACK_KDF_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS {
    pub prfHashMechanism: CK_MECHANISM_TYPE,
    pub pSessionHash: *mut CK_BYTE,
    pub ulSessionHashLen: CK_ULONG,
    pub pVersion: *mut CK_VERSION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS>() - 24usize];
    ["Alignment of CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS::prfHashMechanism"][::std::mem::offset_of!(
        CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS,
        prfHashMechanism
    ) - 0usize];
    ["Offset of field: CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS::pSessionHash"]
        [::std::mem::offset_of!(CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS, pSessionHash) - 4usize];
    ["Offset of field: CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS::ulSessionHashLen"][::std::mem::offset_of!(
        CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS,
        ulSessionHashLen
    ) - 12usize];
    ["Offset of field: CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS::pVersion"]
        [::std::mem::offset_of!(CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS, pVersion) - 16usize];
};
impl Default for CK_TLS12_EXTENDED_MASTER_KEY_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SP800_108_KDF_PARAMS {
    pub prfType: CK_SP800_108_PRF_TYPE,
    pub ulNumberOfDataParams: CK_ULONG,
    pub pDataParams: *mut CK_PRF_DATA_PARAM,
    pub ulAdditionalDerivedKeys: CK_ULONG,
    pub pAdditionalDerivedKeys: *mut CK_DERIVED_KEY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SP800_108_KDF_PARAMS"][::std::mem::size_of::<CK_SP800_108_KDF_PARAMS>() - 28usize];
    ["Alignment of CK_SP800_108_KDF_PARAMS"]
        [::std::mem::align_of::<CK_SP800_108_KDF_PARAMS>() - 1usize];
    ["Offset of field: CK_SP800_108_KDF_PARAMS::prfType"]
        [::std::mem::offset_of!(CK_SP800_108_KDF_PARAMS, prfType) - 0usize];
    ["Offset of field: CK_SP800_108_KDF_PARAMS::ulNumberOfDataParams"]
        [::std::mem::offset_of!(CK_SP800_108_KDF_PARAMS, ulNumberOfDataParams) - 4usize];
    ["Offset of field: CK_SP800_108_KDF_PARAMS::pDataParams"]
        [::std::mem::offset_of!(CK_SP800_108_KDF_PARAMS, pDataParams) - 8usize];
    ["Offset of field: CK_SP800_108_KDF_PARAMS::ulAdditionalDerivedKeys"]
        [::std::mem::offset_of!(CK_SP800_108_KDF_PARAMS, ulAdditionalDerivedKeys) - 16usize];
    ["Offset of field: CK_SP800_108_KDF_PARAMS::pAdditionalDerivedKeys"]
        [::std::mem::offset_of!(CK_SP800_108_KDF_PARAMS, pAdditionalDerivedKeys) - 20usize];
};
impl Default for CK_SP800_108_KDF_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_X2RATCHET_INITIALIZE_PARAMS {
    pub sk: *mut CK_BYTE,
    pub peer_public_prekey: CK_OBJECT_HANDLE,
    pub peer_public_identity: CK_OBJECT_HANDLE,
    pub own_public_identity: CK_OBJECT_HANDLE,
    pub bEncryptedHeader: CK_BBOOL,
    pub eCurve: CK_ULONG,
    pub aeadMechanism: CK_MECHANISM_TYPE,
    pub kdfMechanism: CK_X2RATCHET_KDF_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_X2RATCHET_INITIALIZE_PARAMS"]
        [::std::mem::size_of::<CK_X2RATCHET_INITIALIZE_PARAMS>() - 33usize];
    ["Alignment of CK_X2RATCHET_INITIALIZE_PARAMS"]
        [::std::mem::align_of::<CK_X2RATCHET_INITIALIZE_PARAMS>() - 1usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::sk"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, sk) - 0usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::peer_public_prekey"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, peer_public_prekey) - 8usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::peer_public_identity"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, peer_public_identity) - 12usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::own_public_identity"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, own_public_identity) - 16usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::bEncryptedHeader"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, bEncryptedHeader) - 20usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::eCurve"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, eCurve) - 21usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::aeadMechanism"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, aeadMechanism) - 25usize];
    ["Offset of field: CK_X2RATCHET_INITIALIZE_PARAMS::kdfMechanism"]
        [::std::mem::offset_of!(CK_X2RATCHET_INITIALIZE_PARAMS, kdfMechanism) - 29usize];
};
impl Default for CK_X2RATCHET_INITIALIZE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_X2RATCHET_RESPOND_PARAMS {
    pub sk: *mut CK_BYTE,
    pub own_prekey: CK_OBJECT_HANDLE,
    pub initiator_identity: CK_OBJECT_HANDLE,
    pub own_public_identity: CK_OBJECT_HANDLE,
    pub bEncryptedHeader: CK_BBOOL,
    pub eCurve: CK_ULONG,
    pub aeadMechanism: CK_MECHANISM_TYPE,
    pub kdfMechanism: CK_X2RATCHET_KDF_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_X2RATCHET_RESPOND_PARAMS"]
        [::std::mem::size_of::<CK_X2RATCHET_RESPOND_PARAMS>() - 33usize];
    ["Alignment of CK_X2RATCHET_RESPOND_PARAMS"]
        [::std::mem::align_of::<CK_X2RATCHET_RESPOND_PARAMS>() - 1usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::sk"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, sk) - 0usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::own_prekey"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, own_prekey) - 8usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::initiator_identity"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, initiator_identity) - 12usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::own_public_identity"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, own_public_identity) - 16usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::bEncryptedHeader"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, bEncryptedHeader) - 20usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::eCurve"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, eCurve) - 21usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::aeadMechanism"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, aeadMechanism) - 25usize];
    ["Offset of field: CK_X2RATCHET_RESPOND_PARAMS::kdfMechanism"]
        [::std::mem::offset_of!(CK_X2RATCHET_RESPOND_PARAMS, kdfMechanism) - 29usize];
};
impl Default for CK_X2RATCHET_RESPOND_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_X3DH_INITIATE_PARAMS {
    pub kdf: CK_X3DH_KDF_TYPE,
    pub pPeer_identity: CK_OBJECT_HANDLE,
    pub pPeer_prekey: CK_OBJECT_HANDLE,
    pub pPrekey_signature: *mut CK_BYTE,
    pub pOnetime_key: *mut CK_BYTE,
    pub pOwn_identity: CK_OBJECT_HANDLE,
    pub pOwn_ephemeral: CK_OBJECT_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_X3DH_INITIATE_PARAMS"][::std::mem::size_of::<CK_X3DH_INITIATE_PARAMS>() - 36usize];
    ["Alignment of CK_X3DH_INITIATE_PARAMS"]
        [::std::mem::align_of::<CK_X3DH_INITIATE_PARAMS>() - 1usize];
    ["Offset of field: CK_X3DH_INITIATE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_X3DH_INITIATE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_X3DH_INITIATE_PARAMS::pPeer_identity"]
        [::std::mem::offset_of!(CK_X3DH_INITIATE_PARAMS, pPeer_identity) - 4usize];
    ["Offset of field: CK_X3DH_INITIATE_PARAMS::pPeer_prekey"]
        [::std::mem::offset_of!(CK_X3DH_INITIATE_PARAMS, pPeer_prekey) - 8usize];
    ["Offset of field: CK_X3DH_INITIATE_PARAMS::pPrekey_signature"]
        [::std::mem::offset_of!(CK_X3DH_INITIATE_PARAMS, pPrekey_signature) - 12usize];
    ["Offset of field: CK_X3DH_INITIATE_PARAMS::pOnetime_key"]
        [::std::mem::offset_of!(CK_X3DH_INITIATE_PARAMS, pOnetime_key) - 20usize];
    ["Offset of field: CK_X3DH_INITIATE_PARAMS::pOwn_identity"]
        [::std::mem::offset_of!(CK_X3DH_INITIATE_PARAMS, pOwn_identity) - 28usize];
    ["Offset of field: CK_X3DH_INITIATE_PARAMS::pOwn_ephemeral"]
        [::std::mem::offset_of!(CK_X3DH_INITIATE_PARAMS, pOwn_ephemeral) - 32usize];
};
impl Default for CK_X3DH_INITIATE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_X3DH_RESPOND_PARAMS {
    pub kdf: CK_X3DH_KDF_TYPE,
    pub pIdentity_id: *mut CK_BYTE,
    pub pPrekey_id: *mut CK_BYTE,
    pub pOnetime_id: *mut CK_BYTE,
    pub pInitiator_identity: CK_OBJECT_HANDLE,
    pub pInitiator_ephemeral: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_X3DH_RESPOND_PARAMS"][::std::mem::size_of::<CK_X3DH_RESPOND_PARAMS>() - 40usize];
    ["Alignment of CK_X3DH_RESPOND_PARAMS"]
        [::std::mem::align_of::<CK_X3DH_RESPOND_PARAMS>() - 1usize];
    ["Offset of field: CK_X3DH_RESPOND_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_X3DH_RESPOND_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_X3DH_RESPOND_PARAMS::pIdentity_id"]
        [::std::mem::offset_of!(CK_X3DH_RESPOND_PARAMS, pIdentity_id) - 4usize];
    ["Offset of field: CK_X3DH_RESPOND_PARAMS::pPrekey_id"]
        [::std::mem::offset_of!(CK_X3DH_RESPOND_PARAMS, pPrekey_id) - 12usize];
    ["Offset of field: CK_X3DH_RESPOND_PARAMS::pOnetime_id"]
        [::std::mem::offset_of!(CK_X3DH_RESPOND_PARAMS, pOnetime_id) - 20usize];
    ["Offset of field: CK_X3DH_RESPOND_PARAMS::pInitiator_identity"]
        [::std::mem::offset_of!(CK_X3DH_RESPOND_PARAMS, pInitiator_identity) - 28usize];
    ["Offset of field: CK_X3DH_RESPOND_PARAMS::pInitiator_ephemeral"]
        [::std::mem::offset_of!(CK_X3DH_RESPOND_PARAMS, pInitiator_ephemeral) - 32usize];
};
impl Default for CK_X3DH_RESPOND_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_X9_42_DH1_DERIVE_PARAMS {
    pub kdf: CK_X9_42_DH_KDF_TYPE,
    pub ulOtherInfoLen: CK_ULONG,
    pub pOtherInfo: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub pPublicData: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_X9_42_DH1_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_X9_42_DH1_DERIVE_PARAMS>() - 28usize];
    ["Alignment of CK_X9_42_DH1_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_X9_42_DH1_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_X9_42_DH1_DERIVE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_X9_42_DH1_DERIVE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_X9_42_DH1_DERIVE_PARAMS::ulOtherInfoLen"]
        [::std::mem::offset_of!(CK_X9_42_DH1_DERIVE_PARAMS, ulOtherInfoLen) - 4usize];
    ["Offset of field: CK_X9_42_DH1_DERIVE_PARAMS::pOtherInfo"]
        [::std::mem::offset_of!(CK_X9_42_DH1_DERIVE_PARAMS, pOtherInfo) - 8usize];
    ["Offset of field: CK_X9_42_DH1_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_X9_42_DH1_DERIVE_PARAMS, ulPublicDataLen) - 16usize];
    ["Offset of field: CK_X9_42_DH1_DERIVE_PARAMS::pPublicData"]
        [::std::mem::offset_of!(CK_X9_42_DH1_DERIVE_PARAMS, pPublicData) - 20usize];
};
impl Default for CK_X9_42_DH1_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_X9_42_DH2_DERIVE_PARAMS {
    pub kdf: CK_X9_42_DH_KDF_TYPE,
    pub ulOtherInfoLen: CK_ULONG,
    pub pOtherInfo: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub pPublicData: *mut CK_BYTE,
    pub ulPrivateDataLen: CK_ULONG,
    pub hPrivateData: CK_OBJECT_HANDLE,
    pub ulPublicDataLen2: CK_ULONG,
    pub pPublicData2: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_X9_42_DH2_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_X9_42_DH2_DERIVE_PARAMS>() - 48usize];
    ["Alignment of CK_X9_42_DH2_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_X9_42_DH2_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::ulOtherInfoLen"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, ulOtherInfoLen) - 4usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::pOtherInfo"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, pOtherInfo) - 8usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, ulPublicDataLen) - 16usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::pPublicData"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, pPublicData) - 20usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::ulPrivateDataLen"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, ulPrivateDataLen) - 28usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::hPrivateData"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, hPrivateData) - 32usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::ulPublicDataLen2"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, ulPublicDataLen2) - 36usize];
    ["Offset of field: CK_X9_42_DH2_DERIVE_PARAMS::pPublicData2"]
        [::std::mem::offset_of!(CK_X9_42_DH2_DERIVE_PARAMS, pPublicData2) - 40usize];
};
impl Default for CK_X9_42_DH2_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_X9_42_MQV_DERIVE_PARAMS {
    pub kdf: CK_X9_42_DH_KDF_TYPE,
    pub ulOtherInfoLen: CK_ULONG,
    pub OtherInfo: *mut CK_BYTE,
    pub ulPublicDataLen: CK_ULONG,
    pub PublicData: *mut CK_BYTE,
    pub ulPrivateDataLen: CK_ULONG,
    pub hPrivateData: CK_OBJECT_HANDLE,
    pub ulPublicDataLen2: CK_ULONG,
    pub PublicData2: *mut CK_BYTE,
    pub publicKey: CK_OBJECT_HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_X9_42_MQV_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_X9_42_MQV_DERIVE_PARAMS>() - 52usize];
    ["Alignment of CK_X9_42_MQV_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_X9_42_MQV_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::kdf"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, kdf) - 0usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::ulOtherInfoLen"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, ulOtherInfoLen) - 4usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::OtherInfo"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, OtherInfo) - 8usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::ulPublicDataLen"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, ulPublicDataLen) - 16usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::PublicData"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, PublicData) - 20usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::ulPrivateDataLen"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, ulPrivateDataLen) - 28usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::hPrivateData"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, hPrivateData) - 32usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::ulPublicDataLen2"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, ulPublicDataLen2) - 36usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::PublicData2"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, PublicData2) - 40usize];
    ["Offset of field: CK_X9_42_MQV_DERIVE_PARAMS::publicKey"]
        [::std::mem::offset_of!(CK_X9_42_MQV_DERIVE_PARAMS, publicKey) - 48usize];
};
impl Default for CK_X9_42_MQV_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_XEDDSA_PARAMS {
    pub hash: CK_XEDDSA_HASH_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_XEDDSA_PARAMS"][::std::mem::size_of::<CK_XEDDSA_PARAMS>() - 4usize];
    ["Alignment of CK_XEDDSA_PARAMS"][::std::mem::align_of::<CK_XEDDSA_PARAMS>() - 1usize];
    ["Offset of field: CK_XEDDSA_PARAMS::hash"]
        [::std::mem::offset_of!(CK_XEDDSA_PARAMS, hash) - 0usize];
};
pub type CK_SSL3_KEY_MAT_OUT_PTR = *mut CK_SSL3_KEY_MAT_OUT;
pub type CK_SSL3_KEY_MAT_OUT_PTR_PTR = *mut *mut CK_SSL3_KEY_MAT_OUT;
pub type CK_SSL3_KEY_MAT_PARAMS_PTR = *mut CK_SSL3_KEY_MAT_PARAMS;
pub type CK_SSL3_KEY_MAT_PARAMS_PTR_PTR = *mut *mut CK_SSL3_KEY_MAT_PARAMS;
pub type CK_SSL3_MASTER_KEY_DERIVE_PARAMS_PTR = *mut CK_SSL3_MASTER_KEY_DERIVE_PARAMS;
pub type CK_SSL3_MASTER_KEY_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_SSL3_MASTER_KEY_DERIVE_PARAMS;
pub type CK_SSL3_RANDOM_DATA_PTR = *mut CK_SSL3_RANDOM_DATA;
pub type CK_SSL3_RANDOM_DATA_PTR_PTR = *mut *mut CK_SSL3_RANDOM_DATA;
pub type CK_TLS_KDF_PARAMS_PTR = *mut CK_TLS_KDF_PARAMS;
pub type CK_TLS_KDF_PARAMS_PTR_PTR = *mut *mut CK_TLS_KDF_PARAMS;
pub type CK_TLS_MAC_PARAMS_PTR = *mut CK_TLS_MAC_PARAMS;
pub type CK_TLS_MAC_PARAMS_PTR_PTR = *mut *mut CK_TLS_MAC_PARAMS;
pub type CK_TLS_PRF_PARAMS_PTR = *mut CK_TLS_PRF_PARAMS;
pub type CK_TLS_PRF_PARAMS_PTR_PTR = *mut *mut CK_TLS_PRF_PARAMS;
pub type CK_TLS12_KEY_MAT_PARAMS_PTR = *mut CK_TLS12_KEY_MAT_PARAMS;
pub type CK_TLS12_KEY_MAT_PARAMS_PTR_PTR = *mut *mut CK_TLS12_KEY_MAT_PARAMS;
pub type CK_TLS12_MASTER_KEY_DERIVE_PARAMS_PTR = *mut CK_TLS12_MASTER_KEY_DERIVE_PARAMS;
pub type CK_TLS12_MASTER_KEY_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_TLS12_MASTER_KEY_DERIVE_PARAMS;
pub type CK_WTLS_KEY_MAT_OUT_PTR = *mut CK_WTLS_KEY_MAT_OUT;
pub type CK_WTLS_KEY_MAT_OUT_PTR_PTR = *mut *mut CK_WTLS_KEY_MAT_OUT;
pub type CK_WTLS_KEY_MAT_PARAMS_PTR = *mut CK_WTLS_KEY_MAT_PARAMS;
pub type CK_WTLS_KEY_MAT_PARAMS_PTR_PTR = *mut *mut CK_WTLS_KEY_MAT_PARAMS;
pub type CK_WTLS_MASTER_KEY_DERIVE_PARAMS_PTR = *mut CK_WTLS_MASTER_KEY_DERIVE_PARAMS;
pub type CK_WTLS_MASTER_KEY_DERIVE_PARAMS_PTR_PTR = *mut *mut CK_WTLS_MASTER_KEY_DERIVE_PARAMS;
pub type CK_WTLS_PRF_PARAMS_PTR = *mut CK_WTLS_PRF_PARAMS;
pub type CK_WTLS_PRF_PARAMS_PTR_PTR = *mut *mut CK_WTLS_PRF_PARAMS;
pub type CK_WTLS_RANDOM_DATA_PTR = *mut CK_WTLS_RANDOM_DATA;
pub type CK_WTLS_RANDOM_DATA_PTR_PTR = *mut *mut CK_WTLS_RANDOM_DATA;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SSL3_KEY_MAT_OUT {
    pub hClientMacSecret: CK_OBJECT_HANDLE,
    pub hServerMacSecret: CK_OBJECT_HANDLE,
    pub hClientKey: CK_OBJECT_HANDLE,
    pub hServerKey: CK_OBJECT_HANDLE,
    pub pIVClient: *mut CK_BYTE,
    pub pIVServer: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SSL3_KEY_MAT_OUT"][::std::mem::size_of::<CK_SSL3_KEY_MAT_OUT>() - 32usize];
    ["Alignment of CK_SSL3_KEY_MAT_OUT"][::std::mem::align_of::<CK_SSL3_KEY_MAT_OUT>() - 1usize];
    ["Offset of field: CK_SSL3_KEY_MAT_OUT::hClientMacSecret"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_OUT, hClientMacSecret) - 0usize];
    ["Offset of field: CK_SSL3_KEY_MAT_OUT::hServerMacSecret"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_OUT, hServerMacSecret) - 4usize];
    ["Offset of field: CK_SSL3_KEY_MAT_OUT::hClientKey"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_OUT, hClientKey) - 8usize];
    ["Offset of field: CK_SSL3_KEY_MAT_OUT::hServerKey"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_OUT, hServerKey) - 12usize];
    ["Offset of field: CK_SSL3_KEY_MAT_OUT::pIVClient"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_OUT, pIVClient) - 16usize];
    ["Offset of field: CK_SSL3_KEY_MAT_OUT::pIVServer"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_OUT, pIVServer) - 24usize];
};
impl Default for CK_SSL3_KEY_MAT_OUT {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SSL3_RANDOM_DATA {
    pub pClientRandom: *mut CK_BYTE,
    pub ulClientRandomLen: CK_ULONG,
    pub pServerRandom: *mut CK_BYTE,
    pub ulServerRandomLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SSL3_RANDOM_DATA"][::std::mem::size_of::<CK_SSL3_RANDOM_DATA>() - 24usize];
    ["Alignment of CK_SSL3_RANDOM_DATA"][::std::mem::align_of::<CK_SSL3_RANDOM_DATA>() - 1usize];
    ["Offset of field: CK_SSL3_RANDOM_DATA::pClientRandom"]
        [::std::mem::offset_of!(CK_SSL3_RANDOM_DATA, pClientRandom) - 0usize];
    ["Offset of field: CK_SSL3_RANDOM_DATA::ulClientRandomLen"]
        [::std::mem::offset_of!(CK_SSL3_RANDOM_DATA, ulClientRandomLen) - 8usize];
    ["Offset of field: CK_SSL3_RANDOM_DATA::pServerRandom"]
        [::std::mem::offset_of!(CK_SSL3_RANDOM_DATA, pServerRandom) - 12usize];
    ["Offset of field: CK_SSL3_RANDOM_DATA::ulServerRandomLen"]
        [::std::mem::offset_of!(CK_SSL3_RANDOM_DATA, ulServerRandomLen) - 20usize];
};
impl Default for CK_SSL3_RANDOM_DATA {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SSL3_KEY_MAT_PARAMS {
    pub ulMacSizeInBits: CK_ULONG,
    pub ulKeySizeInBits: CK_ULONG,
    pub ulIVSizeInBits: CK_ULONG,
    pub bIsExport: CK_BBOOL,
    pub RandomInfo: CK_SSL3_RANDOM_DATA,
    pub pReturnedKeyMaterial: *mut CK_SSL3_KEY_MAT_OUT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SSL3_KEY_MAT_PARAMS"][::std::mem::size_of::<CK_SSL3_KEY_MAT_PARAMS>() - 45usize];
    ["Alignment of CK_SSL3_KEY_MAT_PARAMS"]
        [::std::mem::align_of::<CK_SSL3_KEY_MAT_PARAMS>() - 1usize];
    ["Offset of field: CK_SSL3_KEY_MAT_PARAMS::ulMacSizeInBits"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_PARAMS, ulMacSizeInBits) - 0usize];
    ["Offset of field: CK_SSL3_KEY_MAT_PARAMS::ulKeySizeInBits"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_PARAMS, ulKeySizeInBits) - 4usize];
    ["Offset of field: CK_SSL3_KEY_MAT_PARAMS::ulIVSizeInBits"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_PARAMS, ulIVSizeInBits) - 8usize];
    ["Offset of field: CK_SSL3_KEY_MAT_PARAMS::bIsExport"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_PARAMS, bIsExport) - 12usize];
    ["Offset of field: CK_SSL3_KEY_MAT_PARAMS::RandomInfo"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_PARAMS, RandomInfo) - 13usize];
    ["Offset of field: CK_SSL3_KEY_MAT_PARAMS::pReturnedKeyMaterial"]
        [::std::mem::offset_of!(CK_SSL3_KEY_MAT_PARAMS, pReturnedKeyMaterial) - 37usize];
};
impl Default for CK_SSL3_KEY_MAT_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_SSL3_MASTER_KEY_DERIVE_PARAMS {
    pub RandomInfo: CK_SSL3_RANDOM_DATA,
    pub pVersion: *mut CK_VERSION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SSL3_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_SSL3_MASTER_KEY_DERIVE_PARAMS>() - 32usize];
    ["Alignment of CK_SSL3_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_SSL3_MASTER_KEY_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_SSL3_MASTER_KEY_DERIVE_PARAMS::RandomInfo"]
        [::std::mem::offset_of!(CK_SSL3_MASTER_KEY_DERIVE_PARAMS, RandomInfo) - 0usize];
    ["Offset of field: CK_SSL3_MASTER_KEY_DERIVE_PARAMS::pVersion"]
        [::std::mem::offset_of!(CK_SSL3_MASTER_KEY_DERIVE_PARAMS, pVersion) - 24usize];
};
impl Default for CK_SSL3_MASTER_KEY_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_TLS_KDF_PARAMS {
    pub prfMechanism: CK_MECHANISM_TYPE,
    pub pLabel: *mut CK_BYTE,
    pub ulLabelLength: CK_ULONG,
    pub RandomInfo: CK_SSL3_RANDOM_DATA,
    pub pContextData: *mut CK_BYTE,
    pub ulContextDataLength: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_TLS_KDF_PARAMS"][::std::mem::size_of::<CK_TLS_KDF_PARAMS>() - 52usize];
    ["Alignment of CK_TLS_KDF_PARAMS"][::std::mem::align_of::<CK_TLS_KDF_PARAMS>() - 1usize];
    ["Offset of field: CK_TLS_KDF_PARAMS::prfMechanism"]
        [::std::mem::offset_of!(CK_TLS_KDF_PARAMS, prfMechanism) - 0usize];
    ["Offset of field: CK_TLS_KDF_PARAMS::pLabel"]
        [::std::mem::offset_of!(CK_TLS_KDF_PARAMS, pLabel) - 4usize];
    ["Offset of field: CK_TLS_KDF_PARAMS::ulLabelLength"]
        [::std::mem::offset_of!(CK_TLS_KDF_PARAMS, ulLabelLength) - 12usize];
    ["Offset of field: CK_TLS_KDF_PARAMS::RandomInfo"]
        [::std::mem::offset_of!(CK_TLS_KDF_PARAMS, RandomInfo) - 16usize];
    ["Offset of field: CK_TLS_KDF_PARAMS::pContextData"]
        [::std::mem::offset_of!(CK_TLS_KDF_PARAMS, pContextData) - 40usize];
    ["Offset of field: CK_TLS_KDF_PARAMS::ulContextDataLength"]
        [::std::mem::offset_of!(CK_TLS_KDF_PARAMS, ulContextDataLength) - 48usize];
};
impl Default for CK_TLS_KDF_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_TLS_MAC_PARAMS {
    pub prfHashMechanism: CK_MECHANISM_TYPE,
    pub ulMacLength: CK_ULONG,
    pub ulServerOrClient: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_TLS_MAC_PARAMS"][::std::mem::size_of::<CK_TLS_MAC_PARAMS>() - 12usize];
    ["Alignment of CK_TLS_MAC_PARAMS"][::std::mem::align_of::<CK_TLS_MAC_PARAMS>() - 1usize];
    ["Offset of field: CK_TLS_MAC_PARAMS::prfHashMechanism"]
        [::std::mem::offset_of!(CK_TLS_MAC_PARAMS, prfHashMechanism) - 0usize];
    ["Offset of field: CK_TLS_MAC_PARAMS::ulMacLength"]
        [::std::mem::offset_of!(CK_TLS_MAC_PARAMS, ulMacLength) - 4usize];
    ["Offset of field: CK_TLS_MAC_PARAMS::ulServerOrClient"]
        [::std::mem::offset_of!(CK_TLS_MAC_PARAMS, ulServerOrClient) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_TLS_PRF_PARAMS {
    pub pSeed: *mut CK_BYTE,
    pub ulSeedLen: CK_ULONG,
    pub pLabel: *mut CK_BYTE,
    pub ulLabelLen: CK_ULONG,
    pub pOutput: *mut CK_BYTE,
    pub pulOutputLen: *mut CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_TLS_PRF_PARAMS"][::std::mem::size_of::<CK_TLS_PRF_PARAMS>() - 40usize];
    ["Alignment of CK_TLS_PRF_PARAMS"][::std::mem::align_of::<CK_TLS_PRF_PARAMS>() - 1usize];
    ["Offset of field: CK_TLS_PRF_PARAMS::pSeed"]
        [::std::mem::offset_of!(CK_TLS_PRF_PARAMS, pSeed) - 0usize];
    ["Offset of field: CK_TLS_PRF_PARAMS::ulSeedLen"]
        [::std::mem::offset_of!(CK_TLS_PRF_PARAMS, ulSeedLen) - 8usize];
    ["Offset of field: CK_TLS_PRF_PARAMS::pLabel"]
        [::std::mem::offset_of!(CK_TLS_PRF_PARAMS, pLabel) - 12usize];
    ["Offset of field: CK_TLS_PRF_PARAMS::ulLabelLen"]
        [::std::mem::offset_of!(CK_TLS_PRF_PARAMS, ulLabelLen) - 20usize];
    ["Offset of field: CK_TLS_PRF_PARAMS::pOutput"]
        [::std::mem::offset_of!(CK_TLS_PRF_PARAMS, pOutput) - 24usize];
    ["Offset of field: CK_TLS_PRF_PARAMS::pulOutputLen"]
        [::std::mem::offset_of!(CK_TLS_PRF_PARAMS, pulOutputLen) - 32usize];
};
impl Default for CK_TLS_PRF_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_TLS12_KEY_MAT_PARAMS {
    pub ulMacSizeInBits: CK_ULONG,
    pub ulKeySizeInBits: CK_ULONG,
    pub ulIVSizeInBits: CK_ULONG,
    pub bIsExport: CK_BBOOL,
    pub RandomInfo: CK_SSL3_RANDOM_DATA,
    pub pReturnedKeyMaterial: *mut CK_SSL3_KEY_MAT_OUT,
    pub prfHashMechanism: CK_MECHANISM_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_TLS12_KEY_MAT_PARAMS"][::std::mem::size_of::<CK_TLS12_KEY_MAT_PARAMS>() - 49usize];
    ["Alignment of CK_TLS12_KEY_MAT_PARAMS"]
        [::std::mem::align_of::<CK_TLS12_KEY_MAT_PARAMS>() - 1usize];
    ["Offset of field: CK_TLS12_KEY_MAT_PARAMS::ulMacSizeInBits"]
        [::std::mem::offset_of!(CK_TLS12_KEY_MAT_PARAMS, ulMacSizeInBits) - 0usize];
    ["Offset of field: CK_TLS12_KEY_MAT_PARAMS::ulKeySizeInBits"]
        [::std::mem::offset_of!(CK_TLS12_KEY_MAT_PARAMS, ulKeySizeInBits) - 4usize];
    ["Offset of field: CK_TLS12_KEY_MAT_PARAMS::ulIVSizeInBits"]
        [::std::mem::offset_of!(CK_TLS12_KEY_MAT_PARAMS, ulIVSizeInBits) - 8usize];
    ["Offset of field: CK_TLS12_KEY_MAT_PARAMS::bIsExport"]
        [::std::mem::offset_of!(CK_TLS12_KEY_MAT_PARAMS, bIsExport) - 12usize];
    ["Offset of field: CK_TLS12_KEY_MAT_PARAMS::RandomInfo"]
        [::std::mem::offset_of!(CK_TLS12_KEY_MAT_PARAMS, RandomInfo) - 13usize];
    ["Offset of field: CK_TLS12_KEY_MAT_PARAMS::pReturnedKeyMaterial"]
        [::std::mem::offset_of!(CK_TLS12_KEY_MAT_PARAMS, pReturnedKeyMaterial) - 37usize];
    ["Offset of field: CK_TLS12_KEY_MAT_PARAMS::prfHashMechanism"]
        [::std::mem::offset_of!(CK_TLS12_KEY_MAT_PARAMS, prfHashMechanism) - 45usize];
};
impl Default for CK_TLS12_KEY_MAT_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_TLS12_MASTER_KEY_DERIVE_PARAMS {
    pub RandomInfo: CK_SSL3_RANDOM_DATA,
    pub pVersion: *mut CK_VERSION,
    pub prfHashMechanism: CK_MECHANISM_TYPE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_TLS12_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_TLS12_MASTER_KEY_DERIVE_PARAMS>() - 36usize];
    ["Alignment of CK_TLS12_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_TLS12_MASTER_KEY_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_TLS12_MASTER_KEY_DERIVE_PARAMS::RandomInfo"]
        [::std::mem::offset_of!(CK_TLS12_MASTER_KEY_DERIVE_PARAMS, RandomInfo) - 0usize];
    ["Offset of field: CK_TLS12_MASTER_KEY_DERIVE_PARAMS::pVersion"]
        [::std::mem::offset_of!(CK_TLS12_MASTER_KEY_DERIVE_PARAMS, pVersion) - 24usize];
    ["Offset of field: CK_TLS12_MASTER_KEY_DERIVE_PARAMS::prfHashMechanism"]
        [::std::mem::offset_of!(CK_TLS12_MASTER_KEY_DERIVE_PARAMS, prfHashMechanism) - 32usize];
};
impl Default for CK_TLS12_MASTER_KEY_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_WTLS_KEY_MAT_OUT {
    pub hMacSecret: CK_OBJECT_HANDLE,
    pub hKey: CK_OBJECT_HANDLE,
    pub pIV: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_WTLS_KEY_MAT_OUT"][::std::mem::size_of::<CK_WTLS_KEY_MAT_OUT>() - 16usize];
    ["Alignment of CK_WTLS_KEY_MAT_OUT"][::std::mem::align_of::<CK_WTLS_KEY_MAT_OUT>() - 1usize];
    ["Offset of field: CK_WTLS_KEY_MAT_OUT::hMacSecret"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_OUT, hMacSecret) - 0usize];
    ["Offset of field: CK_WTLS_KEY_MAT_OUT::hKey"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_OUT, hKey) - 4usize];
    ["Offset of field: CK_WTLS_KEY_MAT_OUT::pIV"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_OUT, pIV) - 8usize];
};
impl Default for CK_WTLS_KEY_MAT_OUT {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_WTLS_RANDOM_DATA {
    pub pClientRandom: *mut CK_BYTE,
    pub ulClientRandomLen: CK_ULONG,
    pub pServerRandom: *mut CK_BYTE,
    pub ulServerRandomLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_WTLS_RANDOM_DATA"][::std::mem::size_of::<CK_WTLS_RANDOM_DATA>() - 24usize];
    ["Alignment of CK_WTLS_RANDOM_DATA"][::std::mem::align_of::<CK_WTLS_RANDOM_DATA>() - 1usize];
    ["Offset of field: CK_WTLS_RANDOM_DATA::pClientRandom"]
        [::std::mem::offset_of!(CK_WTLS_RANDOM_DATA, pClientRandom) - 0usize];
    ["Offset of field: CK_WTLS_RANDOM_DATA::ulClientRandomLen"]
        [::std::mem::offset_of!(CK_WTLS_RANDOM_DATA, ulClientRandomLen) - 8usize];
    ["Offset of field: CK_WTLS_RANDOM_DATA::pServerRandom"]
        [::std::mem::offset_of!(CK_WTLS_RANDOM_DATA, pServerRandom) - 12usize];
    ["Offset of field: CK_WTLS_RANDOM_DATA::ulServerRandomLen"]
        [::std::mem::offset_of!(CK_WTLS_RANDOM_DATA, ulServerRandomLen) - 20usize];
};
impl Default for CK_WTLS_RANDOM_DATA {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_WTLS_KEY_MAT_PARAMS {
    pub DigestMechanism: CK_MECHANISM_TYPE,
    pub ulMacSizeInBits: CK_ULONG,
    pub ulKeySizeInBits: CK_ULONG,
    pub ulIVSizeInBits: CK_ULONG,
    pub ulSequenceNumber: CK_ULONG,
    pub bIsExport: CK_BBOOL,
    pub RandomInfo: CK_WTLS_RANDOM_DATA,
    pub pReturnedKeyMaterial: *mut CK_WTLS_KEY_MAT_OUT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_WTLS_KEY_MAT_PARAMS"][::std::mem::size_of::<CK_WTLS_KEY_MAT_PARAMS>() - 53usize];
    ["Alignment of CK_WTLS_KEY_MAT_PARAMS"]
        [::std::mem::align_of::<CK_WTLS_KEY_MAT_PARAMS>() - 1usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::DigestMechanism"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, DigestMechanism) - 0usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::ulMacSizeInBits"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, ulMacSizeInBits) - 4usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::ulKeySizeInBits"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, ulKeySizeInBits) - 8usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::ulIVSizeInBits"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, ulIVSizeInBits) - 12usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::ulSequenceNumber"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, ulSequenceNumber) - 16usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::bIsExport"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, bIsExport) - 20usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::RandomInfo"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, RandomInfo) - 21usize];
    ["Offset of field: CK_WTLS_KEY_MAT_PARAMS::pReturnedKeyMaterial"]
        [::std::mem::offset_of!(CK_WTLS_KEY_MAT_PARAMS, pReturnedKeyMaterial) - 45usize];
};
impl Default for CK_WTLS_KEY_MAT_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_WTLS_MASTER_KEY_DERIVE_PARAMS {
    pub DigestMechanism: CK_MECHANISM_TYPE,
    pub RandomInfo: CK_WTLS_RANDOM_DATA,
    pub pVersion: *mut CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_WTLS_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::size_of::<CK_WTLS_MASTER_KEY_DERIVE_PARAMS>() - 36usize];
    ["Alignment of CK_WTLS_MASTER_KEY_DERIVE_PARAMS"]
        [::std::mem::align_of::<CK_WTLS_MASTER_KEY_DERIVE_PARAMS>() - 1usize];
    ["Offset of field: CK_WTLS_MASTER_KEY_DERIVE_PARAMS::DigestMechanism"]
        [::std::mem::offset_of!(CK_WTLS_MASTER_KEY_DERIVE_PARAMS, DigestMechanism) - 0usize];
    ["Offset of field: CK_WTLS_MASTER_KEY_DERIVE_PARAMS::RandomInfo"]
        [::std::mem::offset_of!(CK_WTLS_MASTER_KEY_DERIVE_PARAMS, RandomInfo) - 4usize];
    ["Offset of field: CK_WTLS_MASTER_KEY_DERIVE_PARAMS::pVersion"]
        [::std::mem::offset_of!(CK_WTLS_MASTER_KEY_DERIVE_PARAMS, pVersion) - 28usize];
};
impl Default for CK_WTLS_MASTER_KEY_DERIVE_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct CK_WTLS_PRF_PARAMS {
    pub DigestMechanism: CK_MECHANISM_TYPE,
    pub pSeed: *mut CK_BYTE,
    pub ulSeedLen: CK_ULONG,
    pub pLabel: *mut CK_BYTE,
    pub ulLabelLen: CK_ULONG,
    pub pOutput: *mut CK_BYTE,
    pub pulOutputLen: *mut CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_WTLS_PRF_PARAMS"][::std::mem::size_of::<CK_WTLS_PRF_PARAMS>() - 44usize];
    ["Alignment of CK_WTLS_PRF_PARAMS"][::std::mem::align_of::<CK_WTLS_PRF_PARAMS>() - 1usize];
    ["Offset of field: CK_WTLS_PRF_PARAMS::DigestMechanism"]
        [::std::mem::offset_of!(CK_WTLS_PRF_PARAMS, DigestMechanism) - 0usize];
    ["Offset of field: CK_WTLS_PRF_PARAMS::pSeed"]
        [::std::mem::offset_of!(CK_WTLS_PRF_PARAMS, pSeed) - 4usize];
    ["Offset of field: CK_WTLS_PRF_PARAMS::ulSeedLen"]
        [::std::mem::offset_of!(CK_WTLS_PRF_PARAMS, ulSeedLen) - 12usize];
    ["Offset of field: CK_WTLS_PRF_PARAMS::pLabel"]
        [::std::mem::offset_of!(CK_WTLS_PRF_PARAMS, pLabel) - 16usize];
    ["Offset of field: CK_WTLS_PRF_PARAMS::ulLabelLen"]
        [::std::mem::offset_of!(CK_WTLS_PRF_PARAMS, ulLabelLen) - 24usize];
    ["Offset of field: CK_WTLS_PRF_PARAMS::pOutput"]
        [::std::mem::offset_of!(CK_WTLS_PRF_PARAMS, pOutput) - 28usize];
    ["Offset of field: CK_WTLS_PRF_PARAMS::pulOutputLen"]
        [::std::mem::offset_of!(CK_WTLS_PRF_PARAMS, pulOutputLen) - 36usize];
};
impl Default for CK_WTLS_PRF_PARAMS {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type CK_C_Initialize =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_C_Finalize =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> CK_RV>;
pub type CK_C_GetInfo = ::std::option::Option<unsafe extern "C" fn(arg1: *mut CK_INFO) -> CK_RV>;
pub type CK_C_GetFunctionList =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut *mut CK_FUNCTION_LIST) -> CK_RV>;
pub type CK_C_GetSlotList = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_BBOOL, arg2: *mut CK_SLOT_ID, arg3: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_C_GetSlotInfo =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SLOT_ID, arg2: *mut CK_SLOT_INFO) -> CK_RV>;
pub type CK_C_GetTokenInfo = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SLOT_ID, arg2: *mut CK_TOKEN_INFO) -> CK_RV,
>;
pub type CK_C_GetMechanismList = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SLOT_ID,
        arg2: *mut CK_MECHANISM_TYPE,
        arg3: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_GetMechanismInfo = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SLOT_ID,
        arg2: CK_MECHANISM_TYPE,
        arg3: *mut CK_MECHANISM_INFO,
    ) -> CK_RV,
>;
pub type CK_C_InitToken = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SLOT_ID,
        arg2: *mut CK_UTF8CHAR,
        arg3: CK_ULONG,
        arg4: *mut CK_UTF8CHAR,
    ) -> CK_RV,
>;
pub type CK_C_InitPIN = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_UTF8CHAR, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_SetPIN = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_UTF8CHAR,
        arg3: CK_ULONG,
        arg4: *mut CK_UTF8CHAR,
        arg5: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_OpenSession = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SLOT_ID,
        arg2: CK_FLAGS,
        arg3: *mut ::std::os::raw::c_void,
        arg4: CK_NOTIFY,
        arg5: *mut CK_SESSION_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_CloseSession =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_CloseAllSessions =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SLOT_ID) -> CK_RV>;
pub type CK_C_GetSessionInfo = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_SESSION_INFO) -> CK_RV,
>;
pub type CK_C_GetOperationState = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_C_SetOperationState = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: CK_OBJECT_HANDLE,
        arg5: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_Login = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_USER_TYPE,
        arg3: *mut CK_UTF8CHAR,
        arg4: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_Logout =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_CreateObject = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_ATTRIBUTE,
        arg3: CK_ULONG,
        arg4: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_CopyObject = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_OBJECT_HANDLE,
        arg3: *mut CK_ATTRIBUTE,
        arg4: CK_ULONG,
        arg5: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_DestroyObject = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: CK_OBJECT_HANDLE) -> CK_RV,
>;
pub type CK_C_GetObjectSize = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_OBJECT_HANDLE,
        arg3: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_GetAttributeValue = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_OBJECT_HANDLE,
        arg3: *mut CK_ATTRIBUTE,
        arg4: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_SetAttributeValue = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_OBJECT_HANDLE,
        arg3: *mut CK_ATTRIBUTE,
        arg4: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_FindObjectsInit = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_ATTRIBUTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_FindObjects = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_OBJECT_HANDLE,
        arg3: CK_ULONG,
        arg4: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_FindObjectsFinal =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_EncryptInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_Encrypt = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_EncryptUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_EncryptFinal = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_C_DecryptInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_Decrypt = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DecryptUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DecryptFinal = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_C_DigestInit = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_MECHANISM) -> CK_RV,
>;
pub type CK_C_Digest = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DigestUpdate = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_DigestKey = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: CK_OBJECT_HANDLE) -> CK_RV,
>;
pub type CK_C_DigestFinal = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_C_SignInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_Sign = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_SignUpdate = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_SignFinal = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_C_SignRecoverInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_SignRecover = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_VerifyInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_Verify = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_VerifyUpdate = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_VerifyFinal = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_VerifyRecoverInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_VerifyRecover = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DigestEncryptUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DecryptDigestUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_SignEncryptUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DecryptVerifyUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_BYTE,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_GenerateKey = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: *mut CK_ATTRIBUTE,
        arg4: CK_ULONG,
        arg5: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_GenerateKeyPair = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: *mut CK_ATTRIBUTE,
        arg4: CK_ULONG,
        arg5: *mut CK_ATTRIBUTE,
        arg6: CK_ULONG,
        arg7: *mut CK_OBJECT_HANDLE,
        arg8: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_WrapKey = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: CK_OBJECT_HANDLE,
        arg5: *mut CK_BYTE,
        arg6: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_UnwrapKey = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_ATTRIBUTE,
        arg7: CK_ULONG,
        arg8: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_DeriveKey = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: *mut CK_ATTRIBUTE,
        arg5: CK_ULONG,
        arg6: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_SeedRandom = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_GenerateRandom = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_GetFunctionStatus =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_CancelFunction =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_WaitForSlotEvent = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_FLAGS,
        arg2: *mut CK_SLOT_ID,
        arg3: *mut ::std::os::raw::c_void,
    ) -> CK_RV,
>;
pub type CK_C_GetInterfaceList = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut CK_INTERFACE, arg2: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_C_GetInterface = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut CK_UTF8CHAR,
        arg2: *mut CK_VERSION,
        arg3: *mut *mut CK_INTERFACE,
        arg4: CK_FLAGS,
    ) -> CK_RV,
>;
pub type CK_C_LoginUser = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_USER_TYPE,
        arg3: *mut CK_UTF8CHAR,
        arg4: CK_ULONG,
        arg5: *mut CK_UTF8CHAR,
        arg6: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_SessionCancel =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: CK_FLAGS) -> CK_RV>;
pub type CK_C_MessageEncryptInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_EncryptMessage = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: CK_ULONG,
        arg8: *mut CK_BYTE,
        arg9: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_EncryptMessageBegin = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_EncryptMessageNext = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: *mut CK_ULONG,
        arg8: CK_FLAGS,
    ) -> CK_RV,
>;
pub type CK_C_MessageEncryptFinal =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_MessageDecryptInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_DecryptMessage = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: CK_ULONG,
        arg8: *mut CK_BYTE,
        arg9: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DecryptMessageBegin = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_DecryptMessageNext = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: *mut CK_ULONG,
        arg8: CK_FLAGS,
    ) -> CK_RV,
>;
pub type CK_C_MessageDecryptFinal =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_MessageSignInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_SignMessage = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_SignMessageBegin = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_SignMessageNext = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_MessageSignFinal =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_MessageVerifyInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_VerifyMessage = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_VerifyMessageBegin = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_VerifyMessageNext = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_MessageVerifyFinal =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_EncapsulateKey = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: *mut CK_ATTRIBUTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: *mut CK_ULONG,
        arg8: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_DecapsulateKey = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: *mut CK_ATTRIBUTE,
        arg5: CK_ULONG,
        arg6: *mut CK_BYTE,
        arg7: CK_ULONG,
        arg8: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
pub type CK_C_VerifySignatureInit = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_VerifySignature = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_VerifySignatureUpdate = ::std::option::Option<
    unsafe extern "C" fn(arg1: CK_SESSION_HANDLE, arg2: *mut CK_BYTE, arg3: CK_ULONG) -> CK_RV,
>;
pub type CK_C_VerifySignatureFinal =
    ::std::option::Option<unsafe extern "C" fn(arg1: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_C_GetSessionValidationFlags = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: CK_SESSION_VALIDATION_FLAGS_TYPE,
        arg3: *mut CK_FLAGS,
    ) -> CK_RV,
>;
pub type CK_C_AsyncComplete = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_UTF8CHAR,
        arg3: *mut CK_ASYNC_DATA,
    ) -> CK_RV,
>;
pub type CK_C_AsyncGetID = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_UTF8CHAR,
        arg3: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_AsyncJoin = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_UTF8CHAR,
        arg3: CK_ULONG,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_WrapKeyAuthenticated = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: CK_OBJECT_HANDLE,
        arg5: *mut CK_BYTE,
        arg6: *mut CK_ULONG,
        arg7: *mut CK_BYTE,
        arg8: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_C_UnwrapKeyAuthenticated = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: CK_SESSION_HANDLE,
        arg2: *mut CK_MECHANISM,
        arg3: CK_OBJECT_HANDLE,
        arg4: *mut CK_BYTE,
        arg5: CK_ULONG,
        arg6: *mut CK_ATTRIBUTE,
        arg7: CK_ULONG,
        arg8: *mut CK_BYTE,
        arg9: CK_ULONG,
        arg10: *mut CK_OBJECT_HANDLE,
    ) -> CK_RV,
>;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_FUNCTION_LIST_3_2 {
    pub version: CK_VERSION,
    pub C_Initialize: CK_C_Initialize,
    pub C_Finalize: CK_C_Finalize,
    pub C_GetInfo: CK_C_GetInfo,
    pub C_GetFunctionList: CK_C_GetFunctionList,
    pub C_GetSlotList: CK_C_GetSlotList,
    pub C_GetSlotInfo: CK_C_GetSlotInfo,
    pub C_GetTokenInfo: CK_C_GetTokenInfo,
    pub C_GetMechanismList: CK_C_GetMechanismList,
    pub C_GetMechanismInfo: CK_C_GetMechanismInfo,
    pub C_InitToken: CK_C_InitToken,
    pub C_InitPIN: CK_C_InitPIN,
    pub C_SetPIN: CK_C_SetPIN,
    pub C_OpenSession: CK_C_OpenSession,
    pub C_CloseSession: CK_C_CloseSession,
    pub C_CloseAllSessions: CK_C_CloseAllSessions,
    pub C_GetSessionInfo: CK_C_GetSessionInfo,
    pub C_GetOperationState: CK_C_GetOperationState,
    pub C_SetOperationState: CK_C_SetOperationState,
    pub C_Login: CK_C_Login,
    pub C_Logout: CK_C_Logout,
    pub C_CreateObject: CK_C_CreateObject,
    pub C_CopyObject: CK_C_CopyObject,
    pub C_DestroyObject: CK_C_DestroyObject,
    pub C_GetObjectSize: CK_C_GetObjectSize,
    pub C_GetAttributeValue: CK_C_GetAttributeValue,
    pub C_SetAttributeValue: CK_C_SetAttributeValue,
    pub C_FindObjectsInit: CK_C_FindObjectsInit,
    pub C_FindObjects: CK_C_FindObjects,
    pub C_FindObjectsFinal: CK_C_FindObjectsFinal,
    pub C_EncryptInit: CK_C_EncryptInit,
    pub C_Encrypt: CK_C_Encrypt,
    pub C_EncryptUpdate: CK_C_EncryptUpdate,
    pub C_EncryptFinal: CK_C_EncryptFinal,
    pub C_DecryptInit: CK_C_DecryptInit,
    pub C_Decrypt: CK_C_Decrypt,
    pub C_DecryptUpdate: CK_C_DecryptUpdate,
    pub C_DecryptFinal: CK_C_DecryptFinal,
    pub C_DigestInit: CK_C_DigestInit,
    pub C_Digest: CK_C_Digest,
    pub C_DigestUpdate: CK_C_DigestUpdate,
    pub C_DigestKey: CK_C_DigestKey,
    pub C_DigestFinal: CK_C_DigestFinal,
    pub C_SignInit: CK_C_SignInit,
    pub C_Sign: CK_C_Sign,
    pub C_SignUpdate: CK_C_SignUpdate,
    pub C_SignFinal: CK_C_SignFinal,
    pub C_SignRecoverInit: CK_C_SignRecoverInit,
    pub C_SignRecover: CK_C_SignRecover,
    pub C_VerifyInit: CK_C_VerifyInit,
    pub C_Verify: CK_C_Verify,
    pub C_VerifyUpdate: CK_C_VerifyUpdate,
    pub C_VerifyFinal: CK_C_VerifyFinal,
    pub C_VerifyRecoverInit: CK_C_VerifyRecoverInit,
    pub C_VerifyRecover: CK_C_VerifyRecover,
    pub C_DigestEncryptUpdate: CK_C_DigestEncryptUpdate,
    pub C_DecryptDigestUpdate: CK_C_DecryptDigestUpdate,
    pub C_SignEncryptUpdate: CK_C_SignEncryptUpdate,
    pub C_DecryptVerifyUpdate: CK_C_DecryptVerifyUpdate,
    pub C_GenerateKey: CK_C_GenerateKey,
    pub C_GenerateKeyPair: CK_C_GenerateKeyPair,
    pub C_WrapKey: CK_C_WrapKey,
    pub C_UnwrapKey: CK_C_UnwrapKey,
    pub C_DeriveKey: CK_C_DeriveKey,
    pub C_SeedRandom: CK_C_SeedRandom,
    pub C_GenerateRandom: CK_C_GenerateRandom,
    pub C_GetFunctionStatus: CK_C_GetFunctionStatus,
    pub C_CancelFunction: CK_C_CancelFunction,
    pub C_WaitForSlotEvent: CK_C_WaitForSlotEvent,
    pub C_GetInterfaceList: CK_C_GetInterfaceList,
    pub C_GetInterface: CK_C_GetInterface,
    pub C_LoginUser: CK_C_LoginUser,
    pub C_SessionCancel: CK_C_SessionCancel,
    pub C_MessageEncryptInit: CK_C_MessageEncryptInit,
    pub C_EncryptMessage: CK_C_EncryptMessage,
    pub C_EncryptMessageBegin: CK_C_EncryptMessageBegin,
    pub C_EncryptMessageNext: CK_C_EncryptMessageNext,
    pub C_MessageEncryptFinal: CK_C_MessageEncryptFinal,
    pub C_MessageDecryptInit: CK_C_MessageDecryptInit,
    pub C_DecryptMessage: CK_C_DecryptMessage,
    pub C_DecryptMessageBegin: CK_C_DecryptMessageBegin,
    pub C_DecryptMessageNext: CK_C_DecryptMessageNext,
    pub C_MessageDecryptFinal: CK_C_MessageDecryptFinal,
    pub C_MessageSignInit: CK_C_MessageSignInit,
    pub C_SignMessage: CK_C_SignMessage,
    pub C_SignMessageBegin: CK_C_SignMessageBegin,
    pub C_SignMessageNext: CK_C_SignMessageNext,
    pub C_MessageSignFinal: CK_C_MessageSignFinal,
    pub C_MessageVerifyInit: CK_C_MessageVerifyInit,
    pub C_VerifyMessage: CK_C_VerifyMessage,
    pub C_VerifyMessageBegin: CK_C_VerifyMessageBegin,
    pub C_VerifyMessageNext: CK_C_VerifyMessageNext,
    pub C_MessageVerifyFinal: CK_C_MessageVerifyFinal,
    pub C_EncapsulateKey: CK_C_EncapsulateKey,
    pub C_DecapsulateKey: CK_C_DecapsulateKey,
    pub C_VerifySignatureInit: CK_C_VerifySignatureInit,
    pub C_VerifySignature: CK_C_VerifySignature,
    pub C_VerifySignatureUpdate: CK_C_VerifySignatureUpdate,
    pub C_VerifySignatureFinal: CK_C_VerifySignatureFinal,
    pub C_GetSessionValidationFlags: CK_C_GetSessionValidationFlags,
    pub C_AsyncComplete: CK_C_AsyncComplete,
    pub C_AsyncGetID: CK_C_AsyncGetID,
    pub C_AsyncJoin: CK_C_AsyncJoin,
    pub C_WrapKeyAuthenticated: CK_C_WrapKeyAuthenticated,
    pub C_UnwrapKeyAuthenticated: CK_C_UnwrapKeyAuthenticated,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_FUNCTION_LIST_3_2"][::std::mem::size_of::<CK_FUNCTION_LIST_3_2>() - 834usize];
    ["Alignment of CK_FUNCTION_LIST_3_2"][::std::mem::align_of::<CK_FUNCTION_LIST_3_2>() - 1usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::version"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, version) - 0usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Initialize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Initialize) - 2usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Finalize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Finalize) - 10usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetInfo) - 18usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetFunctionList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetFunctionList) - 26usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetSlotList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetSlotList) - 34usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetSlotInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetSlotInfo) - 42usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetTokenInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetTokenInfo) - 50usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetMechanismList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetMechanismList) - 58usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetMechanismInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetMechanismInfo) - 66usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_InitToken"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_InitToken) - 74usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_InitPIN"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_InitPIN) - 82usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SetPIN"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SetPIN) - 90usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_OpenSession"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_OpenSession) - 98usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_CloseSession"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_CloseSession) - 106usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_CloseAllSessions"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_CloseAllSessions) - 114usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetSessionInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetSessionInfo) - 122usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetOperationState"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetOperationState) - 130usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SetOperationState"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SetOperationState) - 138usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Login"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Login) - 146usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Logout"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Logout) - 154usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_CreateObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_CreateObject) - 162usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_CopyObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_CopyObject) - 170usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DestroyObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DestroyObject) - 178usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetObjectSize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetObjectSize) - 186usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetAttributeValue"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetAttributeValue) - 194usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SetAttributeValue"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SetAttributeValue) - 202usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_FindObjectsInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_FindObjectsInit) - 210usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_FindObjects"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_FindObjects) - 218usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_FindObjectsFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_FindObjectsFinal) - 226usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_EncryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_EncryptInit) - 234usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Encrypt"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Encrypt) - 242usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_EncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_EncryptUpdate) - 250usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_EncryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_EncryptFinal) - 258usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptInit) - 266usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Decrypt"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Decrypt) - 274usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptUpdate) - 282usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptFinal) - 290usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DigestInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DigestInit) - 298usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Digest"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Digest) - 306usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DigestUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DigestUpdate) - 314usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DigestKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DigestKey) - 322usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DigestFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DigestFinal) - 330usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignInit) - 338usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Sign"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Sign) - 346usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignUpdate) - 354usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignFinal) - 362usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignRecoverInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignRecoverInit) - 370usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignRecover"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignRecover) - 378usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyInit) - 386usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_Verify"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_Verify) - 394usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyUpdate) - 402usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyFinal) - 410usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyRecoverInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyRecoverInit) - 418usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyRecover"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyRecover) - 426usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DigestEncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DigestEncryptUpdate) - 434usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptDigestUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptDigestUpdate) - 442usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignEncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignEncryptUpdate) - 450usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptVerifyUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptVerifyUpdate) - 458usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GenerateKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GenerateKey) - 466usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GenerateKeyPair"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GenerateKeyPair) - 474usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_WrapKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_WrapKey) - 482usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_UnwrapKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_UnwrapKey) - 490usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DeriveKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DeriveKey) - 498usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SeedRandom"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SeedRandom) - 506usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GenerateRandom"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GenerateRandom) - 514usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetFunctionStatus"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetFunctionStatus) - 522usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_CancelFunction"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_CancelFunction) - 530usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_WaitForSlotEvent"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_WaitForSlotEvent) - 538usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetInterfaceList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetInterfaceList) - 546usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetInterface"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetInterface) - 554usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_LoginUser"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_LoginUser) - 562usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SessionCancel"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SessionCancel) - 570usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageEncryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageEncryptInit) - 578usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_EncryptMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_EncryptMessage) - 586usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_EncryptMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_EncryptMessageBegin) - 594usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_EncryptMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_EncryptMessageNext) - 602usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageEncryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageEncryptFinal) - 610usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageDecryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageDecryptInit) - 618usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptMessage) - 626usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptMessageBegin) - 634usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecryptMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecryptMessageNext) - 642usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageDecryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageDecryptFinal) - 650usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageSignInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageSignInit) - 658usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignMessage) - 666usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignMessageBegin) - 674usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_SignMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_SignMessageNext) - 682usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageSignFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageSignFinal) - 690usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageVerifyInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageVerifyInit) - 698usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyMessage) - 706usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyMessageBegin) - 714usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifyMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifyMessageNext) - 722usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_MessageVerifyFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_MessageVerifyFinal) - 730usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_EncapsulateKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_EncapsulateKey) - 738usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_DecapsulateKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_DecapsulateKey) - 746usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifySignatureInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifySignatureInit) - 754usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifySignature"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifySignature) - 762usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifySignatureUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifySignatureUpdate) - 770usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_VerifySignatureFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_VerifySignatureFinal) - 778usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_GetSessionValidationFlags"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_GetSessionValidationFlags) - 786usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_AsyncComplete"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_AsyncComplete) - 794usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_AsyncGetID"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_AsyncGetID) - 802usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_AsyncJoin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_AsyncJoin) - 810usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_WrapKeyAuthenticated"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_WrapKeyAuthenticated) - 818usize];
    ["Offset of field: CK_FUNCTION_LIST_3_2::C_UnwrapKeyAuthenticated"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_2, C_UnwrapKeyAuthenticated) - 826usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_FUNCTION_LIST_3_0 {
    pub version: CK_VERSION,
    pub C_Initialize: CK_C_Initialize,
    pub C_Finalize: CK_C_Finalize,
    pub C_GetInfo: CK_C_GetInfo,
    pub C_GetFunctionList: CK_C_GetFunctionList,
    pub C_GetSlotList: CK_C_GetSlotList,
    pub C_GetSlotInfo: CK_C_GetSlotInfo,
    pub C_GetTokenInfo: CK_C_GetTokenInfo,
    pub C_GetMechanismList: CK_C_GetMechanismList,
    pub C_GetMechanismInfo: CK_C_GetMechanismInfo,
    pub C_InitToken: CK_C_InitToken,
    pub C_InitPIN: CK_C_InitPIN,
    pub C_SetPIN: CK_C_SetPIN,
    pub C_OpenSession: CK_C_OpenSession,
    pub C_CloseSession: CK_C_CloseSession,
    pub C_CloseAllSessions: CK_C_CloseAllSessions,
    pub C_GetSessionInfo: CK_C_GetSessionInfo,
    pub C_GetOperationState: CK_C_GetOperationState,
    pub C_SetOperationState: CK_C_SetOperationState,
    pub C_Login: CK_C_Login,
    pub C_Logout: CK_C_Logout,
    pub C_CreateObject: CK_C_CreateObject,
    pub C_CopyObject: CK_C_CopyObject,
    pub C_DestroyObject: CK_C_DestroyObject,
    pub C_GetObjectSize: CK_C_GetObjectSize,
    pub C_GetAttributeValue: CK_C_GetAttributeValue,
    pub C_SetAttributeValue: CK_C_SetAttributeValue,
    pub C_FindObjectsInit: CK_C_FindObjectsInit,
    pub C_FindObjects: CK_C_FindObjects,
    pub C_FindObjectsFinal: CK_C_FindObjectsFinal,
    pub C_EncryptInit: CK_C_EncryptInit,
    pub C_Encrypt: CK_C_Encrypt,
    pub C_EncryptUpdate: CK_C_EncryptUpdate,
    pub C_EncryptFinal: CK_C_EncryptFinal,
    pub C_DecryptInit: CK_C_DecryptInit,
    pub C_Decrypt: CK_C_Decrypt,
    pub C_DecryptUpdate: CK_C_DecryptUpdate,
    pub C_DecryptFinal: CK_C_DecryptFinal,
    pub C_DigestInit: CK_C_DigestInit,
    pub C_Digest: CK_C_Digest,
    pub C_DigestUpdate: CK_C_DigestUpdate,
    pub C_DigestKey: CK_C_DigestKey,
    pub C_DigestFinal: CK_C_DigestFinal,
    pub C_SignInit: CK_C_SignInit,
    pub C_Sign: CK_C_Sign,
    pub C_SignUpdate: CK_C_SignUpdate,
    pub C_SignFinal: CK_C_SignFinal,
    pub C_SignRecoverInit: CK_C_SignRecoverInit,
    pub C_SignRecover: CK_C_SignRecover,
    pub C_VerifyInit: CK_C_VerifyInit,
    pub C_Verify: CK_C_Verify,
    pub C_VerifyUpdate: CK_C_VerifyUpdate,
    pub C_VerifyFinal: CK_C_VerifyFinal,
    pub C_VerifyRecoverInit: CK_C_VerifyRecoverInit,
    pub C_VerifyRecover: CK_C_VerifyRecover,
    pub C_DigestEncryptUpdate: CK_C_DigestEncryptUpdate,
    pub C_DecryptDigestUpdate: CK_C_DecryptDigestUpdate,
    pub C_SignEncryptUpdate: CK_C_SignEncryptUpdate,
    pub C_DecryptVerifyUpdate: CK_C_DecryptVerifyUpdate,
    pub C_GenerateKey: CK_C_GenerateKey,
    pub C_GenerateKeyPair: CK_C_GenerateKeyPair,
    pub C_WrapKey: CK_C_WrapKey,
    pub C_UnwrapKey: CK_C_UnwrapKey,
    pub C_DeriveKey: CK_C_DeriveKey,
    pub C_SeedRandom: CK_C_SeedRandom,
    pub C_GenerateRandom: CK_C_GenerateRandom,
    pub C_GetFunctionStatus: CK_C_GetFunctionStatus,
    pub C_CancelFunction: CK_C_CancelFunction,
    pub C_WaitForSlotEvent: CK_C_WaitForSlotEvent,
    pub C_GetInterfaceList: CK_C_GetInterfaceList,
    pub C_GetInterface: CK_C_GetInterface,
    pub C_LoginUser: CK_C_LoginUser,
    pub C_SessionCancel: CK_C_SessionCancel,
    pub C_MessageEncryptInit: CK_C_MessageEncryptInit,
    pub C_EncryptMessage: CK_C_EncryptMessage,
    pub C_EncryptMessageBegin: CK_C_EncryptMessageBegin,
    pub C_EncryptMessageNext: CK_C_EncryptMessageNext,
    pub C_MessageEncryptFinal: CK_C_MessageEncryptFinal,
    pub C_MessageDecryptInit: CK_C_MessageDecryptInit,
    pub C_DecryptMessage: CK_C_DecryptMessage,
    pub C_DecryptMessageBegin: CK_C_DecryptMessageBegin,
    pub C_DecryptMessageNext: CK_C_DecryptMessageNext,
    pub C_MessageDecryptFinal: CK_C_MessageDecryptFinal,
    pub C_MessageSignInit: CK_C_MessageSignInit,
    pub C_SignMessage: CK_C_SignMessage,
    pub C_SignMessageBegin: CK_C_SignMessageBegin,
    pub C_SignMessageNext: CK_C_SignMessageNext,
    pub C_MessageSignFinal: CK_C_MessageSignFinal,
    pub C_MessageVerifyInit: CK_C_MessageVerifyInit,
    pub C_VerifyMessage: CK_C_VerifyMessage,
    pub C_VerifyMessageBegin: CK_C_VerifyMessageBegin,
    pub C_VerifyMessageNext: CK_C_VerifyMessageNext,
    pub C_MessageVerifyFinal: CK_C_MessageVerifyFinal,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_FUNCTION_LIST_3_0"][::std::mem::size_of::<CK_FUNCTION_LIST_3_0>() - 738usize];
    ["Alignment of CK_FUNCTION_LIST_3_0"][::std::mem::align_of::<CK_FUNCTION_LIST_3_0>() - 1usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::version"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, version) - 0usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Initialize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Initialize) - 2usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Finalize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Finalize) - 10usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetInfo) - 18usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetFunctionList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetFunctionList) - 26usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetSlotList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetSlotList) - 34usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetSlotInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetSlotInfo) - 42usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetTokenInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetTokenInfo) - 50usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetMechanismList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetMechanismList) - 58usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetMechanismInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetMechanismInfo) - 66usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_InitToken"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_InitToken) - 74usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_InitPIN"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_InitPIN) - 82usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SetPIN"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SetPIN) - 90usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_OpenSession"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_OpenSession) - 98usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_CloseSession"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_CloseSession) - 106usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_CloseAllSessions"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_CloseAllSessions) - 114usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetSessionInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetSessionInfo) - 122usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetOperationState"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetOperationState) - 130usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SetOperationState"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SetOperationState) - 138usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Login"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Login) - 146usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Logout"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Logout) - 154usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_CreateObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_CreateObject) - 162usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_CopyObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_CopyObject) - 170usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DestroyObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DestroyObject) - 178usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetObjectSize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetObjectSize) - 186usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetAttributeValue"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetAttributeValue) - 194usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SetAttributeValue"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SetAttributeValue) - 202usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_FindObjectsInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_FindObjectsInit) - 210usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_FindObjects"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_FindObjects) - 218usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_FindObjectsFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_FindObjectsFinal) - 226usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_EncryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_EncryptInit) - 234usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Encrypt"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Encrypt) - 242usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_EncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_EncryptUpdate) - 250usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_EncryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_EncryptFinal) - 258usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptInit) - 266usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Decrypt"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Decrypt) - 274usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptUpdate) - 282usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptFinal) - 290usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DigestInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DigestInit) - 298usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Digest"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Digest) - 306usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DigestUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DigestUpdate) - 314usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DigestKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DigestKey) - 322usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DigestFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DigestFinal) - 330usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignInit) - 338usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Sign"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Sign) - 346usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignUpdate) - 354usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignFinal) - 362usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignRecoverInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignRecoverInit) - 370usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignRecover"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignRecover) - 378usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyInit) - 386usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_Verify"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_Verify) - 394usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyUpdate) - 402usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyFinal) - 410usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyRecoverInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyRecoverInit) - 418usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyRecover"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyRecover) - 426usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DigestEncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DigestEncryptUpdate) - 434usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptDigestUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptDigestUpdate) - 442usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignEncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignEncryptUpdate) - 450usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptVerifyUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptVerifyUpdate) - 458usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GenerateKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GenerateKey) - 466usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GenerateKeyPair"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GenerateKeyPair) - 474usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_WrapKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_WrapKey) - 482usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_UnwrapKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_UnwrapKey) - 490usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DeriveKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DeriveKey) - 498usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SeedRandom"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SeedRandom) - 506usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GenerateRandom"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GenerateRandom) - 514usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetFunctionStatus"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetFunctionStatus) - 522usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_CancelFunction"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_CancelFunction) - 530usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_WaitForSlotEvent"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_WaitForSlotEvent) - 538usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetInterfaceList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetInterfaceList) - 546usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_GetInterface"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_GetInterface) - 554usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_LoginUser"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_LoginUser) - 562usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SessionCancel"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SessionCancel) - 570usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageEncryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageEncryptInit) - 578usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_EncryptMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_EncryptMessage) - 586usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_EncryptMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_EncryptMessageBegin) - 594usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_EncryptMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_EncryptMessageNext) - 602usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageEncryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageEncryptFinal) - 610usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageDecryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageDecryptInit) - 618usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptMessage) - 626usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptMessageBegin) - 634usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_DecryptMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_DecryptMessageNext) - 642usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageDecryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageDecryptFinal) - 650usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageSignInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageSignInit) - 658usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignMessage) - 666usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignMessageBegin) - 674usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_SignMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_SignMessageNext) - 682usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageSignFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageSignFinal) - 690usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageVerifyInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageVerifyInit) - 698usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyMessage"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyMessage) - 706usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyMessageBegin"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyMessageBegin) - 714usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_VerifyMessageNext"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_VerifyMessageNext) - 722usize];
    ["Offset of field: CK_FUNCTION_LIST_3_0::C_MessageVerifyFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST_3_0, C_MessageVerifyFinal) - 730usize];
};
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct CK_FUNCTION_LIST {
    pub version: CK_VERSION,
    pub C_Initialize: CK_C_Initialize,
    pub C_Finalize: CK_C_Finalize,
    pub C_GetInfo: CK_C_GetInfo,
    pub C_GetFunctionList: CK_C_GetFunctionList,
    pub C_GetSlotList: CK_C_GetSlotList,
    pub C_GetSlotInfo: CK_C_GetSlotInfo,
    pub C_GetTokenInfo: CK_C_GetTokenInfo,
    pub C_GetMechanismList: CK_C_GetMechanismList,
    pub C_GetMechanismInfo: CK_C_GetMechanismInfo,
    pub C_InitToken: CK_C_InitToken,
    pub C_InitPIN: CK_C_InitPIN,
    pub C_SetPIN: CK_C_SetPIN,
    pub C_OpenSession: CK_C_OpenSession,
    pub C_CloseSession: CK_C_CloseSession,
    pub C_CloseAllSessions: CK_C_CloseAllSessions,
    pub C_GetSessionInfo: CK_C_GetSessionInfo,
    pub C_GetOperationState: CK_C_GetOperationState,
    pub C_SetOperationState: CK_C_SetOperationState,
    pub C_Login: CK_C_Login,
    pub C_Logout: CK_C_Logout,
    pub C_CreateObject: CK_C_CreateObject,
    pub C_CopyObject: CK_C_CopyObject,
    pub C_DestroyObject: CK_C_DestroyObject,
    pub C_GetObjectSize: CK_C_GetObjectSize,
    pub C_GetAttributeValue: CK_C_GetAttributeValue,
    pub C_SetAttributeValue: CK_C_SetAttributeValue,
    pub C_FindObjectsInit: CK_C_FindObjectsInit,
    pub C_FindObjects: CK_C_FindObjects,
    pub C_FindObjectsFinal: CK_C_FindObjectsFinal,
    pub C_EncryptInit: CK_C_EncryptInit,
    pub C_Encrypt: CK_C_Encrypt,
    pub C_EncryptUpdate: CK_C_EncryptUpdate,
    pub C_EncryptFinal: CK_C_EncryptFinal,
    pub C_DecryptInit: CK_C_DecryptInit,
    pub C_Decrypt: CK_C_Decrypt,
    pub C_DecryptUpdate: CK_C_DecryptUpdate,
    pub C_DecryptFinal: CK_C_DecryptFinal,
    pub C_DigestInit: CK_C_DigestInit,
    pub C_Digest: CK_C_Digest,
    pub C_DigestUpdate: CK_C_DigestUpdate,
    pub C_DigestKey: CK_C_DigestKey,
    pub C_DigestFinal: CK_C_DigestFinal,
    pub C_SignInit: CK_C_SignInit,
    pub C_Sign: CK_C_Sign,
    pub C_SignUpdate: CK_C_SignUpdate,
    pub C_SignFinal: CK_C_SignFinal,
    pub C_SignRecoverInit: CK_C_SignRecoverInit,
    pub C_SignRecover: CK_C_SignRecover,
    pub C_VerifyInit: CK_C_VerifyInit,
    pub C_Verify: CK_C_Verify,
    pub C_VerifyUpdate: CK_C_VerifyUpdate,
    pub C_VerifyFinal: CK_C_VerifyFinal,
    pub C_VerifyRecoverInit: CK_C_VerifyRecoverInit,
    pub C_VerifyRecover: CK_C_VerifyRecover,
    pub C_DigestEncryptUpdate: CK_C_DigestEncryptUpdate,
    pub C_DecryptDigestUpdate: CK_C_DecryptDigestUpdate,
    pub C_SignEncryptUpdate: CK_C_SignEncryptUpdate,
    pub C_DecryptVerifyUpdate: CK_C_DecryptVerifyUpdate,
    pub C_GenerateKey: CK_C_GenerateKey,
    pub C_GenerateKeyPair: CK_C_GenerateKeyPair,
    pub C_WrapKey: CK_C_WrapKey,
    pub C_UnwrapKey: CK_C_UnwrapKey,
    pub C_DeriveKey: CK_C_DeriveKey,
    pub C_SeedRandom: CK_C_SeedRandom,
    pub C_GenerateRandom: CK_C_GenerateRandom,
    pub C_GetFunctionStatus: CK_C_GetFunctionStatus,
    pub C_CancelFunction: CK_C_CancelFunction,
    pub C_WaitForSlotEvent: CK_C_WaitForSlotEvent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_FUNCTION_LIST"][::std::mem::size_of::<CK_FUNCTION_LIST>() - 546usize];
    ["Alignment of CK_FUNCTION_LIST"][::std::mem::align_of::<CK_FUNCTION_LIST>() - 1usize];
    ["Offset of field: CK_FUNCTION_LIST::version"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, version) - 0usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Initialize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Initialize) - 2usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Finalize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Finalize) - 10usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetInfo) - 18usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetFunctionList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetFunctionList) - 26usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetSlotList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetSlotList) - 34usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetSlotInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetSlotInfo) - 42usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetTokenInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetTokenInfo) - 50usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetMechanismList"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetMechanismList) - 58usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetMechanismInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetMechanismInfo) - 66usize];
    ["Offset of field: CK_FUNCTION_LIST::C_InitToken"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_InitToken) - 74usize];
    ["Offset of field: CK_FUNCTION_LIST::C_InitPIN"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_InitPIN) - 82usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SetPIN"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SetPIN) - 90usize];
    ["Offset of field: CK_FUNCTION_LIST::C_OpenSession"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_OpenSession) - 98usize];
    ["Offset of field: CK_FUNCTION_LIST::C_CloseSession"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_CloseSession) - 106usize];
    ["Offset of field: CK_FUNCTION_LIST::C_CloseAllSessions"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_CloseAllSessions) - 114usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetSessionInfo"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetSessionInfo) - 122usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetOperationState"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetOperationState) - 130usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SetOperationState"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SetOperationState) - 138usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Login"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Login) - 146usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Logout"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Logout) - 154usize];
    ["Offset of field: CK_FUNCTION_LIST::C_CreateObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_CreateObject) - 162usize];
    ["Offset of field: CK_FUNCTION_LIST::C_CopyObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_CopyObject) - 170usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DestroyObject"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DestroyObject) - 178usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetObjectSize"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetObjectSize) - 186usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetAttributeValue"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetAttributeValue) - 194usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SetAttributeValue"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SetAttributeValue) - 202usize];
    ["Offset of field: CK_FUNCTION_LIST::C_FindObjectsInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_FindObjectsInit) - 210usize];
    ["Offset of field: CK_FUNCTION_LIST::C_FindObjects"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_FindObjects) - 218usize];
    ["Offset of field: CK_FUNCTION_LIST::C_FindObjectsFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_FindObjectsFinal) - 226usize];
    ["Offset of field: CK_FUNCTION_LIST::C_EncryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_EncryptInit) - 234usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Encrypt"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Encrypt) - 242usize];
    ["Offset of field: CK_FUNCTION_LIST::C_EncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_EncryptUpdate) - 250usize];
    ["Offset of field: CK_FUNCTION_LIST::C_EncryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_EncryptFinal) - 258usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DecryptInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DecryptInit) - 266usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Decrypt"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Decrypt) - 274usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DecryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DecryptUpdate) - 282usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DecryptFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DecryptFinal) - 290usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DigestInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DigestInit) - 298usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Digest"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Digest) - 306usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DigestUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DigestUpdate) - 314usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DigestKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DigestKey) - 322usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DigestFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DigestFinal) - 330usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SignInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SignInit) - 338usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Sign"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Sign) - 346usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SignUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SignUpdate) - 354usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SignFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SignFinal) - 362usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SignRecoverInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SignRecoverInit) - 370usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SignRecover"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SignRecover) - 378usize];
    ["Offset of field: CK_FUNCTION_LIST::C_VerifyInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_VerifyInit) - 386usize];
    ["Offset of field: CK_FUNCTION_LIST::C_Verify"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_Verify) - 394usize];
    ["Offset of field: CK_FUNCTION_LIST::C_VerifyUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_VerifyUpdate) - 402usize];
    ["Offset of field: CK_FUNCTION_LIST::C_VerifyFinal"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_VerifyFinal) - 410usize];
    ["Offset of field: CK_FUNCTION_LIST::C_VerifyRecoverInit"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_VerifyRecoverInit) - 418usize];
    ["Offset of field: CK_FUNCTION_LIST::C_VerifyRecover"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_VerifyRecover) - 426usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DigestEncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DigestEncryptUpdate) - 434usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DecryptDigestUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DecryptDigestUpdate) - 442usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SignEncryptUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SignEncryptUpdate) - 450usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DecryptVerifyUpdate"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DecryptVerifyUpdate) - 458usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GenerateKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GenerateKey) - 466usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GenerateKeyPair"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GenerateKeyPair) - 474usize];
    ["Offset of field: CK_FUNCTION_LIST::C_WrapKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_WrapKey) - 482usize];
    ["Offset of field: CK_FUNCTION_LIST::C_UnwrapKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_UnwrapKey) - 490usize];
    ["Offset of field: CK_FUNCTION_LIST::C_DeriveKey"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_DeriveKey) - 498usize];
    ["Offset of field: CK_FUNCTION_LIST::C_SeedRandom"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_SeedRandom) - 506usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GenerateRandom"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GenerateRandom) - 514usize];
    ["Offset of field: CK_FUNCTION_LIST::C_GetFunctionStatus"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_GetFunctionStatus) - 522usize];
    ["Offset of field: CK_FUNCTION_LIST::C_CancelFunction"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_CancelFunction) - 530usize];
    ["Offset of field: CK_FUNCTION_LIST::C_WaitForSlotEvent"]
        [::std::mem::offset_of!(CK_FUNCTION_LIST, C_WaitForSlotEvent) - 538usize];
};
pub struct Pkcs11 {
    __library: ::libloading::Library,
    pub C_Initialize: Result<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> CK_RV,
        ::libloading::Error,
    >,
    pub C_Finalize: Result<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> CK_RV,
        ::libloading::Error,
    >,
    pub C_GetInfo: Result<unsafe extern "C" fn(arg1: *mut CK_INFO) -> CK_RV, ::libloading::Error>,
    pub C_GetFunctionList: Result<
        unsafe extern "C" fn(arg1: *mut *mut CK_FUNCTION_LIST) -> CK_RV,
        ::libloading::Error,
    >,
    pub C_GetSlotList: Result<
        unsafe extern "C" fn(arg1: CK_BBOOL, arg2: *mut CK_SLOT_ID, arg3: *mut CK_ULONG) -> CK_RV,
        ::libloading::Error,
    >,
    pub C_GetSlotInfo: Result<
        unsafe extern "C" fn(arg1: CK_SLOT_ID, arg2: *mut CK_SLOT_INFO) -> CK_RV,
