/* automatically generated by rust-bindgen 0.72.1 */

pub type CK_BYTE = ::std::os::raw::c_uchar;
pub type CK_CHAR = CK_BYTE;
pub type CK_BBOOL = CK_BYTE;
pub type CK_ULONG = ::std::os::raw::c_ulong;
pub type CK_FLAGS = CK_ULONG;
pub type CK_BYTE_PTR = *mut CK_BYTE;
pub type CK_CHAR_PTR = *mut CK_CHAR;
pub type CK_ULONG_PTR = *mut CK_ULONG;
pub type CK_VOID_PTR = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_VERSION {
    pub major: CK_BYTE,
    pub minor: CK_BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_VERSION"][::std::mem::size_of::<CK_VERSION>() - 2usize];
    ["Alignment of CK_VERSION"][::std::mem::align_of::<CK_VERSION>() - 1usize];
    ["Offset of field: CK_VERSION::major"][::std::mem::offset_of!(CK_VERSION, major) - 0usize];
    ["Offset of field: CK_VERSION::minor"][::std::mem::offset_of!(CK_VERSION, minor) - 1usize];
};
pub type CK_NOTIFICATION = CK_ULONG;
pub type CK_SLOT_ID = CK_ULONG;
pub type CK_SLOT_ID_PTR = *mut CK_SLOT_ID;
pub type CK_SESSION_HANDLE = CK_ULONG;
pub type CK_SESSION_HANDLE_PTR = *mut CK_SESSION_HANDLE;
pub type CK_USER_TYPE = CK_ULONG;
pub type CK_OBJECT_HANDLE = CK_ULONG;
pub type CK_OBJECT_HANDLE_PTR = *mut CK_OBJECT_HANDLE;
pub type CK_ATTRIBUTE_TYPE = CK_ULONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_ATTRIBUTE {
    pub type_: CK_ATTRIBUTE_TYPE,
    pub pValue: CK_VOID_PTR,
    pub usValueLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_ATTRIBUTE"][::std::mem::size_of::<CK_ATTRIBUTE>() - 24usize];
    ["Alignment of CK_ATTRIBUTE"][::std::mem::align_of::<CK_ATTRIBUTE>() - 8usize];
    ["Offset of field: CK_ATTRIBUTE::type_"][::std::mem::offset_of!(CK_ATTRIBUTE, type_) - 0usize];
    ["Offset of field: CK_ATTRIBUTE::pValue"]
        [::std::mem::offset_of!(CK_ATTRIBUTE, pValue) - 8usize];
    ["Offset of field: CK_ATTRIBUTE::usValueLen"]
        [::std::mem::offset_of!(CK_ATTRIBUTE, usValueLen) - 16usize];
};
pub type CK_ATTRIBUTE_PTR = *mut CK_ATTRIBUTE;
pub type CK_MECHANISM_TYPE = CK_ULONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_MECHANISM {
    pub mechanism: CK_MECHANISM_TYPE,
    pub pParameter: CK_VOID_PTR,
    pub usParameterLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_MECHANISM"][::std::mem::size_of::<CK_MECHANISM>() - 24usize];
    ["Alignment of CK_MECHANISM"][::std::mem::align_of::<CK_MECHANISM>() - 8usize];
    ["Offset of field: CK_MECHANISM::mechanism"]
        [::std::mem::offset_of!(CK_MECHANISM, mechanism) - 0usize];
    ["Offset of field: CK_MECHANISM::pParameter"]
        [::std::mem::offset_of!(CK_MECHANISM, pParameter) - 8usize];
    ["Offset of field: CK_MECHANISM::usParameterLen"]
        [::std::mem::offset_of!(CK_MECHANISM, usParameterLen) - 16usize];
};
pub type CK_MECHANISM_PTR = *mut CK_MECHANISM;
pub type CK_RV = CK_ULONG;
pub type CK_NOTIFY = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        event: CK_NOTIFICATION,
        pApplication: CK_VOID_PTR,
    ) -> CK_RV,
>;
#[doc = "\\\n\n M of N\n\n\\"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CA_MOFN_GENERATION {
    pub ulWeight: CK_ULONG,
    pub pVector: CK_BYTE_PTR,
    pub ulVectorLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CA_MOFN_GENERATION"][::std::mem::size_of::<CA_MOFN_GENERATION>() - 24usize];
    ["Alignment of CA_MOFN_GENERATION"][::std::mem::align_of::<CA_MOFN_GENERATION>() - 8usize];
    ["Offset of field: CA_MOFN_GENERATION::ulWeight"]
        [::std::mem::offset_of!(CA_MOFN_GENERATION, ulWeight) - 0usize];
    ["Offset of field: CA_MOFN_GENERATION::pVector"]
        [::std::mem::offset_of!(CA_MOFN_GENERATION, pVector) - 8usize];
    ["Offset of field: CA_MOFN_GENERATION::ulVectorLen"]
        [::std::mem::offset_of!(CA_MOFN_GENERATION, ulVectorLen) - 16usize];
};
pub type CA_MOFN_GENERATION_PTR = *mut CA_MOFN_GENERATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CA_MOFN_ACTIVATION {
    pub pVector: CK_BYTE_PTR,
    pub ulVectorLen: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CA_MOFN_ACTIVATION"][::std::mem::size_of::<CA_MOFN_ACTIVATION>() - 16usize];
    ["Alignment of CA_MOFN_ACTIVATION"][::std::mem::align_of::<CA_MOFN_ACTIVATION>() - 8usize];
    ["Offset of field: CA_MOFN_ACTIVATION::pVector"]
        [::std::mem::offset_of!(CA_MOFN_ACTIVATION, pVector) - 0usize];
    ["Offset of field: CA_MOFN_ACTIVATION::ulVectorLen"]
        [::std::mem::offset_of!(CA_MOFN_ACTIVATION, ulVectorLen) - 8usize];
};
pub type CA_MOFN_ACTIVATION_PTR = *mut CA_MOFN_ACTIVATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CA_M_OF_N_STATUS {
    pub ulID: CK_ULONG,
    pub ulM: CK_ULONG,
    pub ulN: CK_ULONG,
    pub ulSecretSize: CK_ULONG,
    pub ulFlag: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CA_M_OF_N_STATUS"][::std::mem::size_of::<CA_M_OF_N_STATUS>() - 40usize];
    ["Alignment of CA_M_OF_N_STATUS"][::std::mem::align_of::<CA_M_OF_N_STATUS>() - 8usize];
    ["Offset of field: CA_M_OF_N_STATUS::ulID"]
        [::std::mem::offset_of!(CA_M_OF_N_STATUS, ulID) - 0usize];
    ["Offset of field: CA_M_OF_N_STATUS::ulM"]
        [::std::mem::offset_of!(CA_M_OF_N_STATUS, ulM) - 8usize];
    ["Offset of field: CA_M_OF_N_STATUS::ulN"]
        [::std::mem::offset_of!(CA_M_OF_N_STATUS, ulN) - 16usize];
    ["Offset of field: CA_M_OF_N_STATUS::ulSecretSize"]
        [::std::mem::offset_of!(CA_M_OF_N_STATUS, ulSecretSize) - 24usize];
    ["Offset of field: CA_M_OF_N_STATUS::ulFlag"]
        [::std::mem::offset_of!(CA_M_OF_N_STATUS, ulFlag) - 32usize];
};
pub type CA_MOFN_STATUS = CA_M_OF_N_STATUS;
pub type CA_MOFN_STATUS_PTR = *mut CA_MOFN_STATUS;
#[doc = "\\\n\n Custom module loading and management\n\n\\"]
pub type CKCA_MODULE_ID = CK_ULONG;
pub type CKCA_MODULE_ID_PTR = *mut CKCA_MODULE_ID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CKCA_MODULE_INFO {
    pub ulModuleSize: CK_ULONG,
    pub developerName: [CK_CHAR; 32usize],
    pub moduleDescription: [CK_CHAR; 32usize],
    pub moduleVersion: CK_VERSION,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CKCA_MODULE_INFO"][::std::mem::size_of::<CKCA_MODULE_INFO>() - 80usize];
    ["Alignment of CKCA_MODULE_INFO"][::std::mem::align_of::<CKCA_MODULE_INFO>() - 8usize];
    ["Offset of field: CKCA_MODULE_INFO::ulModuleSize"]
        [::std::mem::offset_of!(CKCA_MODULE_INFO, ulModuleSize) - 0usize];
    ["Offset of field: CKCA_MODULE_INFO::developerName"]
        [::std::mem::offset_of!(CKCA_MODULE_INFO, developerName) - 8usize];
    ["Offset of field: CKCA_MODULE_INFO::moduleDescription"]
        [::std::mem::offset_of!(CKCA_MODULE_INFO, moduleDescription) - 40usize];
    ["Offset of field: CKCA_MODULE_INFO::moduleVersion"]
        [::std::mem::offset_of!(CKCA_MODULE_INFO, moduleVersion) - 72usize];
};
pub type CKCA_MODULE_INFO_PTR = *mut CKCA_MODULE_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_HA_MEMBER {
    pub memberSerial: CK_ULONG,
    pub memberStatus: CK_RV,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_HA_MEMBER"][::std::mem::size_of::<CK_HA_MEMBER>() - 16usize];
    ["Alignment of CK_HA_MEMBER"][::std::mem::align_of::<CK_HA_MEMBER>() - 8usize];
    ["Offset of field: CK_HA_MEMBER::memberSerial"]
        [::std::mem::offset_of!(CK_HA_MEMBER, memberSerial) - 0usize];
    ["Offset of field: CK_HA_MEMBER::memberStatus"]
        [::std::mem::offset_of!(CK_HA_MEMBER, memberStatus) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_HA_STATUS {
    pub groupSerial: CK_ULONG,
    pub memberList: [CK_HA_MEMBER; 32usize],
    pub listSize: CK_ULONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_HA_STATUS"][::std::mem::size_of::<CK_HA_STATUS>() - 528usize];
    ["Alignment of CK_HA_STATUS"][::std::mem::align_of::<CK_HA_STATUS>() - 8usize];
    ["Offset of field: CK_HA_STATUS::groupSerial"]
        [::std::mem::offset_of!(CK_HA_STATUS, groupSerial) - 0usize];
    ["Offset of field: CK_HA_STATUS::memberList"]
        [::std::mem::offset_of!(CK_HA_STATUS, memberList) - 8usize];
    ["Offset of field: CK_HA_STATUS::listSize"]
        [::std::mem::offset_of!(CK_HA_STATUS, listSize) - 520usize];
};
pub type CK_HA_STATE_PTR = *mut CK_HA_STATUS;
pub type CKA_SIM_AUTH_FORM = CK_ULONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_CLUSTER_STATE {
    pub bMembers: [[CK_BYTE; 32usize]; 8usize],
    pub ulMemberStatus: [CK_ULONG; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_CLUSTER_STATE"][::std::mem::size_of::<CK_CLUSTER_STATE>() - 320usize];
    ["Alignment of CK_CLUSTER_STATE"][::std::mem::align_of::<CK_CLUSTER_STATE>() - 8usize];
    ["Offset of field: CK_CLUSTER_STATE::bMembers"]
        [::std::mem::offset_of!(CK_CLUSTER_STATE, bMembers) - 0usize];
    ["Offset of field: CK_CLUSTER_STATE::ulMemberStatus"]
        [::std::mem::offset_of!(CK_CLUSTER_STATE, ulMemberStatus) - 256usize];
};
pub type CK_CLUSTER_STATE_PTR = *mut CK_CLUSTER_STATE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CK_LKM_TOKEN_ID_S {
    pub id: [CK_BYTE; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_LKM_TOKEN_ID_S"][::std::mem::size_of::<CK_LKM_TOKEN_ID_S>() - 20usize];
    ["Alignment of CK_LKM_TOKEN_ID_S"][::std::mem::align_of::<CK_LKM_TOKEN_ID_S>() - 1usize];
    ["Offset of field: CK_LKM_TOKEN_ID_S::id"]
        [::std::mem::offset_of!(CK_LKM_TOKEN_ID_S, id) - 0usize];
};
pub type CK_LKM_TOKEN_ID = CK_LKM_TOKEN_ID_S;
pub type CK_LKM_TOKEN_ID_PTR = *mut CK_LKM_TOKEN_ID;
pub type CK_SFNT_CA_FUNCTION_LIST_PTR = *mut CK_SFNT_CA_FUNCTION_LIST;
pub type CK_SFNT_CA_FUNCTION_LIST_PTR_PTR = *mut CK_SFNT_CA_FUNCTION_LIST_PTR;
pub type CK_CA_GetFunctionList = ::std::option::Option<
    unsafe extern "C" fn(ppSfntFunctionList: CK_SFNT_CA_FUNCTION_LIST_PTR_PTR) -> CK_RV,
>;
pub type CK_CA_WaitForSlotEvent = ::std::option::Option<
    unsafe extern "C" fn(
        flags: CK_FLAGS,
        history: *mut CK_ULONG,
        pSlot: CK_SLOT_ID_PTR,
        pReserved: CK_VOID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_InitIndirectToken = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        pPin: CK_CHAR_PTR,
        usPinLen: CK_ULONG,
        pLabel: CK_CHAR_PTR,
        hPrimarySession: CK_SESSION_HANDLE,
    ) -> CK_RV,
>;
pub type CK_CA_InitIndirectPIN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pPin: CK_CHAR_PTR,
        usPinLen: CK_ULONG,
        hPrimarySession: CK_SESSION_HANDLE,
    ) -> CK_RV,
>;
pub type CK_CA_ResetPIN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pPin: CK_CHAR_PTR,
        usPinLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_CreateLoginChallenge = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        userType: CK_USER_TYPE,
        ulChallengeDataSize: CK_ULONG,
        pChallengeData: CK_CHAR_PTR,
        ulOutputDataSize: CK_ULONG_PTR,
        pOutputData: CK_CHAR_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_Deactivate = ::std::option::Option<
    unsafe extern "C" fn(slotId: CK_SLOT_ID, userType: CK_USER_TYPE) -> CK_RV,
>;
pub type CK_CA_OpenSession = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulContainerNumber: CK_ULONG,
        flags: CK_FLAGS,
        pApplication: CK_VOID_PTR,
        Notify: CK_NOTIFY,
        phSession: CK_SESSION_HANDLE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_IndirectLogin = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        userType: CK_USER_TYPE,
        hPrimarySession: CK_SESSION_HANDLE,
    ) -> CK_RV,
>;
pub type CK_CA_InitializeRemotePEDVector =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_LogVerify = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pTextMsgs: CK_BYTE_PTR,
        ulMsgCount: CK_ULONG,
        bChainToHSM: CK_ULONG,
        pulNumVerified: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LogVerifyFile = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pFileName: CK_CHAR_PTR,
        ulNumVerified: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LogExternal = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        hSession: CK_SESSION_HANDLE,
        pStr: CK_CHAR_PTR,
        ulLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_LogImportSecret = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, pStr: CK_BYTE_PTR) -> CK_RV,
>;
pub type CK_CA_LogExportSecret = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, pStr: CK_BYTE_PTR) -> CK_RV,
>;
pub type CK_CA_DeleteRemotePEDVector =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_ConfigureRemotePED = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        pHostName: CK_CHAR_PTR,
        ulPort: CK_ULONG,
        pulPedId: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_DismantleRemotePED =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID, ulPedId: CK_ULONG) -> CK_RV>;
pub type CK_CA_LogSetConfig = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        mask: CK_ULONG,
        logRotateOffset: CK_ULONG,
        logRotateInterval: CK_ULONG,
        maxLogSize: CK_ULONG,
        pLogPath: CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LogGetconfig = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        mask: *mut CK_ULONG,
        logRotateOffset: *mut CK_ULONG,
        logRotateInterval: *mut CK_ULONG,
        maxLogSize: *mut CK_ULONG,
        pLogPath: CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LogEraseAll =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_LogGetStatus = ::std::option::Option<
    unsafe extern "C" fn(
        slotId: CK_SLOT_ID,
        auditInitStatus: *mut CK_ULONG,
        lastPollResult: *mut CK_ULONG,
        lastSetConfigResult: *mut CK_ULONG,
        isConfigInParamArea: *mut CK_ULONG,
        numRecordsInFlash: *mut CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_GetRemotePEDVectorStatus = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pulStatus: CK_ULONG_PTR) -> CK_RV,
>;
pub type CK_CA_Restart = ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID) -> CK_RV>;
pub type CK_CA_RestartForContainer = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, ulContainerNumber: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_CloseApplicationID = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, ulHigh: CK_ULONG, ulLow: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_CloseApplicationIDForContainer = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulHigh: CK_ULONG,
        ulLow: CK_ULONG,
        ulContainerNumber: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_OpenApplicationID = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, ulHigh: CK_ULONG, ulLow: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_OpenApplicationIDForContainer = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulHigh: CK_ULONG,
        ulLow: CK_ULONG,
        ulContainerNumber: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_SetApplicationID =
    ::std::option::Option<unsafe extern "C" fn(ulHigh: CK_ULONG, ulLow: CK_ULONG) -> CK_RV>;
pub type CK_CA_ManualKCV =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_SetLKCV = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pLegacyCloningDomainString: CK_BYTE_PTR,
        ulLegacyCloningDomainStringLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_SetKCV = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pCloningDomainString: CK_BYTE_PTR,
        ulCloningDomainStringLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_SetCloningDomain = ::std::option::Option<
    unsafe extern "C" fn(
        pCloningDomainString: CK_BYTE_PTR,
        ulCloningDomainStringLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_ClonePrivateKey = ::std::option::Option<
    unsafe extern "C" fn(
        hTargetSession: CK_SESSION_HANDLE,
        hSourceSession: CK_SESSION_HANDLE,
        hObjectToCloneHandle: CK_OBJECT_HANDLE,
        phClonedKey: CK_OBJECT_HANDLE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_CloneObject = ::std::option::Option<
    unsafe extern "C" fn(
        hTargetSession: CK_SESSION_HANDLE,
        hSourceSession: CK_SESSION_HANDLE,
        ulObjectType: CK_ULONG,
        hObjectHandle: CK_OBJECT_HANDLE,
        phClonedObject: CK_OBJECT_HANDLE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GenerateCloningKEV = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pKEV: CK_BYTE_PTR,
        pulKEVSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_CloneAsTargetInit = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pTWC: CK_BYTE_PTR,
        ulTWCSize: CK_ULONG,
        pKEV: CK_BYTE_PTR,
        ulKEVSize: CK_ULONG,
        bReplicate: CK_BBOOL,
        pPart1: CK_BYTE_PTR,
        pulPart1Size: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_CloneAsSource = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hType: CK_ULONG,
        hHandle: CK_ULONG,
        pPart1: CK_BYTE_PTR,
        ulPart1Size: CK_ULONG,
        bReplicate: CK_BBOOL,
        pPart2: CK_BYTE_PTR,
        pulPart2Size: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_CloneAsTarget = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pKEV: CK_BYTE_PTR,
        ulKEVSize: CK_ULONG,
        pPart2: CK_BYTE_PTR,
        ulPart2Size: CK_ULONG,
        hType: CK_ULONG,
        hHandle: CK_ULONG,
        bReplicate: CK_BBOOL,
        phClonedHandle: CK_OBJECT_HANDLE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SetMofN = ::std::option::Option<unsafe extern "C" fn(bFlag: CK_BBOOL) -> CK_RV>;
pub type CK_CA_GenerateMofN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulM: CK_ULONG,
        pVectors: CA_MOFN_GENERATION_PTR,
        ulVectorCount: CK_ULONG,
        isSecurePortUsed: CK_ULONG,
        pReserved: CK_VOID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GenerateCloneableMofN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulM: CK_ULONG,
        pVectors: CA_MOFN_GENERATION_PTR,
        ulVectorCount: CK_ULONG,
        isSecurePortUsed: CK_ULONG,
        pReserved: CK_VOID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_ModifyMofN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulM: CK_ULONG,
        pVectors: CA_MOFN_GENERATION_PTR,
        ulVectorCount: CK_ULONG,
        isSecurePortUsed: CK_ULONG,
        pReserved: CK_VOID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_CloneMofN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hPrimarySession: CK_SESSION_HANDLE,
        pReserved: CK_VOID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_CloneModifyMofN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hPrimarySession: CK_SESSION_HANDLE,
        pReserved: CK_VOID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_ActivateMofN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pVectors: CA_MOFN_ACTIVATION_PTR,
        ulVectorCount: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_DeactivateMofN =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_GetMofNStatus = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pMofNStatus: CA_MOFN_STATUS_PTR) -> CK_RV,
>;
pub type CK_CA_DuplicateMofN =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_IsMofNEnabled =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID, enabled: CK_ULONG_PTR) -> CK_RV>;
pub type CK_CA_IsMofNRequired = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, required: CK_ULONG_PTR) -> CK_RV,
>;
pub type CK_CA_GenerateTokenKeys = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pTemplate: CK_ATTRIBUTE_PTR,
        usTemplateLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_GetTokenCertificateInfo = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulAccessLevel: CK_ULONG,
        pCertificate: CK_BYTE_PTR,
        pulCertificateLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SetTokenCertificateSignature = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulAccessLevel: CK_ULONG,
        ulCustomerId: CK_ULONG,
        pPublicTemplate: CK_ATTRIBUTE_PTR,
        usPublicTemplateLen: CK_ULONG,
        pSignature: CK_BYTE_PTR,
        ulSignatureLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_GetModuleList = ::std::option::Option<
    unsafe extern "C" fn(
        slotId: CK_SLOT_ID,
        pList: CKCA_MODULE_ID_PTR,
        ulListLen: CK_ULONG,
        pulReturnedSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetModuleInfo = ::std::option::Option<
    unsafe extern "C" fn(
        slotId: CK_SLOT_ID,
        moduleId: CKCA_MODULE_ID,
        pInfo: CKCA_MODULE_INFO_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LoadModule = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pModuleCode: CK_BYTE_PTR,
        ulModuleCodeSize: CK_ULONG,
        pModuleSignature: CK_BYTE_PTR,
        ulModuleSignatureSize: CK_ULONG,
        pCertificate: CK_BYTE_PTR,
        ulCertificateSize: CK_ULONG,
        pControlData: CK_BYTE_PTR,
        ulControlDataSize: CK_ULONG,
        pModuleId: CKCA_MODULE_ID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LoadEncryptedModule = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hKey: CK_OBJECT_HANDLE,
        pIv: CK_BYTE_PTR,
        ulIvLen: CK_ULONG,
        pModuleCode: CK_BYTE_PTR,
        ulModuleCodeSize: CK_ULONG,
        pModuleSignature: CK_BYTE_PTR,
        ulModuleSignatureSize: CK_ULONG,
        pCertificate: CK_BYTE_PTR,
        ulCertificateSize: CK_ULONG,
        pModuleId: CKCA_MODULE_ID_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_UnloadModule = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, moduleId: CKCA_MODULE_ID) -> CK_RV,
>;
pub type CK_CA_PerformModuleCall = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        moduleId: CKCA_MODULE_ID,
        pRequest: CK_BYTE_PTR,
        ulRequestSize: CK_ULONG,
        pAnswer: CK_BYTE_PTR,
        ulAnswerSize: CK_ULONG,
        pulAnswerAvailable: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_C_PerformSelfTest = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        typeOfTest: CK_ULONG,
        inputData: CK_BYTE_PTR,
        sizeOfInputData: CK_ULONG,
        outputData: CK_BYTE_PTR,
        sizeOfOutputData: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_FirmwareUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulTargetHardwarePlatform: CK_ULONG,
        ulAuthCodeLen: CK_ULONG,
        pAuthCode: CK_BYTE_PTR,
        ulManifestLen: CK_ULONG,
        pManifest: CK_BYTE_PTR,
        ulFirmwareLen: CK_ULONG,
        pFirmware: CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_FirmwareRollback =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_CapabilityUpdate = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulManifestLen: CK_ULONG,
        pManifest: CK_BYTE_PTR,
        ulAuthcodeLen: CK_ULONG,
        pAuthcode: CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetUserContainerNumber = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pulContainerNumber: CK_ULONG_PTR) -> CK_RV,
>;
pub type CK_CA_GetUserContainerName = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pName: CK_BYTE_PTR, pulNameLen: CK_ULONG_PTR) -> CK_RV,
>;
pub type CK_CA_SetUserContainerName = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pName: CK_BYTE_PTR, ulNameLen: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_GetTokenInsertionCount = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pulCount: CK_ULONG_PTR) -> CK_RV,
>;
pub type CK_CA_GetRollbackFirmwareVersion = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pulVersion: CK_ULONG_PTR) -> CK_RV,
>;
pub type CK_CA_GetFPV =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID, pulFpv: CK_ULONG_PTR) -> CK_RV>;
pub type CK_CA_GetTPV =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID, pulTpv: CK_ULONG_PTR) -> CK_RV>;
pub type CK_CA_GetExtendedTPV = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        pulTpv: CK_ULONG_PTR,
        pulTpvExt: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetConfigurationElementDescription = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulIsContainerElement: CK_ULONG,
        ulIsCapabilityElement: CK_ULONG,
        ulElementId: CK_ULONG,
        pulElementBitLength: CK_ULONG_PTR,
        pulElementDestructive: CK_ULONG_PTR,
        pulElementWriteRestricted: CK_ULONG_PTR,
        pDescription: CK_CHAR_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetHSMCapabilitySet = ::std::option::Option<
    unsafe extern "C" fn(
        uPhysicalSlot: CK_SLOT_ID,
        pulCapIdArray: CK_ULONG_PTR,
        pulCapIdSize: CK_ULONG_PTR,
        pulCapValArray: CK_ULONG_PTR,
        pulCapValSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetHSMCapabilitySetting = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulPolicyId: CK_ULONG,
        pulPolicyValue: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetHSMPolicySet = ::std::option::Option<
    unsafe extern "C" fn(
        uPhysicalSlot: CK_SLOT_ID,
        pulPolicyIdArray: CK_ULONG_PTR,
        pulPolicyIdSize: CK_ULONG_PTR,
        pulPolicyValArray: CK_ULONG_PTR,
        pulPolicyValSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetHSMPolicySetting = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulPolicyId: CK_ULONG,
        pulPolicyValue: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetContainerCapabilitySet = ::std::option::Option<
    unsafe extern "C" fn(
        uPhysicalSlot: CK_SLOT_ID,
        ulContainerNumber: CK_ULONG,
        pulCapIdArray: CK_ULONG_PTR,
        pulCapIdSize: CK_ULONG_PTR,
        pulCapValArray: CK_ULONG_PTR,
        pulCapValSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetContainerCapabilitySetting = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulContainerNumber: CK_ULONG,
        ulPolicyId: CK_ULONG,
        pulPolicyValue: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetContainerPolicySet = ::std::option::Option<
    unsafe extern "C" fn(
        uPhysicalSlot: CK_SLOT_ID,
        ulContainerNumber: CK_ULONG,
        pulPolicyIdArray: CK_ULONG_PTR,
        pulPolicyIdSize: CK_ULONG_PTR,
        pulPolicyValArray: CK_ULONG_PTR,
        pulPolicyValSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetContainerPolicySetting = ::std::option::Option<
    unsafe extern "C" fn(
        uPhysicalSlot: CK_SLOT_ID,
        ulContainerNumber: CK_ULONG,
        ulPolicyId: CK_ULONG,
        pulPolicyValue: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SetTPV = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, ulTpv: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_SetExtendedTPV = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, ulTpv: CK_ULONG, ulTpvExt: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_SetHSMPolicy = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulPolicyId: CK_ULONG,
        ulPolicyValue: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_SetHSMPolicies = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulPolicyCount: CK_ULONG,
        pulPolicyIdArray: CK_ULONG_PTR,
        pulPolicyValueArray: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SetDestructiveHSMPolicy = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulPolicyId: CK_ULONG,
        ulPolicyValue: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_SetDestructiveHSMPolicies = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulPolicyCount: CK_ULONG,
        pulPolicyIdArray: CK_ULONG_PTR,
        pulPolicyValueArray: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SetContainerPolicy = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulContainer: CK_ULONG,
        ulPolicyId: CK_ULONG,
        ulPolicyValue: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_SetContainerPolicies = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulContainer: CK_ULONG,
        ulPolicyCount: CK_ULONG,
        pulPolicyIdArray: CK_ULONG_PTR,
        pulPolicyValueArray: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_RetrieveLicenseList = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        pulidArraySize: CK_ULONG_PTR,
        pulidArray: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_QueryLicense = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        licenseIdLow: CK_ULONG,
        licenseIdHigh: CK_ULONG,
        pulLicenseType: CK_ULONG_PTR,
        pulDescVersion: CK_ULONG_PTR,
        pulDescSize: CK_ULONG_PTR,
        pbDescBuffer: CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetContainerStatus = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulContainerNumber: CK_ULONG,
        pulContainerStatusFlags: CK_ULONG_PTR,
        pulFailedSOLogins: CK_ULONG_PTR,
        pulFailedUserLogins: CK_ULONG_PTR,
        pulFailedLimitedUserLogins: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetSessionInfo = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pulAidHigh: CK_ULONG_PTR,
        pulAidLow: CK_ULONG_PTR,
        pulContainerNumber: CK_ULONG_PTR,
        pulAuthenticationLevel: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_ReadCommonStore = ::std::option::Option<
    unsafe extern "C" fn(
        index: CK_ULONG,
        pBuffer: CK_BYTE_PTR,
        pulBufferSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_WriteCommonStore = ::std::option::Option<
    unsafe extern "C" fn(index: CK_ULONG, pBuffer: CK_BYTE_PTR, ulBufferSize: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_GetPrimarySlot = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, slotId_p: CK_SLOT_ID_PTR) -> CK_RV,
>;
pub type CK_CA_GetSecondarySlot = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, slotId_p: CK_SLOT_ID_PTR) -> CK_RV,
>;
pub type CK_CA_SwitchSecondarySlot = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        slotID: CK_SLOT_ID,
        slotInstance: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_CloseSecondarySession = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        slotID: CK_SLOT_ID,
        slotInstance: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_CloseAllSecondarySessions =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_ChoosePrimarySlot =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_ChooseSecondarySlot =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_CloneObjectToAllSessions = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, hObject: CK_OBJECT_HANDLE) -> CK_RV,
>;
pub type CK_CA_CloneAllObjectsToSession = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, slotId: CK_SLOT_ID) -> CK_RV,
>;
pub type CK_CA_ResetDevice =
    ::std::option::Option<unsafe extern "C" fn(slotId: CK_SLOT_ID, flags: CK_FLAGS) -> CK_RV>;
pub type CK_CA_FactoryReset =
    ::std::option::Option<unsafe extern "C" fn(slotId: CK_SLOT_ID, flags: CK_FLAGS) -> CK_RV>;
pub type CK_CA_SetPedId =
    ::std::option::Option<unsafe extern "C" fn(slotId: CK_SLOT_ID, usPedId: CK_ULONG) -> CK_RV>;
pub type CK_CA_GetPedId = ::std::option::Option<
    unsafe extern "C" fn(slotId: CK_SLOT_ID, usPedId: *mut CK_ULONG) -> CK_RV,
>;
pub type CK_CA_SpRawRead =
    ::std::option::Option<unsafe extern "C" fn(slotId: CK_SLOT_ID, data: CK_ULONG_PTR) -> CK_RV>;
pub type CK_CA_SpRawWrite =
    ::std::option::Option<unsafe extern "C" fn(slotId: CK_SLOT_ID, data: CK_ULONG_PTR) -> CK_RV>;
pub type CK_CA_CheckOperationState = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        operation: CK_ULONG,
        pactive: *mut CK_BBOOL,
    ) -> CK_RV,
>;
pub type CK_CA_DestroyMultipleObjects = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulHandleCount: CK_ULONG,
        pHandleList: CK_OBJECT_HANDLE_PTR,
        pulIndex: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_HAInit = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, hLoginPrivateKey: CK_OBJECT_HANDLE) -> CK_RV,
>;
pub type CK_CA_HAGetMasterPublic = ::std::option::Option<
    unsafe extern "C" fn(
        slotId: CK_SLOT_ID,
        pCertificate: CK_BYTE_PTR,
        pulCertificate: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_HAGetLoginChallenge = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        userType: CK_USER_TYPE,
        pCertificate: CK_BYTE_PTR,
        ulCertificateLen: CK_ULONG,
        pChallengeBlob: CK_BYTE_PTR,
        pulChallengeBlobLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_HAAnswerLoginChallenge = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hLoginPrivateKey: CK_OBJECT_HANDLE,
        pChallengeBlob: CK_BYTE_PTR,
        ulChallengeBlobLen: CK_ULONG,
        pEncryptedPin: CK_BYTE_PTR,
        pulEncryptedPinLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_HALogin = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pEncryptedPin: CK_BYTE_PTR,
        ulEncryptedPinLen: CK_ULONG,
        pMofNBlob: CK_BYTE_PTR,
        pulMofNBlobLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_HAAnswerMofNChallenge = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pMofNBlob: CK_BYTE_PTR,
        ulMofNBlobLen: CK_ULONG,
        pMofNSecretBlob: CK_BYTE_PTR,
        pulMofNSecretBlobLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_HAActivateMofN = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pMofNSecretBlob: CK_BYTE_PTR,
        ulMofNSecretBlobLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_GetHAState = ::std::option::Option<
    unsafe extern "C" fn(slotId: CK_SLOT_ID, pState: CK_HA_STATE_PTR) -> CK_RV,
>;
pub type CK_CA_GetTokenCertificates = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulCertType: CK_ULONG,
        pCertificate: CK_BYTE_PTR,
        pulCertificateLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_ExtractMaskedObject = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulObjectHandle: CK_ULONG,
        pMaskedKey: CK_BYTE_PTR,
        pusMaskedKeyLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_InsertMaskedObject = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pulObjectHandle: CK_ULONG_PTR,
        pMaskedKey: CK_BYTE_PTR,
        usMaskedKeyLen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_MultisignValue = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pMechanism: CK_MECHANISM_PTR,
        ulMaskedKeyLen: CK_ULONG,
        pMaskedKey: CK_BYTE_PTR,
        pulBlobCount: CK_ULONG_PTR,
        pulBlobLens: CK_ULONG_PTR,
        ppBlobs: *mut CK_BYTE_PTR,
        pulSignatureLens: CK_ULONG_PTR,
        ppSignatures: *mut CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SIMExtract = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulHandleCount: CK_ULONG,
        pHandleList: CK_OBJECT_HANDLE_PTR,
        ulAuthSecretCount: CK_ULONG,
        ulAuthSubsetCount: CK_ULONG,
        authForm: CKA_SIM_AUTH_FORM,
        pulAuthSecretSizes: CK_ULONG_PTR,
        ppbAuthSecretList: *mut CK_BYTE_PTR,
        deleteAfterExtract: CK_BBOOL,
        pulBlobSize: CK_ULONG_PTR,
        pBlob: CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SIMInsert = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulAuthSecretCount: CK_ULONG,
        authForm: CKA_SIM_AUTH_FORM,
        pulAuthSecretSizes: CK_ULONG_PTR,
        ppbAuthSecretList: *mut CK_BYTE_PTR,
        ulBlobSize: CK_ULONG,
        pBlob: CK_BYTE_PTR,
        pulHandleCount: CK_ULONG_PTR,
        pHandleList: CK_OBJECT_HANDLE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SIMMultiSign = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pMechanism: CK_MECHANISM_PTR,
        ulAuthSecretCount: CK_ULONG,
        authForm: CKA_SIM_AUTH_FORM,
        pulAuthSecretSizes: CK_ULONG_PTR,
        ppbAuthSecretList: *mut CK_BYTE_PTR,
        ulBlobSize: CK_ULONG,
        pBlob: CK_BYTE_PTR,
        ulInputDataCount: CK_ULONG,
        pulInputDataLengths: CK_ULONG_PTR,
        ppbInputDataList: *mut CK_BYTE_PTR,
        pulSignatureLengths: CK_ULONG_PTR,
        ppbSignatureList: *mut CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_Extract = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, pMechanism: CK_MECHANISM_PTR) -> CK_RV,
>;
pub type CK_CA_Insert = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, pMechanism: CK_MECHANISM_PTR) -> CK_RV,
>;
pub type CK_CA_GetObjectUID = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulContainerNum: CK_ULONG,
        ulObjectType: CK_ULONG,
        ulObjectHandle: CK_ULONG,
        ouid: *mut CK_BYTE,
    ) -> CK_RV,
>;
pub type CK_CA_GetObjectHandle = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulContainerNum: CK_ULONG,
        ouid: *mut CK_BYTE,
        pulObjectType: CK_ULONG_PTR,
        pulObjectHandle: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_DeleteContainer =
    ::std::option::Option<unsafe extern "C" fn(hSession: CK_SESSION_HANDLE) -> CK_RV>;
pub type CK_CA_MTKSetStorage = ::std::option::Option<
    unsafe extern "C" fn(ulSessionNumber: CK_SESSION_HANDLE, ulStorageSetting: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_MTKRestore =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID) -> CK_RV>;
pub type CK_CA_MTKResplit =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID) -> CK_RV>;
pub type CK_CA_MTKZeroize =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID) -> CK_RV>;
pub type CK_CA_MTKGetState =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID, state: CK_ULONG_PTR) -> CK_RV>;
pub type CK_CA_GetTSV =
    ::std::option::Option<unsafe extern "C" fn(slotID: CK_SLOT_ID, pTSV: CK_ULONG_PTR) -> CK_RV>;
pub type CK_CA_InvokeServiceInit = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, ulPortNumber: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_InvokeService = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pBufferIn: CK_BYTE_PTR,
        ulBufferInLength: CK_ULONG,
        pulBufferOutLength: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_InvokeServiceFinal = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pBufferOut: CK_BYTE_PTR,
        pulBufferOutLength: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_InvokeServiceAsynch = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulPortNumber: CK_ULONG,
        pBufferIn: CK_BYTE_PTR,
        ulBufferInLength: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_InvokeServiceSinglePart = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulPortNumber: CK_ULONG,
        pBufferIn: CK_BYTE_PTR,
        ulBufferInLength: CK_ULONG,
        pBufferOut: CK_BYTE_PTR,
        pulBufferOutLength: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_EncodeECPrimeParams = ::std::option::Option<
    unsafe extern "C" fn(
        DerECParams: CK_BYTE_PTR,
        DerECParamsLen: CK_ULONG_PTR,
        prime: CK_BYTE_PTR,
        primelen: CK_ULONG,
        a: CK_BYTE_PTR,
        alen: CK_ULONG,
        b: CK_BYTE_PTR,
        blen: CK_ULONG,
        seed: CK_BYTE_PTR,
        seedlen: CK_ULONG,
        x: CK_BYTE_PTR,
        xlen: CK_ULONG,
        y: CK_BYTE_PTR,
        ylen: CK_ULONG,
        order: CK_BYTE_PTR,
        orderlen: CK_ULONG,
        cofactor: CK_BYTE_PTR,
        cofactorlen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_EncodeECChar2Params = ::std::option::Option<
    unsafe extern "C" fn(
        DerECParams: CK_BYTE_PTR,
        DerECParamsLen: CK_ULONG_PTR,
        m: CK_ULONG,
        k1: CK_ULONG,
        k2: CK_ULONG,
        k3: CK_ULONG,
        a: CK_BYTE_PTR,
        alen: CK_ULONG,
        b: CK_BYTE_PTR,
        blen: CK_ULONG,
        seed: CK_BYTE_PTR,
        seedlen: CK_ULONG,
        x: CK_BYTE_PTR,
        xlen: CK_ULONG,
        y: CK_BYTE_PTR,
        ylen: CK_ULONG,
        order: CK_BYTE_PTR,
        orderlen: CK_ULONG,
        cofactor: CK_BYTE_PTR,
        cofactorlen: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_EncodeECParamsFromFile = ::std::option::Option<
    unsafe extern "C" fn(
        DerECParams: CK_BYTE_PTR,
        DerECParamsLen: CK_ULONG_PTR,
        paramsFile: CK_BYTE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetHSMStorageInformation = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        pulContainerOverhead: CK_ULONG_PTR,
        pulTotal: CK_ULONG_PTR,
        pulUsed: CK_ULONG_PTR,
        pulFree: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetContainerStorageInformation = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulContainerNumber: CK_ULONG,
        pulContainerOverhead: CK_ULONG_PTR,
        pulTotal: CK_ULONG_PTR,
        pulUsed: CK_ULONG_PTR,
        pulFree: CK_ULONG_PTR,
        pulObjectCount: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_SetContainerSize = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulContainerNumber: CK_ULONG,
        ulSize: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_CreateContainer = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        ulUSV: CK_ULONG,
        pContainerName: CK_CHAR_PTR,
        usContainerNameLen: CK_ULONG,
        pPin: CK_CHAR_PTR,
        usPinLen: CK_ULONG,
        ulIDHigh: CK_ULONG,
        ulIDLow: CK_ULONG,
        ulOwnerHandle: CK_ULONG,
        ulStorageFlags: CK_ULONG,
        ulContainerSize: CK_ULONG,
        pulContainerNumber: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_DeleteContainerWithHandle = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, ulContainerNumber: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_GetContainerList = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulGroupHandle: CK_ULONG,
        ulContainerType: CK_ULONG,
        pulContainerHandles: CK_ULONG_PTR,
        pulNumberOfHandles: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetContainerName = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        ulContainerHandle: CK_ULONG,
        pContainerName: CK_BYTE_PTR,
        pulContainerNameLen: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_GetNumberOfAllowedContainers = ::std::option::Option<
    unsafe extern "C" fn(slot: CK_SLOT_ID, pulAllowedContainers: CK_ULONG_PTR) -> CK_RV,
>;
pub type CK_CA_GetTunnelSlotNumber = ::std::option::Option<
    unsafe extern "C" fn(slotID: CK_SLOT_ID, pTunnelSlotID: CK_SLOT_ID_PTR) -> CK_RV,
>;
pub type CK_CA_GetClusterState = ::std::option::Option<
    unsafe extern "C" fn(slotId: CK_SLOT_ID, pState: CK_CLUSTER_STATE_PTR) -> CK_RV,
>;
pub type CK_CA_LockClusteredSlot =
    ::std::option::Option<unsafe extern "C" fn(slotId: CK_SLOT_ID) -> CK_RV>;
pub type CK_CA_UnlockClusteredSlot =
    ::std::option::Option<unsafe extern "C" fn(slotId: CK_SLOT_ID) -> CK_RV>;
pub type CK_CA_LKMInitiatorChallenge = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hAKObjectHandle: CK_OBJECT_HANDLE,
        hDKObjectHandle: CK_OBJECT_HANDLE,
        ulHashMech: CK_ULONG,
        pInitiatorID: CK_LKM_TOKEN_ID_PTR,
        pReceiverID: CK_LKM_TOKEN_ID_PTR,
        pChallengeBuf: CK_CHAR_PTR,
        pulChallengeBufSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LKMReceiverResponse = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hAKObjectHandle: CK_OBJECT_HANDLE,
        hDKObjectHandle: CK_OBJECT_HANDLE,
        ulHashMech: CK_ULONG,
        pReceiverID: CK_LKM_TOKEN_ID_PTR,
        pChallengeBuf: CK_CHAR_PTR,
        ulChallengeBufSize: CK_ULONG,
        pResponseBuf: CK_CHAR_PTR,
        pulResponseBufSize: CK_ULONG_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LKMInitiatorComplete = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pResponseBuf: CK_CHAR_PTR,
        ulResponseBufSize: CK_ULONG,
        pSCKTemplate: CK_ATTRIBUTE_PTR,
        usSCKAttributeCount: CK_ULONG,
        pSAKTemplate: CK_ATTRIBUTE_PTR,
        usSAKAttributeCount: CK_ULONG,
        pCompleteBuf: CK_CHAR_PTR,
        pulCompleteBufSize: CK_ULONG_PTR,
        phSCKObjectHandle: CK_OBJECT_HANDLE_PTR,
        phSAKObjectHandle: CK_OBJECT_HANDLE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_LKMReceiverComplete = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        pCompleteBuf: CK_CHAR_PTR,
        ulCompleteBufSize: CK_ULONG,
        pSCKTemplate: CK_ATTRIBUTE_PTR,
        usSCKAttributeCount: CK_ULONG,
        pSAKTemplate: CK_ATTRIBUTE_PTR,
        usSAKAttributeCount: CK_ULONG,
        phSCKObjectHandle: CK_OBJECT_HANDLE_PTR,
        phSAKObjectHandle: CK_OBJECT_HANDLE_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_ModifyUsageCount = ::std::option::Option<
    unsafe extern "C" fn(
        hSession: CK_SESSION_HANDLE,
        hObject: CK_OBJECT_HANDLE,
        ulCommandType: CK_ULONG,
        ulValue: CK_ULONG,
    ) -> CK_RV,
>;
pub type CK_CA_InitAudit = ::std::option::Option<
    unsafe extern "C" fn(
        slotID: CK_SLOT_ID,
        pPin: CK_CHAR_PTR,
        usPinLen: CK_ULONG,
        pLabel: CK_CHAR_PTR,
    ) -> CK_RV,
>;
pub type CK_CA_TimeSync = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, ulTime: CK_ULONG) -> CK_RV,
>;
pub type CK_CA_GetTime = ::std::option::Option<
    unsafe extern "C" fn(hSession: CK_SESSION_HANDLE, pulTime: CK_ULONG_PTR) -> CK_RV,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CK_SFNT_CA_FUNCTION_LIST {
    pub version: CK_VERSION,
    pub CA_GetFunctionList: CK_CA_GetFunctionList,
    pub CA_WaitForSlotEvent: CK_CA_WaitForSlotEvent,
    pub CA_InitIndirectToken: CK_CA_InitIndirectToken,
    pub CA_InitIndirectPIN: CK_CA_InitIndirectPIN,
    pub CA_ResetPIN: CK_CA_ResetPIN,
    pub CA_CreateLoginChallenge: CK_CA_CreateLoginChallenge,
    pub CA_Deactivate: CK_CA_Deactivate,
    pub CA_OpenSession: CK_CA_OpenSession,
    pub CA_IndirectLogin: CK_CA_IndirectLogin,
    pub CA_InitializeRemotePEDVector: CK_CA_InitializeRemotePEDVector,
    pub CA_DeleteRemotePEDVector: CK_CA_DeleteRemotePEDVector,
    pub CA_GetRemotePEDVectorStatus: CK_CA_GetRemotePEDVectorStatus,
    pub CA_ConfigureRemotePED: CK_CA_ConfigureRemotePED,
    pub CA_DismantleRemotePED: CK_CA_DismantleRemotePED,
    pub CA_Restart: CK_CA_Restart,
    pub CA_RestartForContainer: CK_CA_RestartForContainer,
    pub CA_CloseApplicationID: CK_CA_CloseApplicationID,
    pub CA_CloseApplicationIDForContainer: CK_CA_CloseApplicationIDForContainer,
    pub CA_OpenApplicationID: CK_CA_OpenApplicationID,
    pub CA_OpenApplicationIDForContainer: CK_CA_OpenApplicationIDForContainer,
    pub CA_SetApplicationID: CK_CA_SetApplicationID,
    pub CA_ManualKCV: CK_CA_ManualKCV,
    pub CA_SetLKCV: CK_CA_SetLKCV,
    pub CA_SetKCV: CK_CA_SetKCV,
    pub CA_SetCloningDomain: CK_CA_SetCloningDomain,
    pub CA_ClonePrivateKey: CK_CA_ClonePrivateKey,
    pub CA_CloneObject: CK_CA_CloneObject,
    pub CA_GenerateCloningKEV: CK_CA_GenerateCloningKEV,
    pub CA_CloneAsTargetInit: CK_CA_CloneAsTargetInit,
    pub CA_CloneAsSource: CK_CA_CloneAsSource,
    pub CA_CloneAsTarget: CK_CA_CloneAsTarget,
    pub CA_SetMofN: CK_CA_SetMofN,
    pub CA_GenerateMofN: CK_CA_GenerateMofN,
    pub CA_GenerateCloneableMofN: CK_CA_GenerateCloneableMofN,
    pub CA_ModifyMofN: CK_CA_ModifyMofN,
    pub CA_CloneMofN: CK_CA_CloneMofN,
    pub CA_CloneModifyMofN: CK_CA_CloneModifyMofN,
    pub CA_ActivateMofN: CK_CA_ActivateMofN,
    pub CA_DeactivateMofN: CK_CA_DeactivateMofN,
    pub CA_GetMofNStatus: CK_CA_GetMofNStatus,
    pub CA_DuplicateMofN: CK_CA_DuplicateMofN,
    pub CA_IsMofNEnabled: CK_CA_IsMofNEnabled,
    pub CA_IsMofNRequired: CK_CA_IsMofNRequired,
    pub CA_GenerateTokenKeys: CK_CA_GenerateTokenKeys,
    pub CA_GetTokenCertificateInfo: CK_CA_GetTokenCertificateInfo,
    pub CA_SetTokenCertificateSignature: CK_CA_SetTokenCertificateSignature,
    pub CA_GetModuleList: CK_CA_GetModuleList,
    pub CA_GetModuleInfo: CK_CA_GetModuleInfo,
    pub CA_LoadModule: CK_CA_LoadModule,
    pub CA_LoadEncryptedModule: CK_CA_LoadEncryptedModule,
    pub CA_UnloadModule: CK_CA_UnloadModule,
    pub CA_PerformModuleCall: CK_CA_PerformModuleCall,
    pub C_PerformSelfTest: CK_C_PerformSelfTest,
    pub CA_FirmwareUpdate: CK_CA_FirmwareUpdate,
    pub CA_FirmwareRollback: CK_CA_FirmwareRollback,
    pub CA_CapabilityUpdate: CK_CA_CapabilityUpdate,
    pub CA_GetUserContainerNumber: CK_CA_GetUserContainerNumber,
    pub CA_GetUserContainerName: CK_CA_GetUserContainerName,
    pub CA_SetUserContainerName: CK_CA_SetUserContainerName,
    pub CA_GetTokenInsertionCount: CK_CA_GetTokenInsertionCount,
    pub CA_GetRollbackFirmwareVersion: CK_CA_GetRollbackFirmwareVersion,
    pub CA_GetFPV: CK_CA_GetFPV,
    pub CA_GetTPV: CK_CA_GetTPV,
    pub CA_GetExtendedTPV: CK_CA_GetExtendedTPV,
    pub CA_GetConfigurationElementDescription: CK_CA_GetConfigurationElementDescription,
    pub CA_GetHSMCapabilitySet: CK_CA_GetHSMCapabilitySet,
    pub CA_GetHSMCapabilitySetting: CK_CA_GetHSMCapabilitySetting,
    pub CA_GetHSMPolicySet: CK_CA_GetHSMPolicySet,
    pub CA_GetHSMPolicySetting: CK_CA_GetHSMPolicySetting,
    pub CA_GetContainerCapabilitySet: CK_CA_GetContainerCapabilitySet,
    pub CA_GetContainerCapabilitySetting: CK_CA_GetContainerCapabilitySetting,
    pub CA_GetContainerPolicySet: CK_CA_GetContainerPolicySet,
    pub CA_GetContainerPolicySetting: CK_CA_GetContainerPolicySetting,
    pub CA_SetTPV: CK_CA_SetTPV,
    pub CA_SetExtendedTPV: CK_CA_SetExtendedTPV,
    pub CA_SetHSMPolicy: CK_CA_SetHSMPolicy,
    pub CA_SetHSMPolicies: CK_CA_SetHSMPolicies,
    pub CA_SetDestructiveHSMPolicy: CK_CA_SetDestructiveHSMPolicy,
    pub CA_SetDestructiveHSMPolicies: CK_CA_SetDestructiveHSMPolicies,
    pub CA_SetContainerPolicy: CK_CA_SetContainerPolicy,
    pub CA_SetContainerPolicies: CK_CA_SetContainerPolicies,
    pub CA_RetrieveLicenseList: CK_CA_RetrieveLicenseList,
    pub CA_QueryLicense: CK_CA_QueryLicense,
    pub CA_GetContainerStatus: CK_CA_GetContainerStatus,
    pub CA_GetSessionInfo: CK_CA_GetSessionInfo,
    pub CA_ReadCommonStore: CK_CA_ReadCommonStore,
    pub CA_WriteCommonStore: CK_CA_WriteCommonStore,
    pub CA_GetPrimarySlot: CK_CA_GetPrimarySlot,
    pub CA_GetSecondarySlot: CK_CA_GetSecondarySlot,
    pub CA_SwitchSecondarySlot: CK_CA_SwitchSecondarySlot,
    pub CA_CloseSecondarySession: CK_CA_CloseSecondarySession,
    pub CA_CloseAllSecondarySessions: CK_CA_CloseAllSecondarySessions,
    pub CA_ChoosePrimarySlot: CK_CA_ChoosePrimarySlot,
    pub CA_ChooseSecondarySlot: CK_CA_ChooseSecondarySlot,
    pub CA_CloneObjectToAllSessions: CK_CA_CloneObjectToAllSessions,
    pub CA_CloneAllObjectsToSession: CK_CA_CloneAllObjectsToSession,
    pub CA_ResetDevice: CK_CA_ResetDevice,
    pub CA_FactoryReset: CK_CA_FactoryReset,
    pub CA_SetPedId: CK_CA_SetPedId,
    pub CA_GetPedId: CK_CA_GetPedId,
    pub CA_SpRawRead: CK_CA_SpRawRead,
    pub CA_SpRawWrite: CK_CA_SpRawWrite,
    pub CA_CheckOperationState: CK_CA_CheckOperationState,
    pub CA_DestroyMultipleObjects: CK_CA_DestroyMultipleObjects,
    pub CA_HAInit: CK_CA_HAInit,
    pub CA_HAGetMasterPublic: CK_CA_HAGetMasterPublic,
    pub CA_HAGetLoginChallenge: CK_CA_HAGetLoginChallenge,
    pub CA_HAAnswerLoginChallenge: CK_CA_HAAnswerLoginChallenge,
    pub CA_HALogin: CK_CA_HALogin,
    pub CA_HAAnswerMofNChallenge: CK_CA_HAAnswerMofNChallenge,
    pub CA_HAActivateMofN: CK_CA_HAActivateMofN,
    pub CA_GetHAState: CK_CA_GetHAState,
    pub CA_GetTokenCertificates: CK_CA_GetTokenCertificates,
    pub CA_ExtractMaskedObject: CK_CA_ExtractMaskedObject,
    pub CA_InsertMaskedObject: CK_CA_InsertMaskedObject,
    pub CA_MultisignValue: CK_CA_MultisignValue,
    pub CA_SIMExtract: CK_CA_SIMExtract,
    pub CA_SIMInsert: CK_CA_SIMInsert,
    pub CA_SIMMultiSign: CK_CA_SIMMultiSign,
    pub CA_Extract: CK_CA_Extract,
    pub CA_Insert: CK_CA_Insert,
    pub CA_GetObjectUID: CK_CA_GetObjectUID,
    pub CA_GetObjectHandle: CK_CA_GetObjectHandle,
    pub CA_DeleteContainer: CK_CA_DeleteContainer,
    pub CA_MTKSetStorage: CK_CA_MTKSetStorage,
    pub CA_MTKRestore: CK_CA_MTKRestore,
    pub CA_MTKResplit: CK_CA_MTKResplit,
    pub CA_MTKZeroize: CK_CA_MTKZeroize,
    pub CA_MTKGetState: CK_CA_MTKGetState,
    pub CA_GetTSV: CK_CA_GetTSV,
    pub CA_InvokeServiceInit: CK_CA_InvokeServiceInit,
    pub CA_InvokeService: CK_CA_InvokeService,
    pub CA_InvokeServiceFinal: CK_CA_InvokeServiceFinal,
    pub CA_InvokeServiceAsynch: CK_CA_InvokeServiceAsynch,
    pub CA_InvokeServiceSinglePart: CK_CA_InvokeServiceSinglePart,
    pub CA_EncodeECPrimeParams: CK_CA_EncodeECPrimeParams,
    pub CA_EncodeECChar2Params: CK_CA_EncodeECChar2Params,
    pub CA_EncodeECParamsFromFile: CK_CA_EncodeECParamsFromFile,
    pub CA_GetHSMStorageInformation: CK_CA_GetHSMStorageInformation,
    pub CA_GetContainerStorageInformation: CK_CA_GetContainerStorageInformation,
    pub CA_SetContainerSize: CK_CA_SetContainerSize,
    pub CA_CreateContainer: CK_CA_CreateContainer,
    pub CA_DeleteContainerWithHandle: CK_CA_DeleteContainerWithHandle,
    pub CA_GetContainerList: CK_CA_GetContainerList,
    pub CA_GetContainerName: CK_CA_GetContainerName,
    pub CA_GetNumberOfAllowedContainers: CK_CA_GetNumberOfAllowedContainers,
    pub CA_GetTunnelSlotNumber: CK_CA_GetTunnelSlotNumber,
    pub CA_GetClusterState: CK_CA_GetClusterState,
    pub CA_LockClusteredSlot: CK_CA_LockClusteredSlot,
    pub CA_UnlockClusteredSlot: CK_CA_UnlockClusteredSlot,
    pub CA_LKMInitiatorChallenge: CK_CA_LKMInitiatorChallenge,
    pub CA_LKMReceiverResponse: CK_CA_LKMReceiverResponse,
    pub CA_LKMInitiatorComplete: CK_CA_LKMInitiatorComplete,
    pub CA_LKMReceiverComplete: CK_CA_LKMReceiverComplete,
    pub CA_ModifyUsageCount: CK_CA_ModifyUsageCount,
    pub CA_LogVerify: CK_CA_LogVerify,
    pub CA_LogVerifyFile: CK_CA_LogVerifyFile,
    pub CA_LogExternal: CK_CA_LogExternal,
    pub CA_LogImportSecret: CK_CA_LogImportSecret,
    pub CA_LogExportSecret: CK_CA_LogExportSecret,
    pub CA_LogSetConfig: CK_CA_LogSetConfig,
    pub CA_LogGetConfig: CK_CA_LogGetconfig,
    pub CA_LogEraseAll: CK_CA_LogEraseAll,
    pub CA_LogGetStatus: CK_CA_LogGetStatus,
    pub CA_InitAudit: CK_CA_InitAudit,
    pub CA_GetTime: CK_CA_GetTime,
    pub CA_TimeSync: CK_CA_TimeSync,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CK_SFNT_CA_FUNCTION_LIST"]
        [::std::mem::size_of::<CK_SFNT_CA_FUNCTION_LIST>() - 1344usize];
    ["Alignment of CK_SFNT_CA_FUNCTION_LIST"]
        [::std::mem::align_of::<CK_SFNT_CA_FUNCTION_LIST>() - 8usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::version"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, version) - 0usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetFunctionList"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetFunctionList) - 8usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_WaitForSlotEvent"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_WaitForSlotEvent) - 16usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InitIndirectToken"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InitIndirectToken) - 24usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InitIndirectPIN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InitIndirectPIN) - 32usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ResetPIN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ResetPIN) - 40usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CreateLoginChallenge"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CreateLoginChallenge) - 48usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_Deactivate"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_Deactivate) - 56usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_OpenSession"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_OpenSession) - 64usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_IndirectLogin"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_IndirectLogin) - 72usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InitializeRemotePEDVector"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InitializeRemotePEDVector) - 80usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_DeleteRemotePEDVector"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_DeleteRemotePEDVector) - 88usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetRemotePEDVectorStatus"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetRemotePEDVectorStatus) - 96usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ConfigureRemotePED"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ConfigureRemotePED) - 104usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_DismantleRemotePED"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_DismantleRemotePED) - 112usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_Restart"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_Restart) - 120usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_RestartForContainer"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_RestartForContainer) - 128usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloseApplicationID"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloseApplicationID) - 136usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloseApplicationIDForContainer"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_CloseApplicationIDForContainer
    ) - 144usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_OpenApplicationID"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_OpenApplicationID) - 152usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_OpenApplicationIDForContainer"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_OpenApplicationIDForContainer
    ) - 160usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetApplicationID"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetApplicationID) - 168usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ManualKCV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ManualKCV) - 176usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetLKCV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetLKCV) - 184usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetKCV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetKCV) - 192usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetCloningDomain"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetCloningDomain) - 200usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ClonePrivateKey"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ClonePrivateKey) - 208usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneObject"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneObject) - 216usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GenerateCloningKEV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GenerateCloningKEV) - 224usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneAsTargetInit"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneAsTargetInit) - 232usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneAsSource"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneAsSource) - 240usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneAsTarget"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneAsTarget) - 248usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetMofN) - 256usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GenerateMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GenerateMofN) - 264usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GenerateCloneableMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GenerateCloneableMofN) - 272usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ModifyMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ModifyMofN) - 280usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneMofN) - 288usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneModifyMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneModifyMofN) - 296usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ActivateMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ActivateMofN) - 304usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_DeactivateMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_DeactivateMofN) - 312usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetMofNStatus"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetMofNStatus) - 320usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_DuplicateMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_DuplicateMofN) - 328usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_IsMofNEnabled"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_IsMofNEnabled) - 336usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_IsMofNRequired"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_IsMofNRequired) - 344usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GenerateTokenKeys"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GenerateTokenKeys) - 352usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetTokenCertificateInfo"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetTokenCertificateInfo) - 360usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetTokenCertificateSignature"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_SetTokenCertificateSignature
    ) - 368usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetModuleList"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetModuleList) - 376usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetModuleInfo"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetModuleInfo) - 384usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LoadModule"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LoadModule) - 392usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LoadEncryptedModule"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LoadEncryptedModule) - 400usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_UnloadModule"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_UnloadModule) - 408usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_PerformModuleCall"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_PerformModuleCall) - 416usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::C_PerformSelfTest"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, C_PerformSelfTest) - 424usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_FirmwareUpdate"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_FirmwareUpdate) - 432usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_FirmwareRollback"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_FirmwareRollback) - 440usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CapabilityUpdate"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CapabilityUpdate) - 448usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetUserContainerNumber"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetUserContainerNumber) - 456usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetUserContainerName"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetUserContainerName) - 464usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetUserContainerName"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetUserContainerName) - 472usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetTokenInsertionCount"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetTokenInsertionCount) - 480usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetRollbackFirmwareVersion"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_GetRollbackFirmwareVersion
    ) - 488usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetFPV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetFPV) - 496usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetTPV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetTPV) - 504usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetExtendedTPV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetExtendedTPV) - 512usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetConfigurationElementDescription"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_GetConfigurationElementDescription
    )
        - 520usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetHSMCapabilitySet"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetHSMCapabilitySet) - 528usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetHSMCapabilitySetting"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetHSMCapabilitySetting) - 536usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetHSMPolicySet"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetHSMPolicySet) - 544usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetHSMPolicySetting"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetHSMPolicySetting) - 552usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerCapabilitySet"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetContainerCapabilitySet) - 560usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerCapabilitySetting"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_GetContainerCapabilitySetting
    ) - 568usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerPolicySet"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetContainerPolicySet) - 576usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerPolicySetting"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetContainerPolicySetting) - 584usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetTPV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetTPV) - 592usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetExtendedTPV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetExtendedTPV) - 600usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetHSMPolicy"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetHSMPolicy) - 608usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetHSMPolicies"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetHSMPolicies) - 616usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetDestructiveHSMPolicy"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetDestructiveHSMPolicy) - 624usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetDestructiveHSMPolicies"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetDestructiveHSMPolicies) - 632usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetContainerPolicy"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetContainerPolicy) - 640usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetContainerPolicies"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetContainerPolicies) - 648usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_RetrieveLicenseList"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_RetrieveLicenseList) - 656usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_QueryLicense"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_QueryLicense) - 664usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerStatus"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetContainerStatus) - 672usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetSessionInfo"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetSessionInfo) - 680usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ReadCommonStore"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ReadCommonStore) - 688usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_WriteCommonStore"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_WriteCommonStore) - 696usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetPrimarySlot"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetPrimarySlot) - 704usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetSecondarySlot"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetSecondarySlot) - 712usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SwitchSecondarySlot"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SwitchSecondarySlot) - 720usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloseSecondarySession"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloseSecondarySession) - 728usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloseAllSecondarySessions"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloseAllSecondarySessions) - 736usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ChoosePrimarySlot"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ChoosePrimarySlot) - 744usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ChooseSecondarySlot"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ChooseSecondarySlot) - 752usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneObjectToAllSessions"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneObjectToAllSessions) - 760usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CloneAllObjectsToSession"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CloneAllObjectsToSession) - 768usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ResetDevice"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ResetDevice) - 776usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_FactoryReset"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_FactoryReset) - 784usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetPedId"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetPedId) - 792usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetPedId"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetPedId) - 800usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SpRawRead"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SpRawRead) - 808usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SpRawWrite"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SpRawWrite) - 816usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CheckOperationState"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CheckOperationState) - 824usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_DestroyMultipleObjects"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_DestroyMultipleObjects) - 832usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_HAInit"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_HAInit) - 840usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_HAGetMasterPublic"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_HAGetMasterPublic) - 848usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_HAGetLoginChallenge"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_HAGetLoginChallenge) - 856usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_HAAnswerLoginChallenge"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_HAAnswerLoginChallenge) - 864usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_HALogin"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_HALogin) - 872usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_HAAnswerMofNChallenge"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_HAAnswerMofNChallenge) - 880usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_HAActivateMofN"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_HAActivateMofN) - 888usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetHAState"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetHAState) - 896usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetTokenCertificates"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetTokenCertificates) - 904usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ExtractMaskedObject"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ExtractMaskedObject) - 912usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InsertMaskedObject"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InsertMaskedObject) - 920usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_MultisignValue"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_MultisignValue) - 928usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SIMExtract"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SIMExtract) - 936usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SIMInsert"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SIMInsert) - 944usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SIMMultiSign"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SIMMultiSign) - 952usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_Extract"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_Extract) - 960usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_Insert"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_Insert) - 968usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetObjectUID"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetObjectUID) - 976usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetObjectHandle"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetObjectHandle) - 984usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_DeleteContainer"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_DeleteContainer) - 992usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_MTKSetStorage"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_MTKSetStorage) - 1000usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_MTKRestore"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_MTKRestore) - 1008usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_MTKResplit"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_MTKResplit) - 1016usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_MTKZeroize"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_MTKZeroize) - 1024usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_MTKGetState"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_MTKGetState) - 1032usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetTSV"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetTSV) - 1040usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InvokeServiceInit"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InvokeServiceInit) - 1048usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InvokeService"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InvokeService) - 1056usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InvokeServiceFinal"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InvokeServiceFinal) - 1064usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InvokeServiceAsynch"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InvokeServiceAsynch) - 1072usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InvokeServiceSinglePart"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InvokeServiceSinglePart) - 1080usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_EncodeECPrimeParams"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_EncodeECPrimeParams) - 1088usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_EncodeECChar2Params"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_EncodeECChar2Params) - 1096usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_EncodeECParamsFromFile"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_EncodeECParamsFromFile) - 1104usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetHSMStorageInformation"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetHSMStorageInformation) - 1112usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerStorageInformation"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_GetContainerStorageInformation
    ) - 1120usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_SetContainerSize"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_SetContainerSize) - 1128usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_CreateContainer"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_CreateContainer) - 1136usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_DeleteContainerWithHandle"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_DeleteContainerWithHandle
    ) - 1144usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerList"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetContainerList) - 1152usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetContainerName"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetContainerName) - 1160usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetNumberOfAllowedContainers"][::std::mem::offset_of!(
        CK_SFNT_CA_FUNCTION_LIST,
        CA_GetNumberOfAllowedContainers
    ) - 1168usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetTunnelSlotNumber"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetTunnelSlotNumber) - 1176usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetClusterState"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetClusterState) - 1184usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LockClusteredSlot"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LockClusteredSlot) - 1192usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_UnlockClusteredSlot"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_UnlockClusteredSlot) - 1200usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LKMInitiatorChallenge"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LKMInitiatorChallenge) - 1208usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LKMReceiverResponse"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LKMReceiverResponse) - 1216usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LKMInitiatorComplete"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LKMInitiatorComplete) - 1224usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LKMReceiverComplete"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LKMReceiverComplete) - 1232usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_ModifyUsageCount"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_ModifyUsageCount) - 1240usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogVerify"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogVerify) - 1248usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogVerifyFile"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogVerifyFile) - 1256usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogExternal"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogExternal) - 1264usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogImportSecret"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogImportSecret) - 1272usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogExportSecret"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogExportSecret) - 1280usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogSetConfig"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogSetConfig) - 1288usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogGetConfig"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogGetConfig) - 1296usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogEraseAll"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogEraseAll) - 1304usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_LogGetStatus"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_LogGetStatus) - 1312usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_InitAudit"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_InitAudit) - 1320usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_GetTime"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_GetTime) - 1328usize];
    ["Offset of field: CK_SFNT_CA_FUNCTION_LIST::CA_TimeSync"]
        [::std::mem::offset_of!(CK_SFNT_CA_FUNCTION_LIST, CA_TimeSync) - 1336usize];
};
